slawa01de-prog/ESP32-BMP280-Datenlogger/Esp32_LCD_Datalogger/Esp32_LCD_Datalogger.ino

/*
  BMP280 Logger V7.4.3 Full MultiNode Hybrid - WebGUI OTA MQTT HA

  Ziel:
  - Alle Logger-Funktionen aus V5 wieder drin
  - MultiNode Secure Pairing / Sensor / Gateway / Hybrid drin
  - Lokales OLED-Menü mit Encoder/Tasten
  - Windows GUI kompatible NODEDATA Ausgabe
  - Sensor kann alleine laufen, Gateway sein oder Hybrid am PC
  - DeepSleep für Batterie-Logger
  - USB Auto Normal
  - CSV Logging lokal und Gateway-CSV pro Node
  - WebGUI lokal im WLAN/AP mit Login
  - OTA Firmware Update ueber Browser

  Hardware:
  - ESP32-C3
  - SH1106 OLED 128x64 I2C 0x3C
  - BMP280 I2C 0x76
  - Encoder/Tasten:
      ENCODER_TRA   GPIO0
      ENCODER_TRB   GPIO1
      ENCODER_PUSH  GPIO3
      BAK           GPIO4
      CONTR         GPIO5

  Arduino IDE:
  - Board: ESP32C3 Dev Module
  - USB CDC On Boot: Enabled
  - Partition Scheme: Default 4MB with spiffs oder OTA-faehiges Schema

  Libraries:
  - U8g2
  - Adafruit BMP280 Library
  - Adafruit Unified Sensor
  - PubSubClient by Nick O'Leary fuer MQTT/Home Assistant
  - WebServer/Update sind im ESP32 Boardpaket enthalten
*/

#include <Arduino.h>
// USB console integrated for single-file installation.

// Main-loop-only console. Complete lines are queued before any bytes are sent.
// A missing/slow host must never hold up measurement, keys or OLED updates.
class LoggerConsole : public Print {
 public:
  using Print::write;
  size_t write(uint8_t c) override { return write(&c, 1); }
  size_t write(const uint8_t *data, size_t size) override {
    for (size_t i = 0; i < size; ++i) {
      uint8_t c = data[i];
      if (!lineOverflow) {
        if (lineUsed < sizeof(line)) line[lineUsed++] = c;
        else lineOverflow = true;
      }
      if (c == '\n') {
        if (!lineOverflow && lineUsed <= freeBytes()) {
          for (size_t j = 0; j < lineUsed; ++j) {
            queue[tail] = line[j];
            tail = (tail + 1) % sizeof(queue);
          }
          used += lineUsed;
        } else ++dropped;
        lineUsed = 0;
        lineOverflow = false;
      }
    }
    // Diagnostics may be dropped offline; authoritative data remains in LittleFS.
    return size;
  }
  size_t freeBytes() const { return sizeof(queue) - used; }
  uint32_t droppedLines() const { return dropped; }
  template<class Transport> void pump(Transport &out) {
    if (!used) return;
    int room = out.availableForWrite();
    if (room <= 0) return;
    size_t n = used;
    if (n > 256) n = 256;  // bounded work, one transport write per call
    if (n > (size_t)room) n = (size_t)room;
    if (n > sizeof(queue) - head) n = sizeof(queue) - head;
    size_t sent = out.write(queue + head, n);
    if (sent > n) sent = n;
    head = (head + sent) % sizeof(queue);
    used -= sent;  // retain unsent bytes after a short write
  }
 private:
  uint8_t queue[8192] = {};
  uint8_t line[1024] = {};
  size_t head = 0, tail = 0, used = 0, lineUsed = 0;
  bool lineOverflow = false;
  uint32_t dropped = 0;
};

LoggerConsole loggerConsole;
#include <Wire.h>
#include <WiFi.h>
#define MQTT_MAX_PACKET_SIZE 1024
#include <PubSubClient.h>
#define BMP_HAS_MQTT 1
#include <WebServer.h>
#include <Update.h>
// V7.4.3: use IP access; omit mDNS to fit the standard OTA slot with Core 3.3.11.
#include <esp_now.h>
#include <LittleFS.h>
#include <Preferences.h>
#include <U8g2lib.h>
#include <Adafruit_Sensor.h>
#include <Adafruit_BMP280.h>
#include <esp_sleep.h>
#include <driver/gpio.h>
#include <math.h>
#include <time.h>
#include <sys/time.h>
#include <esp_timer.h>
#include <esp_wifi.h>
#include <freertos/FreeRTOS.h>
#include <freertos/queue.h>

#if __has_include(<esp_arduino_version.h>)
  #include <esp_arduino_version.h>
#endif

// --------------------------------------------------
// Version / Netzwerk
// --------------------------------------------------
#define FW_VERSION "V7.4.3"
#define PROTO_VERSION 3 // V74 acknowledged packets: update all nodes/gateway together
// Public example only: set the same private secret on your own nodes before pairing.
#define PAIR_SECRET "EXAMPLE-CHANGE-THIS-PAIR-SECRET"

#define NODE_TYPE 'B'
#define MFG_YEAR 2026
#define MFG_DAY_OF_YEAR 184
#define FW_FAMILY 'F'

// --------------------------------------------------
// Hardware
// --------------------------------------------------
#define I2C_SDA_PIN 8
#define I2C_SCL_PIN 9

#define PIN_ENC_A     0
#define PIN_ENC_B     1
#define PIN_ENC_PUSH  3
#define PIN_BAK       4
#define PIN_CONTR     5

#define OLED_ADDR_8BIT (0x3C * 2)
#define BMP280_ADDR 0x76

// --------------------------------------------------
// Betriebsmodi
// --------------------------------------------------
#define MODE_SENSOR   0
#define MODE_GATEWAY  1
#define MODE_HYBRID   2

#define POWER_NORMAL  0
#define POWER_ECO     1
#define POWER_DEEP    2

#define PT_PAIR_REQ    1
#define PT_PAIR_ACCEPT 2
#define PT_DATA        3
#define PT_CMD         4

#define MAX_TRUSTED 20
#define MAX_PENDING 10

const char *LOCAL_LOG_FILE = "/local_v74.csv";

uint8_t broadcastAddress[] = {0xFF,0xFF,0xFF,0xFF,0xFF,0xFF};

U8G2_SH1106_128X64_NONAME_F_HW_I2C oled(U8G2_R0, U8X8_PIN_NONE);
Adafruit_BMP280 bmp;
Preferences prefs;

// --------------------------------------------------
// Config
// --------------------------------------------------
struct Config {
  uint8_t mode;
  uint8_t powerMode;
  bool loggingEnabled;
  bool liveOutput;

  uint32_t intervalSec;
  float maxDays;

  float tempOffsetC;
  float pressureOffsetHpa;

  uint8_t screenMode;    // 0 Auto, 1 Dashboard, 2 Temp, 3 Graph, 4 Pressure, 5 Storage, 6 Cal, 7 Net, 8 Power
  uint8_t graphMode;     // 0 Temp, 1 Druck
  uint8_t graphWindow;   // 0=1h, 1=6h, 2=12h, 3=24h
  uint8_t contrast;

  uint16_t displayTimeoutSec;
  uint16_t wakeDisplaySec;
  bool usbAutoNormal;
  uint8_t usbWindowSec;

  bool pairMode;
  bool paired;
  uint8_t gatewayMac[6];

  char nodeId[11];
  char nodeName[16];
  uint8_t language;       // 0 = DE, 1 = EN

  bool webEnabled;
  char wifiSsid[33];
  char wifiPass[65];
  char webUser[17];
  char webPass[33];
  char webHost[33];

