slawa01de-prog/ESP32-BMP280-Datenlogger/Esp32_LCD_Datalogger/Esp32_LCD_Datalogger.ino
  bool mqttEnabled;
  bool mqttDiscovery;
  char mqttHost[65];
  uint16_t mqttPort;
  char mqttUser[33];
  char mqttPass[33];
  char mqttPrefix[33];
};

Config cfg;
RTC_DATA_ATTR uint32_t rtcMagic = 0;
RTC_DATA_ATTR uint32_t sessionId = 0;
RTC_DATA_ATTR uint32_t sampleSequence = 0;
RTC_DATA_ATTR uint64_t elapsedBaseMs = 0;
bool fsReady = false;
bool storageFault = false;
bool sensorValid = false;
bool sampleStored = false;
String storageMessage = "OK";
uint32_t rxDropped = 0;
uint32_t lastSensorRetryMs = 0;
uint32_t lastChannelTryMs = 0;
uint32_t lastGoodRxMs = 0;
RTC_DATA_ATTR uint32_t radioCursor = 0;
RTC_DATA_ATTR uint32_t cachedLogRows=0;
RTC_DATA_ATTR uint32_t cachedLogBytes=0;
RTC_DATA_ATTR uint8_t missedRadioWakes = 0;
uint8_t radioChannel = 1;
uint32_t lastRxSession[MAX_TRUSTED] = {};
uint32_t lastRxSequence[MAX_TRUSTED] = {};

uint32_t sampleAtMs = 0;
uint64_t sampleElapsed = 0;
uint64_t sampleEpoch = 0;
const size_t STORAGE_RESERVE = 16384;


// --------------------------------------------------
// Trusted / Pending
// --------------------------------------------------
struct TrustedNode {
  bool used;
  char id[11];
  uint8_t mac[6];
  char name[16];
  uint32_t lastLog;
  uint32_t packets;
  uint32_t lastSeenMs;
};

struct PendingNode {
  bool used;
  char id[11];
  char fw[8];
  uint8_t mac[6];
  uint32_t lastSeenMs;
};

TrustedNode trusted[MAX_TRUSTED];
PendingNode pendingNodes[MAX_PENDING];
uint32_t nodeTimeoutMs[MAX_TRUSTED] = {};
bool nodeOnline[MAX_TRUSTED] = {};


// --------------------------------------------------
// Pakete
// --------------------------------------------------
struct __attribute__((packed)) PairReqPacket {
  char magic[4];        // BPN2
  uint8_t proto;
  uint8_t type;
  char id[11];
  char fw[8];
  uint8_t mac[6];
  uint32_t nonce;
};

struct __attribute__((packed)) PairAcceptPacket {
  char magic[4];
  uint8_t proto;
  uint8_t type;
  char id[11];
  uint8_t nodeMac[6];
  uint8_t gatewayMac[6];
  uint32_t token;
};

struct __attribute__((packed)) DataPacket {
  char magic[4];
  uint8_t proto;
  uint8_t type;
  char id[11];
  char name[16];
  char fw[8];
  uint8_t mac[6];
  uint32_t logNo;
  uint32_t ms;
  float rawTempC;
  float tempC;
  float rawPressureHpa;
  float pressureHpa;
  float tempOffsetC;
  float pressureOffsetHpa;
  uint8_t mode;
  uint8_t powerMode;
  uint8_t wakeCause;
  uint8_t flags; // bit0 logging enabled; bit1 valid sensor; bit2 stored locally
  uint32_t sequence;
  uint32_t session;
  uint64_t elapsedMs;
  uint64_t epochMs;
  uint32_t intervalSec;
};

struct __attribute__((packed)) CommandPacket {
  char magic[4];
  uint8_t proto;
  uint8_t type;
  char id[11];
  uint8_t command;
  float value;
  uint32_t token;
};

struct __attribute__((packed)) AckPacket {
  char magic[4]; uint8_t proto; uint8_t type; char id[11]; uint32_t session; uint32_t sequence;
};
DataPacket radioPending = {};
bool radioWaiting = false;
uint32_t radioNextCursor = 0;
uint32_t radioLastSend = 0;
uint8_t radioTries = 0;
uint32_t radioConfirmed = 0;
struct RxEnvelope { uint8_t source[6]; uint16_t length; uint8_t bytes[250]; };
QueueHandle_t rxQueue = nullptr;
File syncFile;
int syncSlot = -2;
bool syncAll = false;
uint32_t syncRemaining = 0;
String syncLine;
File dumpStream;

// --------------------------------------------------
// Messwerte / Status
// --------------------------------------------------
float rawTempC = NAN;
float tempC = NAN;
float rawPressureHpa = NAN;
float pressureHpa = NAN;

float minTempC = NAN;
float maxTempC = NAN;
float minPressureHpa = NAN;
float maxPressureHpa = NAN;

uint32_t readCount = 0;
uint32_t logCount = 0;

bool oledOk = false;
bool bmpOk = false;
bool displayOn = true;

unsigned long lastReadMs = 0;
unsigned long lastLogMs = 0;
unsigned long lastDisplayMs = 0;
unsigned long lastAutoPageMs = 0;
unsigned long lastUserActionMs = 0;
unsigned long lastPairBroadcastMs = 0;
unsigned long lastWebStatusMs = 0;

WebServer webServer(80);
bool webRunning = false;
bool webRoutesConfigured = false;
String webLastUpdateError = "";

#if BMP_HAS_MQTT
WiFiClient mqttWifiClient;
PubSubClient mqttClient(mqttWifiClient);
#endif
bool mqttConnected = false;
bool mqttDiscoverySent = false;
uint32_t mqttPublishFailures=0;
uint32_t lastDiscoveryTryMs=0;
String mqttLastState = "MQTT off";
unsigned long lastMqttAttemptMs = 0;
unsigned long lastMqttPublishMs = 0;

uint8_t autoPage = 0;
esp_sleep_wakeup_cause_t wakeCause;

// --------------------------------------------------
// OLED-History
// --------------------------------------------------
// GRAPH743_BEGIN
struct HourPoint {
  uint64_t timeMs = 0;
  float temperature = NAN, pressure = NAN;
  bool valid = false;
};
class HourHistory {
 public:
  static const uint16_t CAPACITY = 1441;
  void add(uint64_t now, float temperature, float pressure) {
    HourPoint &point = points[(now / 60000ULL) % CAPACITY];
    point.timeMs = now; point.temperature = temperature; point.pressure = pressure;
    point.valid = true;
  }
  const HourPoint *atAge(uint64_t now, uint16_t minutes) const {
    uint64_t current = now / 60000ULL;
    if (minutes > current || minutes >= CAPACITY) return nullptr;
    uint64_t wanted = current - minutes;
    const HourPoint &point = points[wanted % CAPACITY];
    if (!point.valid || point.timeMs / 60000ULL != wanted || point.timeMs > now) return nullptr;
    return &point;
  }
  void clear() { for (auto &point : points) point.valid = false; }
 private:
  HourPoint points[CAPACITY];
};
// GRAPH743_END
HourHistory hourHistory;
const uint8_t graphHours[4] = {1, 6, 12, 24};

#define HISTORY_SIZE 96
float tempHistory[HISTORY_SIZE];
float pressHistory[HISTORY_SIZE];
uint8_t historyIndex = 0;
uint8_t historyCount = 0;

// --------------------------------------------------
// UI
// --------------------------------------------------
enum UiMode {
  UI_DASHBOARD,
  UI_MENU,
  UI_EDIT_INTERVAL,
  UI_EDIT_MAXDAYS,
  UI_EDIT_TIMEOUT,
  UI_EDIT_WAKE_DISPLAY,
  UI_EDIT_USB_WINDOW,
  UI_EDIT_TEMP_OFFSET,
  UI_EDIT_PRESS_OFFSET,
  UI_CONFIRM_CLEAR
};

UiMode uiMode = UI_DASHBOARD;
int menuIndex = 0;
int editValue = 0;
float editFloat = 0.0f;

const char *menuItemsDe[] = {
  "Zurueck",
  "Logging Start/Stop",
  "1x Messung loggen",
  "Intervall",
  "Max Tage",
  "Kalibrierung Temp",
  "Kalibrierung Druck",
  "Power Mode",
  "Display Timeout",
  "Wake Display",
  "USB Auto Normal",
  "USB Window",
  "USB Live",
  "Screen",
  "Graph",
  "Mode Sensor/GW/Hybrid",
  "Pairing AN/AUS",
  "Pair Code",
  "Pair Reset",
  "Reset Statistik",
  "Log loeschen",
  "Sprache DE/EN"
};

const char *menuItemsEn[] = {
  "Back",
  "Start/Stop Log",
  "Log 1 Sample",
  "Interval",
  "Max Days",
  "Temp Cal",
  "Pressure Cal",
  "Power Mode",
  "Display Timeout",
  "Wake Display",
  "USB Auto Normal",
  "USB Window",
  "USB Live",
  "Screen",
  "Graph",
  "Mode Sensor/GW/Hyb",
  "Pairing ON/OFF",
  "Pair Code",
  "Pair Reset",
  "Reset Stats",
  "Clear Log",
  "Language DE/EN"
};

const int MENU_COUNT = sizeof(menuItemsDe) / sizeof(menuItemsDe[0]);
const char *menuItemText(int idx) {
  if (idx < 0 || idx >= MENU_COUNT) return "";
  return cfg.language == 1 ? menuItemsEn[idx] : menuItemsDe[idx];
}
const char *languageCode() {
  return cfg.language == 1 ? "en" : "de";
}
const char *languageLabel() {
  return cfg.language == 1 ? "English" : "Deutsch";
}

String lastEvent = "Bereit";

// --------------------------------------------------
// Buttons / Encoder
// --------------------------------------------------
const uint32_t BUTTON_DEBOUNCE_MS = 50;
const uint32_t ENCODER_DEBOUNCE_US = 800;

struct DebouncedButton {
  const char *name;
  uint8_t pin;
  bool stableState;
  bool lastRawState;
  uint32_t lastChangeMs;
  bool pressedEvent;
  bool releasedEvent;
};

DebouncedButton btnPush = {"ENC_PUSH", PIN_ENC_PUSH, HIGH, HIGH, 0, false, false};
DebouncedButton btnBak  = {"BAK",      PIN_BAK,      HIGH, HIGH, 0, false, false};
DebouncedButton btnCon  = {"CONTR",    PIN_CONTR,    HIGH, HIGH, 0, false, false};

int8_t encoderDelta = 0;
uint8_t lastEncoderState = 0;
int8_t encoderAccumulator = 0;
uint32_t lastEncoderChangeUs = 0;

const int8_t encoderTable[16] = {
   0, -1,  1,  0,
   1,  0,  0, -1,
  -1,  0,  0,  1,
   0,  1, -1,  0
};

// --------------------------------------------------
// Explizite Funktions-Prototypen
// Wichtig für Arduino-IDE Preprocessor bei eigenen Struct-Typen
// --------------------------------------------------
void updateButton(DebouncedButton &btn);
void handleIncoming(const uint8_t *data, int len, const uint8_t *source);
String packetLine(const DataPacket &p);
DataPacket localPacket();
bool appendPacket(const String &path, const DataPacket &p);
void mqttDisconnect();
void serviceRadioSpool();
bool parseJournal(const String &line, DataPacket &p);
void acknowledgePacket(const DataPacket &p);
void sendOledIfChanged();
String mqttBaseTopic(const String &id);

void printAck(const String &cmd, const String &msg = "OK");
void printErr(const String &cmd, const String &msg);
void printStatusData();
void logLocal(bool force = false);
void wakeDisplay(const String &reason);
void handleSetCommand(String cmd);
void handleCalCommand(String cmd);
void setupWebIfAllowed();
void handleWeb();
void stopWebServer();
void printWebStatus();
void handleMqtt();
void printMqttStatus();
void mqttPublishLocalState(bool force = false);
void mqttPublishPacketState(const DataPacket &p);
void mqttPublishDiscoveryAll();


// --------------------------------------------------
// Role helpers
// --------------------------------------------------
bool isGatewayRole() {
  return cfg.mode == MODE_GATEWAY || cfg.mode == MODE_HYBRID;
}

bool isSensorRole() {
  return cfg.mode == MODE_SENSOR || cfg.mode == MODE_HYBRID;
}

// --------------------------------------------------
// Helpers
// --------------------------------------------------
char b36Digit(uint8_t v) {
  if (v < 10) return '0' + v;
  return 'A' + (v - 10);
}

void base36N(uint32_t value, uint8_t digits, char *out) {
  for (int i = digits - 1; i >= 0; i--) {
    out[i] = b36Digit(value % 36);
    value /= 36;
  }
  out[digits] = 0;
}

uint32_t fnv1a(const uint8_t *data, size_t len) {
  uint32_t h = 2166136261UL;
  for (size_t i = 0; i < len; i++) {
    h ^= data[i];
    h *= 16777619UL;
  }
  return h;
}

uint32_t hashString(const String &s) {
  return fnv1a((const uint8_t*)s.c_str(), s.length());
}

String macToString(const uint8_t mac[6]) {
  char buf[18];
  snprintf(buf, sizeof(buf), "%02X:%02X:%02X:%02X:%02X:%02X",
           mac[0], mac[1], mac[2], mac[3], mac[4], mac[5]);
  return String(buf);
}

