slawa01de-prog/ESP32-BMP280-Datenlogger/Esp32_LCD_Datalogger/Esp32_LCD_Datalogger.ino
bool macEqual(const uint8_t a[6], const uint8_t b[6]) {
  for (int i = 0; i < 6; i++) {
    if (a[i] != b[i]) return false;
  }
  return true;
}

String cleanInput(String s) {
  s.trim();
  return s;
}

float parseFloatValue(String s) {
  s = cleanInput(s);
  s.replace(",", ".");
  return s.toFloat();
}

String uptimeString() {
  uint32_t total = millis() / 1000;
  uint32_t h = total / 3600;
  uint32_t m = (total % 3600) / 60;
  uint32_t s = total % 60;
  char buf[20];
  snprintf(buf, sizeof(buf), "%02lu:%02lu:%02lu",
           (unsigned long)h, (unsigned long)m, (unsigned long)s);
  return String(buf);
}

const char* modeName() {
  if (cfg.mode == MODE_GATEWAY) return "GATEWAY";
  if (cfg.mode == MODE_HYBRID) return "HYBRID";
  return "SENSOR";
}

const char* powerName() {
  if (cfg.powerMode == POWER_DEEP) return "DEEP";
  if (cfg.powerMode == POWER_ECO) return "ECO";
  return "NORMAL";
}

const char* wakeCauseName() {
  switch (wakeCause) {
    case ESP_SLEEP_WAKEUP_TIMER: return "TIMER";
    case ESP_SLEEP_WAKEUP_GPIO: return "GPIO";
    case ESP_SLEEP_WAKEUP_UNDEFINED: return "POWERON";
    default: return "OTHER";
  }
}

void setEvent(const String &msg) {
  lastEvent = msg;
  loggerConsole.println(msg);
}

void updateMinMax(float value, float &minValue, float &maxValue) {
  if (isnan(value)) return;
  if (isnan(minValue) || value < minValue) minValue = value;
  if (isnan(maxValue) || value > maxValue) maxValue = value;
}

float clampFloat(float v, float lo, float hi) {
  if (v < lo) return lo;
  if (v > hi) return hi;
  return v;
}

uint32_t getMaxSamples() {
  float samples = (cfg.maxDays * 24.0f * 60.0f * 60.0f) / (float)cfg.intervalSec;
  if (samples < 1.0f) samples = 1.0f;
  return (uint32_t)samples;
}

float getLogProgressPercent() {
  uint32_t maxSamples = getMaxSamples();
  if (maxSamples == 0) return 0;
  return ((float)logCount / (float)maxSamples) * 100.0f;
}

float getRemainingDaysBySampleLimit() {
  uint32_t maxSamples = getMaxSamples();
  if (logCount >= maxSamples) return 0.0f;
  uint32_t remainingSamples = maxSamples - logCount;
  return (remainingSamples * (float)cfg.intervalSec) / 86400.0f;
}

size_t getFileSize(const char *fileName) {
  if (!LittleFS.exists(fileName)) return 0;
  File f = LittleFS.open(fileName, "r");
  if (!f) return 0;
  size_t s = f.size();
  f.close();
  return s;
}

// --------------------------------------------------
// ID / Pairing
// --------------------------------------------------
void makeNodeId(char out[11]) {
  uint8_t mac[6];
  WiFi.macAddress(mac);

  int yearCode = MFG_YEAR - 2020;
  if (yearCode < 0) yearCode = 0;
  if (yearCode > 35) yearCode %= 36;

  char dayCode[4];
  char hashCode[5];

  base36N((uint32_t)MFG_DAY_OF_YEAR, 3, dayCode);
  uint32_t h = fnv1a(mac, 6);
  base36N(h % 1679616UL, 4, hashCode); // 36^4

  out[0] = NODE_TYPE;
  out[1] = b36Digit(yearCode);
  out[2] = dayCode[0];
  out[3] = dayCode[1];
  out[4] = dayCode[2];
  out[5] = FW_FAMILY;
  out[6] = hashCode[0];
  out[7] = hashCode[1];
  out[8] = hashCode[2];
  out[9] = hashCode[3];
  out[10] = 0;
}

uint32_t pairingCodeFor(const char *id, const uint8_t mac[6]) {
  String s = String(PAIR_SECRET) + "|" + String(id) + "|" + macToString(mac);
  return hashString(s) % 1000000UL;
}

uint32_t pairingTokenFor(const char *id, const uint8_t nodeMac[6], const uint8_t gatewayMac[6], uint32_t code) {
  String s = String(PAIR_SECRET) + "|TOKEN|" + String(id) + "|" + macToString(nodeMac) + "|" + macToString(gatewayMac) + "|" + String(code);
  return hashString(s);
}

void makeLmkFor(const char *id, const uint8_t nodeMac[6], uint8_t lmk[16]) {
  String s = String(PAIR_SECRET) + "|LMK|" + String(id) + "|" + macToString(nodeMac);
  uint32_t h1 = hashString(s + "|1");
  uint32_t h2 = hashString(s + "|2");
  uint32_t h3 = hashString(s + "|3");
  uint32_t h4 = hashString(s + "|4");
  memcpy(lmk + 0, &h1, 4);
  memcpy(lmk + 4, &h2, 4);
  memcpy(lmk + 8, &h3, 4);
  memcpy(lmk + 12, &h4, 4);
}

// --------------------------------------------------
// Config speichern/laden
// --------------------------------------------------
void saveConfig() {
  prefs.putUChar("mode", cfg.mode);
  prefs.putUChar("power", cfg.powerMode);
  prefs.putBool("logging", cfg.loggingEnabled);
  prefs.putBool("live", cfg.liveOutput);
  prefs.putUInt("interval", cfg.intervalSec);
  prefs.putFloat("maxdays", cfg.maxDays);
  prefs.putFloat("toffset", cfg.tempOffsetC);
  prefs.putFloat("poffset", cfg.pressureOffsetHpa);
  prefs.putUChar("screen", cfg.screenMode);
  prefs.putUChar("graph", cfg.graphMode);
  prefs.putUChar("graphwin", cfg.graphWindow);
  prefs.putUChar("contrast", cfg.contrast);
  prefs.putUShort("dto", cfg.displayTimeoutSec);
  prefs.putUShort("wds", cfg.wakeDisplaySec);
  prefs.putBool("usbauto", cfg.usbAutoNormal);
  prefs.putUChar("usbwin", cfg.usbWindowSec);
  prefs.putBool("pairmode", cfg.pairMode);
  prefs.putBool("paired", cfg.paired);
  prefs.putBytes("gwmac", cfg.gatewayMac, 6);
  prefs.putString("nodeid", cfg.nodeId);
  prefs.putString("nodename", cfg.nodeName);
  prefs.putUChar("lang", cfg.language);
  prefs.putBool("weben", cfg.webEnabled);
  prefs.putString("wssid", cfg.wifiSsid);
  prefs.putString("wpass", cfg.wifiPass);
  prefs.putString("webuser", cfg.webUser);
  prefs.putString("webpass", cfg.webPass);
  prefs.putString("webhost", cfg.webHost);
  prefs.putBool("mqtten", cfg.mqttEnabled);
  prefs.putBool("mqtdisc", cfg.mqttDiscovery);
  prefs.putString("mqtthost", cfg.mqttHost);
  prefs.putUShort("mqttport", cfg.mqttPort);
  prefs.putString("mqttuser", cfg.mqttUser);
  prefs.putString("mqttpass", cfg.mqttPass);
  prefs.putString("mqttprefix", cfg.mqttPrefix);
}

void factoryDefaults() {
  cfg.mode = MODE_HYBRID;
  cfg.powerMode = POWER_NORMAL;
  cfg.loggingEnabled = true;
  cfg.liveOutput = true;
  cfg.intervalSec = 60;
  cfg.maxDays = 7.0f;
  cfg.tempOffsetC = 0.0f;
  cfg.pressureOffsetHpa = 0.0f;
  cfg.screenMode = 0;
  cfg.graphMode = 0;
  cfg.graphWindow = 0;
  cfg.contrast = 180;
  cfg.displayTimeoutSec = 0;
  cfg.wakeDisplaySec = 20;
  cfg.usbAutoNormal = true;
  cfg.usbWindowSec = 2;
  cfg.pairMode = false;
  cfg.paired = false;
  memset(cfg.gatewayMac, 0, 6);
  makeNodeId(cfg.nodeId);
  strncpy(cfg.nodeName, "Logger", sizeof(cfg.nodeName)-1);
  cfg.language = 0;
  cfg.webEnabled = true;
  memset(cfg.wifiSsid, 0, sizeof(cfg.wifiSsid));
  memset(cfg.wifiPass, 0, sizeof(cfg.wifiPass));
  strncpy(cfg.webUser, "admin", sizeof(cfg.webUser)-1);
  strncpy(cfg.webPass, "admin", sizeof(cfg.webPass)-1);
  strncpy(cfg.webHost, "bmp280-logger", sizeof(cfg.webHost)-1);
  cfg.mqttEnabled = false;
  cfg.mqttDiscovery = true;
  memset(cfg.mqttHost, 0, sizeof(cfg.mqttHost));
  cfg.mqttPort = 1883;
  memset(cfg.mqttUser, 0, sizeof(cfg.mqttUser));
  memset(cfg.mqttPass, 0, sizeof(cfg.mqttPass));
  strncpy(cfg.mqttPrefix, "bmp280", sizeof(cfg.mqttPrefix)-1);
  saveConfig();
}

void loadConfig() {
  prefs.begin("logger_v6", false);

