slawa01de-prog/ESP32-BMP280-Datenlogger/Esp32_LCD_Datalogger/Esp32_LCD_Datalogger.ino
  cfg.mode = prefs.getUChar("mode", MODE_HYBRID);
  cfg.powerMode = prefs.getUChar("power", POWER_NORMAL);
  cfg.loggingEnabled = prefs.getBool("logging", true);
  cfg.liveOutput = prefs.getBool("live", true);
  cfg.intervalSec = prefs.getUInt("interval", 60);
  cfg.maxDays = prefs.getFloat("maxdays", 7.0f);
  cfg.tempOffsetC = prefs.getFloat("toffset", 0.0f);
  cfg.pressureOffsetHpa = prefs.getFloat("poffset", 0.0f);
  cfg.screenMode = prefs.getUChar("screen", 0);
  cfg.graphMode = prefs.getUChar("graph", 0);
  cfg.graphWindow = prefs.getUChar("graphwin", 0);
  cfg.contrast = prefs.getUChar("contrast", 180);
  cfg.displayTimeoutSec = prefs.getUShort("dto", 0);
  cfg.wakeDisplaySec = prefs.getUShort("wds", 20);
  cfg.usbAutoNormal = prefs.getBool("usbauto", true);
  cfg.usbWindowSec = prefs.getUChar("usbwin", 2);
  cfg.pairMode = prefs.getBool("pairmode", false);
  cfg.paired = prefs.getBool("paired", false);

  memset(cfg.gatewayMac, 0, 6);
  prefs.getBytes("gwmac", cfg.gatewayMac, 6);

  String sid = prefs.getString("nodeid", "");
  if (sid.length() == 10) strncpy(cfg.nodeId, sid.c_str(), sizeof(cfg.nodeId)-1);
  else {
    makeNodeId(cfg.nodeId);
    prefs.putString("nodeid", cfg.nodeId);
  }

  String n = prefs.getString("nodename", "Logger");
  memset(cfg.nodeName, 0, sizeof(cfg.nodeName));
  strncpy(cfg.nodeName, n.c_str(), sizeof(cfg.nodeName)-1);

  cfg.language = prefs.getUChar("lang", 0);
  if (cfg.language > 1) cfg.language = 0;

  cfg.webEnabled = prefs.getBool("weben", true);
  String ws = prefs.getString("wssid", "");
  memset(cfg.wifiSsid, 0, sizeof(cfg.wifiSsid));
  strncpy(cfg.wifiSsid, ws.c_str(), sizeof(cfg.wifiSsid)-1);
  String wp = prefs.getString("wpass", "");
  memset(cfg.wifiPass, 0, sizeof(cfg.wifiPass));
  strncpy(cfg.wifiPass, wp.c_str(), sizeof(cfg.wifiPass)-1);
  String wu = prefs.getString("webuser", "admin");
  memset(cfg.webUser, 0, sizeof(cfg.webUser));
  strncpy(cfg.webUser, wu.length() ? wu.c_str() : "admin", sizeof(cfg.webUser)-1);
  String wpa = prefs.getString("webpass", "admin");
  memset(cfg.webPass, 0, sizeof(cfg.webPass));
  strncpy(cfg.webPass, wpa.length() ? wpa.c_str() : "admin", sizeof(cfg.webPass)-1);
  String wh = prefs.getString("webhost", "bmp280-logger");
  memset(cfg.webHost, 0, sizeof(cfg.webHost));
  strncpy(cfg.webHost, wh.length() ? wh.c_str() : "bmp280-logger", sizeof(cfg.webHost)-1);

  cfg.mqttEnabled = prefs.getBool("mqtten", false);
  cfg.mqttDiscovery = prefs.getBool("mqtdisc", true);
  String mh = prefs.getString("mqtthost", "");
  memset(cfg.mqttHost, 0, sizeof(cfg.mqttHost));
  strncpy(cfg.mqttHost, mh.c_str(), sizeof(cfg.mqttHost)-1);
  cfg.mqttPort = prefs.getUShort("mqttport", 1883);
  String mu = prefs.getString("mqttuser", "");
  memset(cfg.mqttUser, 0, sizeof(cfg.mqttUser));
  strncpy(cfg.mqttUser, mu.c_str(), sizeof(cfg.mqttUser)-1);
  String mp = prefs.getString("mqttpass", "");
  memset(cfg.mqttPass, 0, sizeof(cfg.mqttPass));
  strncpy(cfg.mqttPass, mp.c_str(), sizeof(cfg.mqttPass)-1);
  String mx = prefs.getString("mqttprefix", "bmp280");
  memset(cfg.mqttPrefix, 0, sizeof(cfg.mqttPrefix));
  strncpy(cfg.mqttPrefix, mx.length() ? mx.c_str() : "bmp280", sizeof(cfg.mqttPrefix)-1);

  if (cfg.mode > MODE_HYBRID) cfg.mode = MODE_HYBRID;
  if (cfg.powerMode > POWER_DEEP) cfg.powerMode = POWER_NORMAL;
  if (cfg.intervalSec < 1) cfg.intervalSec = 1;
  if (cfg.intervalSec > 3600) cfg.intervalSec = 3600;
  if (cfg.maxDays < 0.1f) cfg.maxDays = 0.1f;
  if (cfg.maxDays > 7.0f) cfg.maxDays = 7.0f;
  if (cfg.screenMode > 8) cfg.screenMode = 0;
  if (cfg.graphMode > 1) cfg.graphMode = 0;
  if (cfg.graphWindow > 3) cfg.graphWindow = 0;
  if (cfg.wakeDisplaySec < 5) cfg.wakeDisplaySec = 5;
  if (cfg.wakeDisplaySec > 300) cfg.wakeDisplaySec = 300;
  if (cfg.usbWindowSec > 30) cfg.usbWindowSec = 30;
  if (cfg.mqttPort == 0) cfg.mqttPort = 1883;
  if (strlen(cfg.mqttPrefix) == 0) strncpy(cfg.mqttPrefix, "bmp280", sizeof(cfg.mqttPrefix)-1);
}

String trustKey(int idx) {
  return "tr" + String(idx);
}

void saveTrusted(int idx) {
  prefs.putBytes(trustKey(idx).c_str(), &trusted[idx], sizeof(TrustedNode));
}

void loadTrusted() {
  memset(trusted, 0, sizeof(trusted));
  for (int i = 0; i < MAX_TRUSTED; i++) {
    size_t n = prefs.getBytes(trustKey(i).c_str(), &trusted[i], sizeof(TrustedNode));
    if (n != sizeof(TrustedNode)) memset(&trusted[i], 0, sizeof(TrustedNode));
    trusted[i].lastSeenMs=0; trusted[i].packets=0;
  }
}

int findTrustedById(const char *id) {
  for (int i = 0; i < MAX_TRUSTED; i++) {
    if (trusted[i].used && strncmp(trusted[i].id, id, 10) == 0) return i;
  }
  return -1;
}

int freeTrustedSlot() {
  for (int i = 0; i < MAX_TRUSTED; i++) if (!trusted[i].used) return i;
  return -1;
}

int findPendingById(const char *id) {
  for (int i = 0; i < MAX_PENDING; i++) {
    if (pendingNodes[i].used && strncmp(pendingNodes[i].id, id, 10) == 0) return i;
  }
  return -1;
}

int upsertPending(const PairReqPacket &p) {
  int idx = findPendingById(p.id);
  if (idx < 0) {
    for (int i = 0; i < MAX_PENDING; i++) {
      if (!pendingNodes[i].used) {
        idx = i;
        break;
      }
    }
  }
  if (idx < 0) return -1;

  pendingNodes[idx].used = true;
  strncpy(pendingNodes[idx].id, p.id, 10);
  pendingNodes[idx].id[10] = 0;
  strncpy(pendingNodes[idx].fw, p.fw, 7);
  pendingNodes[idx].fw[7] = 0;
  memcpy(pendingNodes[idx].mac, p.mac, 6);
  pendingNodes[idx].lastSeenMs = millis();

  return idx;
}

// --------------------------------------------------
// Buttons / Encoder
// --------------------------------------------------
void updateButton(DebouncedButton &btn) {
  btn.pressedEvent = false;
  btn.releasedEvent = false;

  bool raw = digitalRead(btn.pin);

  if (raw != btn.lastRawState) {
    btn.lastRawState = raw;
    btn.lastChangeMs = millis();
  }

  if ((millis() - btn.lastChangeMs) >= BUTTON_DEBOUNCE_MS) {
    if (raw != btn.stableState) {
      btn.stableState = raw;
      if (btn.stableState == LOW) btn.pressedEvent = true;
      else btn.releasedEvent = true;
    }
  }
}

