slawa01de-prog/ESP32-BMP280-Datenlogger/Esp32_LCD_Datalogger/Esp32_LCD_Datalogger.ino
uint8_t readEncoderState() {
  uint8_t a = digitalRead(PIN_ENC_A);
  uint8_t b = digitalRead(PIN_ENC_B);
  return (a << 1) | b;
}

void updateEncoder() {
  encoderDelta = 0;
  uint8_t currentState = readEncoderState();
  if (currentState == lastEncoderState) return;

  uint32_t nowUs = micros();
  if ((nowUs - lastEncoderChangeUs) < ENCODER_DEBOUNCE_US) return;
  lastEncoderChangeUs = nowUs;

  uint8_t index = (lastEncoderState << 2) | currentState;
  int8_t movement = encoderTable[index];
  lastEncoderState = currentState;

  if (movement == 0) return;

  encoderAccumulator += movement;

  if (encoderAccumulator >= 4) {
    encoderAccumulator = 0;
    encoderDelta = +1;
  } else if (encoderAccumulator <= -4) {
    encoderAccumulator = 0;
    encoderDelta = -1;
  }
}


uint64_t elapsedNow() { return elapsedBaseMs + (uint64_t)(esp_timer_get_time() / 1000); }
uint64_t epochNow() {
  struct timeval tv; gettimeofday(&tv, nullptr);
  if (tv.tv_sec < 1700000000) return 0;
  return (uint64_t)tv.tv_sec * 1000ULL + tv.tv_usec / 1000;
}
String u64str(uint64_t v) { char b[24]; snprintf(b, sizeof(b), "%llu", (unsigned long long)v); return String(b); }
String fieldSafe(String v) { v.replace(",", " "); v.replace("\n", " "); v.replace("\r", " "); return v; }
String finiteJson(float v, uint8_t decimals=2) { return isfinite(v) ? String(v, (unsigned int)decimals) : String("null"); }
bool storageAvailable(size_t bytes) {
  if (!fsReady || storageFault) return false;
  size_t total = LittleFS.totalBytes(), used = LittleFS.usedBytes();
  if (used > total || total - used < bytes + STORAGE_RESERVE) {
    storageFault = true; storageMessage = "SPEICHER VOLL";
    loggerConsole.println("ERR,storage,Speicher voll - Export erforderlich"); return false;
  }
  return true;
}
String packetLine(const DataPacket &p) {
  String r = "NODEDATA," + fieldSafe(p.id) + "," + fieldSafe(p.name) + "," + String(p.fw);
  r += "," + String(p.logNo) + "," + String(p.rawTempC,2) + "," + String(p.tempC,2);
  r += "," + String(p.rawPressureHpa,2) + "," + String(p.pressureHpa,2);
  r += "," + String(p.tempOffsetC,2) + "," + String(p.pressureOffsetHpa,2);
  r += "," + String(p.mode) + "," + String(p.powerMode) + "," + String(p.wakeCause) + "," + macToString(p.mac);
  r += "," + String(p.sequence) + "," + String(p.session) + "," + u64str(p.elapsedMs) + "," + u64str(p.epochMs);
  r += "," + String(p.flags) + "," + String(p.intervalSec);
  return r+","+String(hashString(r),HEX);
}
DataPacket localPacket() {
  DataPacket p = {}; memcpy(p.magic,"BPN2",4); p.proto=PROTO_VERSION; p.type=PT_DATA;
  strncpy(p.id,cfg.nodeId,10); strncpy(p.name,cfg.nodeName,15); strncpy(p.fw,FW_VERSION,7);
  WiFi.macAddress(p.mac); p.logNo=logCount;
  p.rawTempC=rawTempC; p.tempC=tempC; p.rawPressureHpa=rawPressureHpa; p.pressureHpa=pressureHpa;
  p.tempOffsetC=cfg.tempOffsetC; p.pressureOffsetHpa=cfg.pressureOffsetHpa;
  p.mode=cfg.mode; p.powerMode=cfg.powerMode; p.wakeCause=(uint8_t)wakeCause;
  p.flags=(cfg.loggingEnabled?1:0)|(sensorValid?2:0)|(sampleStored?4:0);
  p.sequence=sampleSequence; p.session=sessionId; p.elapsedMs=sampleElapsed; p.epochMs=sampleEpoch; p.intervalSec=cfg.intervalSec;
  return p;
}
bool appendPacket(const String &path, const DataPacket &p) {
  String line=packetLine(p)+"\n";
  if (!storageAvailable(line.length()+256)) return false;
  File f=LittleFS.open(path,"a");
  if (!f) { storageFault=true; storageMessage="DATEIFEHLER"; return false; }
  // A leading newline isolates an incomplete tail left by a previous power loss.
  if (f.size()==0) f.println("record,node_id,name,fw,log_no,raw_temp_c,temp_c,raw_pressure_hpa,pressure_hpa,temp_offset_c,pressure_offset_hpa,mode,power,wake,mac,sequence,session,elapsed_ms,epoch_ms,flags,interval_s,checksum_fnv1a");
  f.print("\n"); // isolate an incomplete record after an interrupted write
  size_t written=f.print(line); f.flush(); f.close();
  if (written!=line.length()) { storageFault=true; storageMessage="SCHREIBFEHLER"; loggerConsole.println("ERR,storage,Unvollstaendige Schreiboperation"); return false; }
  return true;
}
void processRadioQueue() {
  RxEnvelope e;
  for (uint8_t n=0; n<4 && rxQueue && xQueueReceive(rxQueue,&e,0)==pdTRUE; n++) handleIncoming(e.bytes,e.length,e.source);
}
void openSyncPath(String path) {
  if (syncFile) syncFile.close(); syncLine="";
  syncFile=LittleFS.open(path,"r"); syncRemaining=syncFile ? syncFile.size() : 0;
}
void startSync(String id) {
  if (!fsReady) { printErr("sync","Speicher nicht bereit"); return; }
  syncAll=(id=="all"); syncSlot=syncAll ? -1 : MAX_TRUSTED;
  if (id=="all" || id==cfg.nodeId || id=="local") openSyncPath(LOCAL_LOG_FILE);
  else { id.toUpperCase(); if (id.length()!=10) { printErr("sync","ID fehlt"); return; } openSyncPath("/v74_"+id+".csv"); }
  loggerConsole.println("SYNC,START");
}
void serviceTransfers() {
  // Pause file reads under backpressure; never consume archive rows we cannot queue.
  if (loggerConsole.freeBytes() < 4096) return;
  if (dumpStream) {
    String row=dumpStream.readStringUntil('\n'); if(row.length()) loggerConsole.println(row);
    if (!dumpStream.available()) { dumpStream.close(); loggerConsole.println("\nDUMP,END"); }
  }
  if (syncSlot == -2) return;
  // Bounded work per loop; source size frozen at open so live append cannot extend transfer forever.
  for (int n=0;n<192 && syncFile && syncRemaining && syncFile.available();n++) {
    char c=(char)syncFile.read(); syncRemaining--;
    if(c=='\n') { if(syncLine.startsWith("NODEDATA,")) loggerConsole.println(syncLine); syncLine=""; }
    else if(syncLine.length()<600) syncLine+=c;
  }
  if (!syncFile || !syncRemaining || !syncFile.available()) {
    if(syncFile) syncFile.close();
    if(syncAll) {
      while(++syncSlot<MAX_TRUSTED) if(trusted[syncSlot].used) { openSyncPath("/v74_"+String(trusted[syncSlot].id)+".csv"); return; }
    }
    syncSlot=-2; loggerConsole.println("SYNC,END");
  }
}

// --------------------------------------------------
// ESP-NOW
// --------------------------------------------------
void addBroadcastPeer() {
  if (esp_now_is_peer_exist(broadcastAddress)) return;

  esp_now_peer_info_t peer = {};
  memcpy(peer.peer_addr, broadcastAddress, 6);
  peer.channel = 0;
  peer.encrypt = false;
  esp_now_add_peer(&peer);
}

