slawa01de-prog/ESP32-BMP280-Datenlogger/Esp32_LCD_Datalogger/Esp32_LCD_Datalogger.ino
bool addEncryptedPeer(const uint8_t peerMac[6], const char *nodeIdForKey, const uint8_t nodeMacForKey[6]) {
  if (esp_now_is_peer_exist(peerMac)) return true;

  esp_now_peer_info_t peer = {};
  memcpy(peer.peer_addr, peerMac, 6);
  peer.channel = 0;
  peer.encrypt = true;

  uint8_t lmk[16];
  makeLmkFor(nodeIdForKey, nodeMacForKey, lmk);
  memcpy(peer.lmk, lmk, 16);

  return esp_now_add_peer(&peer) == ESP_OK;
}

void initEspNow() {
  if (cfg.webEnabled && cfg.powerMode != POWER_DEEP) WiFi.mode(WIFI_AP_STA);
  else WiFi.mode(WIFI_STA);
  WiFi.disconnect(false, false);
  radioChannel=prefs.getUChar("radioch",1);
  if(radioChannel<1 || radioChannel>13) radioChannel=1;
  esp_wifi_set_channel(radioChannel,WIFI_SECOND_CHAN_NONE);

  if (esp_now_init() != ESP_OK) {
    loggerConsole.println("ESP-NOW Init Fehler");
    return;
  }

  uint8_t pmk[16];
  String s = String(PAIR_SECRET) + "|PMK";
  uint32_t h1 = hashString(s + "1");
  uint32_t h2 = hashString(s + "2");
  uint32_t h3 = hashString(s + "3");
  uint32_t h4 = hashString(s + "4");
  memcpy(pmk + 0, &h1, 4);
  memcpy(pmk + 4, &h2, 4);
  memcpy(pmk + 8, &h3, 4);
  memcpy(pmk + 12, &h4, 4);
  esp_now_set_pmk(pmk);

  addBroadcastPeer();
}

void sendPairRequest() {
  if (!isSensorRole()) return;

  PairReqPacket p;
  memset(&p, 0, sizeof(p));
  memcpy(p.magic, "BPN2", 4);
  p.proto = PROTO_VERSION;
  p.type = PT_PAIR_REQ;
  strncpy(p.id, cfg.nodeId, 10);
  strncpy(p.fw, FW_VERSION, sizeof(p.fw)-1);
  WiFi.macAddress(p.mac);
  p.nonce = millis();

  esp_now_send(broadcastAddress, (uint8_t*)&p, sizeof(p));

  loggerConsole.print("PAIRREQ gesendet ID=");
  loggerConsole.println(cfg.nodeId);
}

bool sendPairAccept(const PendingNode &pn, uint32_t code) {
  uint8_t gwMac[6];
  WiFi.macAddress(gwMac);

  PairAcceptPacket p;
  memset(&p, 0, sizeof(p));

  memcpy(p.magic, "BPN2", 4);
  p.proto = PROTO_VERSION;
  p.type = PT_PAIR_ACCEPT;
  strncpy(p.id, pn.id, 10);
  memcpy(p.nodeMac, pn.mac, 6);
  memcpy(p.gatewayMac, gwMac, 6);
  p.token = pairingTokenFor(pn.id, pn.mac, gwMac, code);

  esp_now_peer_info_t peer = {};
  memcpy(peer.peer_addr, pn.mac, 6);
  peer.channel = 0;
  peer.encrypt = false;
  if (!esp_now_is_peer_exist(pn.mac)) esp_now_add_peer(&peer);

  esp_err_t r = esp_now_send(pn.mac, (uint8_t*)&p, sizeof(p));
  loggerConsole.print("PAIRACCEPT an ");
  loggerConsole.print(pn.id);
  loggerConsole.print(" -> ");
  loggerConsole.println(r == ESP_OK ? "OK" : "FEHLER");
  return r == ESP_OK;
}

void printNodeDataSerialLocal();

void sendDataPacket() {
  if (!isSensorRole()) return;

  // Lokale Daten für PC/GUI immer ausgeben
  if (cfg.liveOutput || cfg.mode == MODE_HYBRID) {
    printNodeDataSerialLocal();
    mqttPublishLocalState(false);
  }

  // Stored records are transmitted by the acknowledged journal spool.
  // Live-only readings are best effort and are not queued as historical logs.
  if(cfg.paired && !sampleStored) {
    DataPacket p=localPacket(); esp_now_send(cfg.gatewayMac,(uint8_t*)&p,sizeof(p));
  }
}


void acknowledgePacket(const DataPacket &p) {
  AckPacket a={}; memcpy(a.magic,"BPN2",4); a.proto=PROTO_VERSION; a.type=5;
  strncpy(a.id,p.id,10); a.session=p.session; a.sequence=p.sequence;
  esp_now_send(p.mac,(uint8_t*)&a,sizeof(a));
}
bool parseJournal(const String &line, DataPacket &p) {
  int checksumAt=line.lastIndexOf(',');
  if(checksumAt<0 || hashString(line.substring(0,checksumAt))!=strtoul(line.substring(checksumAt+1).c_str(),nullptr,16)) return false;
  String f[21]; int start=0;
  for(int i=0;i<21;i++) { int end=line.indexOf(',',start); if(end<0) end=line.length(); f[i]=line.substring(start,end); start=end+1; }
  if(f[0]!="NODEDATA" || f[1].length()!=10 || f[20].length()==0) return false;
  memset(&p,0,sizeof(p)); memcpy(p.magic,"BPN2",4); p.proto=PROTO_VERSION; p.type=PT_DATA;
  strncpy(p.id,f[1].c_str(),10); strncpy(p.name,f[2].c_str(),15); strncpy(p.fw,f[3].c_str(),7);
  p.logNo=strtoul(f[4].c_str(),nullptr,10);
  p.rawTempC=f[5].toFloat(); p.tempC=f[6].toFloat(); p.rawPressureHpa=f[7].toFloat(); p.pressureHpa=f[8].toFloat();
  p.tempOffsetC=f[9].toFloat(); p.pressureOffsetHpa=f[10].toFloat(); p.mode=f[11].toInt(); p.powerMode=f[12].toInt(); p.wakeCause=f[13].toInt();
  WiFi.macAddress(p.mac);
  p.sequence=strtoul(f[15].c_str(),nullptr,10); p.session=strtoul(f[16].c_str(),nullptr,10);
  p.elapsedMs=strtoull(f[17].c_str(),nullptr,10); p.epochMs=strtoull(f[18].c_str(),nullptr,10); p.flags=f[19].toInt(); p.intervalSec=f[20].toInt();
  return true;
}
void serviceRadioSpool() {
  if(!cfg.paired || !isSensorRole() || !fsReady) return;
  if(!radioWaiting) {
    File f=LittleFS.open(LOCAL_LOG_FILE,"r"); if(!f) return;
    if(radioCursor>f.size()) radioCursor=0;
    f.seek(radioCursor);
    for(int n=0;n<2 && f.available();n++) {
      String line=f.readStringUntil('\n');
      if(parseJournal(line,radioPending)) { radioNextCursor=f.position(); radioWaiting=true; radioTries=0; break; }
      radioCursor=f.position();
    }
    f.close();
  }
  if(!radioWaiting) return;
  uint32_t wait=radioTries>=3?5000:250;
  if(radioTries && millis()-radioLastSend<wait) return;
  if(radioTries>=3) {
    radioTries=0;
    // Sensor-only nodes can seek the gateway channel; AP-connected nodes must stay on router channel.
    if(cfg.mode==MODE_SENSOR && WiFi.status()!=WL_CONNECTED) { radioChannel=radioChannel%13+1; esp_wifi_set_channel(radioChannel,WIFI_SECOND_CHAN_NONE); }
  }
  esp_now_send(cfg.gatewayMac,(uint8_t*)&radioPending,sizeof(radioPending));
  radioLastSend=millis(); radioTries++;
}

void saveGatewayCsv(const DataPacket &p) {
  if (!(p.flags & 2)) return;
  appendPacket("/v74_" + String(p.id) + ".csv", p);
}

void printNodeDataSerialPacket(const DataPacket &p) { loggerConsole.println(packetLine(p)); }

void printNodeDataSerialLocal() { loggerConsole.println(packetLine(localPacket())); }

void handlePairReq(const PairReqPacket &p) {
  if (!isGatewayRole()) return;
  if (!cfg.pairMode) {
    loggerConsole.print("PAIRREQ ignoriert, Pairing aus: ");
    loggerConsole.println(p.id);
    return;
  }

  int idx = upsertPending(p);
  if (idx < 0) {
    loggerConsole.println("PAIRREQ: Pending voll");
    return;
  }

  loggerConsole.print("PAIRREQ,");
  loggerConsole.print(p.id); loggerConsole.print(",");
  loggerConsole.print(p.fw); loggerConsole.print(",");
  loggerConsole.println(macToString(p.mac));
}

void handlePairAccept(const PairAcceptPacket &p) {
  if (!isSensorRole()) return;
  if (strncmp(p.id, cfg.nodeId, 10) != 0) return;

  uint8_t ownMac[6];
  WiFi.macAddress(ownMac);
  if (!macEqual(p.nodeMac, ownMac)) return;

  uint32_t code = pairingCodeFor(cfg.nodeId, ownMac);
  uint32_t expected = pairingTokenFor(cfg.nodeId, ownMac, p.gatewayMac, code);

