slawa01de-prog/ESP32-BMP280-Datenlogger/Esp32_LCD_Datalogger/Esp32_LCD_Datalogger.ino
  if (p.token != expected) {
    loggerConsole.println("PAIRACCEPT falsch, Token passt nicht");
    return;
  }

  memcpy(cfg.gatewayMac, p.gatewayMac, 6);
  if (esp_now_is_peer_exist(p.gatewayMac)) esp_now_del_peer(p.gatewayMac);
  cfg.paired = true;
  cfg.pairMode = false;
  saveConfig();
  prefs.putUChar("radioch",WiFi.channel());
  addEncryptedPeer(cfg.gatewayMac,cfg.nodeId,ownMac);

  loggerConsole.print("PAIR OK Gateway=");
  loggerConsole.println(macToString(cfg.gatewayMac));
}

void handleData(const DataPacket &p) {
  if (!isGatewayRole()) return;

  if(p.intervalSec<1 || p.intervalSec>3600 || !isfinite(p.tempC) || !isfinite(p.pressureHpa)) return;
  int idx = findTrustedById(p.id);
  if (idx < 0 || !macEqual(trusted[idx].mac, p.mac)) {
    loggerConsole.print("IGNORED,UNTRUSTED,");
    loggerConsole.print(p.id);
    loggerConsole.print(",");
    loggerConsole.println(macToString(p.mac));
    return;
  }

  if((p.flags&4) && lastRxSession[idx]==p.session && p.sequence<=lastRxSequence[idx]) { acknowledgePacket(p); return; }
  if ((p.flags&4) && !appendPacket("/v74_"+String(p.id)+".csv",p)) return;
  acknowledgePacket(p);
  if(p.flags&4) { lastRxSession[idx]=p.session; lastRxSequence[idx]=p.sequence; }
  trusted[idx].lastLog = p.logNo;
  trusted[idx].packets++;
  trusted[idx].lastSeenMs = millis();
  if (p.name[0]) {
    memset(trusted[idx].name, 0, sizeof(trusted[idx].name));
    strncpy(trusted[idx].name, p.name, sizeof(trusted[idx].name)-1);
  }
  lastGoodRxMs = millis();
  nodeTimeoutMs[idx] = max((uint32_t)30000, min((uint32_t)14400000, (uint32_t)(p.intervalSec * 3000UL + 15000UL)));
  nodeOnline[idx] = true;
  printNodeDataSerialPacket(p);
  mqttPublishPacketState(p);
}

void handleIncoming(const uint8_t *data, int len, const uint8_t *source) {
  if (len < 6) return;
  if (data[0] != 'B' || data[1] != 'P' || data[2] != 'N' || data[3] != '2') return;
  if (data[4] != PROTO_VERSION) return;

  uint8_t type = data[5];
  if(type==5 && len==sizeof(AckPacket) && cfg.paired && macEqual(source,cfg.gatewayMac)) {
    AckPacket a; memcpy(&a,data,sizeof(a));
    if(radioWaiting && strncmp(a.id,cfg.nodeId,10)==0 && a.session==radioPending.session && a.sequence==radioPending.sequence) {
      radioCursor=radioNextCursor; radioWaiting=false; radioTries=0; radioConfirmed++; lastGoodRxMs=millis();
      uint8_t ch=WiFi.channel(); if(prefs.getUChar("radioch",1)!=ch) prefs.putUChar("radioch",ch);
    }
    return;
  }

  if (type == PT_PAIR_REQ && len == sizeof(PairReqPacket)) {
    PairReqPacket p;
    memcpy(&p, data, sizeof(p));
    p.id[10] = 0;
    p.fw[7] = 0;
    if (!macEqual(p.mac, source)) return;
    handlePairReq(p);
  } else if (type == PT_PAIR_ACCEPT && len == sizeof(PairAcceptPacket)) {
    PairAcceptPacket p;
    memcpy(&p, data, sizeof(p));
    p.id[10] = 0;
    if (!macEqual(p.gatewayMac, source)) return;
    handlePairAccept(p);
  } else if (type == PT_DATA && len == sizeof(DataPacket)) {
    DataPacket p;
    memcpy(&p, data, sizeof(p));
    p.id[10] = 0;
    p.name[15] = 0;
    p.fw[7] = 0;
    if (!macEqual(p.mac, source)) return;
    handleData(p);
  }
}

#if defined(ESP_ARDUINO_VERSION_MAJOR) && ESP_ARDUINO_VERSION_MAJOR >= 3
void onRecv(const esp_now_recv_info_t *info, const uint8_t *data, int len) {
  if (!rxQueue || len < 6 || len > 250) return;
  RxEnvelope e = {};
  e.length = len;
#if defined(ESP_ARDUINO_VERSION_MAJOR) && ESP_ARDUINO_VERSION_MAJOR >= 3
  memcpy(e.source, info->src_addr, 6);
#else
  memcpy(e.source, mac, 6);
#endif
  memcpy(e.bytes, data, len);
  if (xQueueSend(rxQueue, &e, 0) != pdTRUE) rxDropped++;

}
#else
void onRecv(const uint8_t *mac, const uint8_t *data, int len) {
  if (!rxQueue || len < 6 || len > 250) return;
  RxEnvelope e = {};
  e.length = len;
#if defined(ESP_ARDUINO_VERSION_MAJOR) && ESP_ARDUINO_VERSION_MAJOR >= 3
  memcpy(e.source, info->src_addr, 6);
#else
  memcpy(e.source, mac, 6);
#endif
  memcpy(e.bytes, data, len);
  if (xQueueSend(rxQueue, &e, 0) != pdTRUE) rxDropped++;

}
#endif

// --------------------------------------------------
// Sensor / Logging
// --------------------------------------------------
void addHistory(float t, float p) {
  hourHistory.add(elapsedNow(), t, p);
  tempHistory[historyIndex] = t;
  pressHistory[historyIndex] = p;
  historyIndex++;
  if (historyIndex >= HISTORY_SIZE) historyIndex = 0;
  if (historyCount < HISTORY_SIZE) historyCount++;
}

float getHistoryValue(uint8_t pos, uint8_t mode) {
  if (pos >= historyCount) return NAN;
  int idx = (int)historyIndex - (int)historyCount + pos;
  while (idx < 0) idx += HISTORY_SIZE;
  idx = idx % HISTORY_SIZE;
  return mode == 0 ? tempHistory[idx] : pressHistory[idx];
}

bool initBMP280() {
  if (!bmp.begin(BMP280_ADDR)) {
    loggerConsole.println("BMP280 nicht gefunden.");
    return false;
  }

  bmp.setSampling(
    Adafruit_BMP280::MODE_NORMAL,
    Adafruit_BMP280::SAMPLING_X2,
    Adafruit_BMP280::SAMPLING_X16,
    Adafruit_BMP280::FILTER_X16,
    Adafruit_BMP280::STANDBY_MS_500
  );
  return true;
}

void readSensor() {
  sampleStored=false;
  sampleSequence++; sampleAtMs=millis(); sampleElapsed=elapsedNow(); sampleEpoch=epochNow();
  if(!bmpOk) { sensorValid=false; rawTempC=tempC=rawPressureHpa=pressureHpa=NAN; hourHistory.add(elapsedNow(), NAN, NAN); return; }
  rawTempC=bmp.readTemperature(); rawPressureHpa=bmp.readPressure()/100.0F;
  sensorValid=isfinite(rawTempC) && isfinite(rawPressureHpa) && rawTempC>=-40 && rawTempC<=85 && rawPressureHpa>=300 && rawPressureHpa<=1100;
  if(!sensorValid) { bmpOk=false; rawTempC=tempC=rawPressureHpa=pressureHpa=NAN; hourHistory.add(elapsedNow(), NAN, NAN); return; }
  tempC=rawTempC+cfg.tempOffsetC; pressureHpa=rawPressureHpa+cfg.pressureOffsetHpa; readCount++;
  updateMinMax(tempC,minTempC,maxTempC); updateMinMax(pressureHpa,minPressureHpa,maxPressureHpa);
  addHistory(tempC,pressureHpa);
}

void ensureLocalLogHeader() {
  // appendPacket creates the V74 CSV header on first successful write.
}

uint32_t countLocalLogRows() {
  if (!fsReady) return 0;
  File f=LittleFS.open(LOCAL_LOG_FILE,"r"); uint32_t count=0;
  while(f && f.available()) { String line=f.readStringUntil('\n'); DataPacket record; if(parseJournal(line,record)) count++; }
  if(f) f.close(); return count;
}

void logLocal(bool force) {
  sampleStored=false;
  if ((!force && !cfg.loggingEnabled) || !isSensorRole() || !sensorValid) return;
  if (logCount>=getMaxSamples()) { cfg.loggingEnabled=false; saveConfig(); printErr("log","Messpunktlimit erreicht"); return; }
  DataPacket p=localPacket(); p.logNo=logCount+1; p.flags |= 4;
  if(appendPacket(LOCAL_LOG_FILE,p)) { logCount++; sampleStored=true; cachedLogRows=logCount; cachedLogBytes=getFileSize(LOCAL_LOG_FILE); }
}

