slawa01de-prog/ESP32-BMP280-Datenlogger/Esp32_LCD_Datalogger/Esp32_LCD_Datalogger.ino
void clearLocalLog() {
  if(syncFile) syncFile.close(); syncSlot=-2;
  if(dumpStream) dumpStream.close();
  if (LittleFS.exists(LOCAL_LOG_FILE)) LittleFS.remove(LOCAL_LOG_FILE);
  logCount = 0;
  radioCursor=0; radioWaiting=false; cachedLogRows=0; cachedLogBytes=0;
  storageFault = !fsReady; storageMessage = fsReady ? "OK" : "FS FEHLER";
  ensureLocalLogHeader();
  cfg.loggingEnabled = true;
  saveConfig();
  setEvent(cfg.language == 1 ? "Local Log cleared" : "Local Log geloescht");
  printAck("clear", cfg.language == 1 ? "Local Log cleared" : "Local Log geloescht");
  printStatusData();
}

void dumpFile(String fn) {
  if(dumpStream) dumpStream.close();
  dumpStream=LittleFS.open(fn,"r");
  if(!dumpStream) printErr("dump","Datei fehlt"); else loggerConsole.println("DUMP,START");
}

// --------------------------------------------------
// Power / DeepSleep
// --------------------------------------------------
uint64_t buttonWakeMask() {
  return (1ULL << PIN_ENC_PUSH) |
         (1ULL << PIN_BAK) |
         (1ULL << PIN_CONTR);
}

void prepareWakePinsForDeepSleep() {
  const gpio_num_t pins[] = {
    (gpio_num_t)PIN_ENC_A,
    (gpio_num_t)PIN_ENC_B,
    (gpio_num_t)PIN_ENC_PUSH,
    (gpio_num_t)PIN_BAK,
    (gpio_num_t)PIN_CONTR
  };

  for (uint8_t i = 0; i < 5; i++) {
    gpio_reset_pin(pins[i]);
    gpio_set_direction(pins[i], GPIO_MODE_INPUT);
    gpio_pullup_en(pins[i]);
    gpio_pulldown_dis(pins[i]);
  }
}

bool serialConnectedQuick() {
  if (Serial) return true;
  if (Serial.available() > 0) return true;
  return false;
}

bool waitForUsbNormalWindow(uint8_t seconds) {
  if (!cfg.usbAutoNormal) return false;
  if (seconds == 0) return serialConnectedQuick();

  unsigned long start = millis();
  while ((millis() - start) < (seconds * 1000UL)) {
    if (serialConnectedQuick()) return true;
    if (Serial.available() > 0) return true;
    delay(50);
  }
  return false;
}

void enterDeepSleepNow(const char *reason) {
  loggerConsole.print("DEEP SLEEP: ");
  loggerConsole.println(reason);
  // Never wait for a USB reader before sleeping. Diagnostics are best effort.
  loggerConsole.pump(Serial);

  if (oledOk) oled.setPowerSave(1);
  displayOn = false;

  mqttDisconnect();
  WiFi.disconnect(true);
  WiFi.mode(WIFI_OFF);

  if(bmpOk) bmp.setSampling(Adafruit_BMP280::MODE_SLEEP);
  prepareWakePinsForDeepSleep();

  // Start-to-start interval: subtract awake work (including USB window).
  uint64_t activeUs=(uint64_t)esp_timer_get_time();
  uint64_t targetUs=(uint64_t)cfg.intervalSec*1000000ULL;
  uint64_t timerUs=targetUs>activeUs ? targetUs-activeUs : 1000000ULL;
  if (timerUs < 1000000ULL) timerUs = 1000000ULL;

  elapsedBaseMs=elapsedNow()+timerUs/1000;
  esp_sleep_enable_timer_wakeup(timerUs);
  uint64_t mask=0;
  for(uint8_t pin=0;pin<6;pin++) if((buttonWakeMask() & (1ULL<<pin)) && digitalRead(pin)==HIGH) mask|=(1ULL<<pin);
  if(mask) esp_deep_sleep_enable_gpio_wakeup(mask, ESP_GPIO_WAKEUP_GPIO_LOW);

  esp_deep_sleep_start();
}

void applyPowerMode() {

  if (cfg.powerMode == POWER_ECO) {
    cfg.liveOutput = false;
    if (cfg.displayTimeoutSec == 0) cfg.displayTimeoutSec = 20;
    setCpuFrequencyMhz(80);
    setEvent("Power ECO");
  } else if (cfg.powerMode == POWER_DEEP) {
    cfg.liveOutput = false;
    if (cfg.wakeDisplaySec < 5) cfg.wakeDisplaySec = 20;
    setCpuFrequencyMhz(80);
    setEvent("Power DEEP");
  } else {
    setCpuFrequencyMhz(160);

    // V6.7 FIX:
    // Normalmodus bedeutet bewusst: Display bleibt an.
    // Der alte ECO-Display-Timeout darf hier nicht weiter wirken.
    cfg.displayTimeoutSec = 0;
    displayOn = true;
    if (oledOk) oled.setPowerSave(0);
    lastUserActionMs = millis();

    setEvent("Power NORMAL - Display dauerhaft AN");
  }
  saveConfig();
  setupWebIfAllowed();
}

void wakeDisplay(const String &reason) {
  lastUserActionMs = millis();
  if (!displayOn && oledOk) {
    oled.setPowerSave(0);
    displayOn = true;
    setEvent("Display an: " + reason);
  }
}

void maybeSleepDisplay() {
  if (!displayOn || !oledOk) return;
  if (cfg.powerMode == POWER_DEEP) return;
  if (cfg.displayTimeoutSec == 0) return;

  if ((millis() - lastUserActionMs) > (cfg.displayTimeoutSec * 1000UL)) {
    oled.setPowerSave(1);
    displayOn = false;
    loggerConsole.println("Display aus wegen Timeout.");
  }
}

void maybeReturnToDeepAfterButtonWake() {
  if (cfg.powerMode != POWER_DEEP) return;
  if (wakeCause != ESP_SLEEP_WAKEUP_GPIO && wakeCause != ESP_SLEEP_WAKEUP_UNDEFINED) return;

  if ((millis() - lastUserActionMs) > (cfg.wakeDisplaySec * 1000UL)) {
    enterDeepSleepNow("Button-Wake Timeout");
  }
}

void deepTimerWakeJobAndSleep() {
  if (cfg.powerMode != POWER_DEEP) return;
  if (wakeCause != ESP_SLEEP_WAKEUP_TIMER) return;
  if (!isSensorRole()) return;

  readSensor();
  logLocal(false);
  sendDataPacket();
  unsigned long deadline=millis();
  while(cfg.paired && millis()-deadline<1200) { processRadioQueue(); serviceRadioSpool(); delay(5); }

  if (cfg.usbAutoNormal && waitForUsbNormalWindow(cfg.usbWindowSec)) {
    cfg.powerMode = POWER_NORMAL;
    cfg.liveOutput = true;
    saveConfig();
    applyPowerMode();
    if (oledOk) oled.setPowerSave(0);
    displayOn = true;
    loggerConsole.println("USB erkannt -> Normalmodus");
    return;
  }

  if(cfg.paired && radioWaiting && WiFi.status()!=WL_CONNECTED) {
    missedRadioWakes++;
    if(missedRadioWakes>=2) { radioChannel=radioChannel%13+1; prefs.putUChar("radioch",radioChannel); missedRadioWakes=0; }
  } else missedRadioWakes=0;
  enterDeepSleepNow("Timer-Wake erledigt");
}


// --------------------------------------------------
// Display - OLED Pro UI V7.1.2 Clean Dash Pixel-Safe Layout
// OLED: 128x64 Pixel
// Bereiche:
//   0..9   Header/Status
//   11..53 Content
//   54..63 Footer
// Keine Seite darf außerhalb dieser Bereiche zeichnen.
// --------------------------------------------------
const char* txtDEEN(const char *de, const char *en) {
  return cfg.language == 1 ? en : de;
}

const char* modeShort() {
  if (cfg.mode == MODE_GATEWAY) return "GW";
  if (cfg.mode == MODE_HYBRID) return "HYB";
  return "SEN";
}

const char* powerShort() {
  if (cfg.powerMode == POWER_DEEP) return "DP";
  if (cfg.powerMode == POWER_ECO) return "ECO";
  return "NOR";
}

const char* logShort() {
  return cfg.loggingEnabled ? "LOG" : "STOP";
}

