slawa01de-prog/ESP32-BMP280-Datenlogger/Esp32_LCD_Datalogger/Esp32_LCD_Datalogger.ino
String fitTextToWidth(String s, uint8_t maxW) {
  if (maxW < 6) return "";
  if (oled.getStrWidth(s.c_str()) <= maxW) return s;
  while (s.length() > 0 && oled.getStrWidth((s + ".").c_str()) > maxW) {
    s.remove(s.length() - 1);
  }
  if (s.length() == 0) return "";
  return s + ".";
}

void drawFitStr(int x, int y, uint8_t maxW, const String &s) {
  String t = fitTextToWidth(s, maxW);
  oled.drawStr(x, y, t.c_str());
}

void drawTinyText(uint8_t x, uint8_t y, const char *s) {
  oled.setFont(u8g2_font_5x8_tf);
  drawFitStr(x, y, 126 - x, String(s));
}

void drawRightText(uint8_t y, const char *s) {
  oled.setFont(u8g2_font_5x8_tf);
  String t = fitTextToWidth(String(s), 62);
  int w = oled.getStrWidth(t.c_str());
  int x = 127 - w;
  if (x < 0) x = 0;
  oled.drawStr(x, y, t.c_str());
}

void drawHeader(const char *title) {
  if (!oledOk) return;
  oled.setDrawColor(1);
  oled.drawBox(0, 0, 128, 10);
  oled.setDrawColor(0);
  oled.setFont(u8g2_font_5x8_tf);
  drawFitStr(2, 8, 66, String(title));

  char stat[24];
  snprintf(stat, sizeof(stat), "%s %s", powerShort(), logShort());
  String st = fitTextToWidth(String(stat), 42);
  int w = oled.getStrWidth(st.c_str());
  int x = 126 - w;
  if (x < 74) x = 74;
  oled.drawStr(x, 8, st.c_str());

  oled.setDrawColor(1);
  if (cfg.loggingEnabled && ((millis() / 500) % 2 == 0)) {
    oled.drawBox(70, 3, 3, 3);
  }
}

void drawFooter(const char *left, const char *right) {
  oled.setDrawColor(1);
  oled.drawHLine(0, 54, 128);
  oled.setFont(u8g2_font_5x8_tf);
  if (left) drawFitStr(2, 63, 62, String(left));
  if (right) {
    String r = fitTextToWidth(String(right), 62);
    int w = oled.getStrWidth(r.c_str());
    oled.drawStr(126 - w, 63, r.c_str());
  }
}

void drawSoftFrame(uint8_t x, uint8_t y, uint8_t w, uint8_t h) {
  if (y + h > 54) h = 54 - y;
  if (x + w > 128) w = 128 - x;
  oled.drawFrame(x, y, w, h);
}

void drawFilledBar(uint8_t x, uint8_t y, uint8_t w, uint8_t h, float ratio) {
  if (y + h > 54) h = 54 - y;
  ratio = clampFloat(ratio, 0.0f, 1.0f);
  oled.drawFrame(x, y, w, h);
  uint8_t fillW = (uint8_t)((w - 2) * ratio);
  if (fillW > 0 && h > 2) oled.drawBox(x + 1, y + 1, fillW, h - 2);
}

void draw3DFrame(uint8_t x, uint8_t y, uint8_t w, uint8_t h) {
  drawSoftFrame(x, y, w, h);
}

void drawBar(uint8_t x, uint8_t y, uint8_t w, uint8_t h, float ratio) {
  drawFilledBar(x, y, w, h, ratio);
}

void drawValueBox(uint8_t x, uint8_t y, uint8_t w, uint8_t h, const char *label, const String &value) {
  drawSoftFrame(x, y, w, h);
  oled.setFont(u8g2_font_5x8_tf);
  drawFitStr(x + 3, y + 8, w - 6, String(label));
  oled.setFont(u8g2_font_6x10_tf);
  drawFitStr(x + 3, y + h - 4, w - 6, value);
}

void drawMetricCard(uint8_t x, uint8_t y, uint8_t w, uint8_t h, const char *label, const String &value, const char *unit) {
  drawSoftFrame(x, y, w, h);
  oled.setFont(u8g2_font_5x8_tf);
  drawFitStr(x + 3, y + 8, w - 6, String(label));
  oled.setFont(u8g2_font_7x14B_tf);
  String v = value;
  if (unit && strlen(unit) > 0) v += String(unit);
  drawFitStr(x + 3, y + h - 4, w - 6, v);
}

void drawHistoryMini(uint8_t x0, uint8_t y0, uint8_t w, uint8_t h, uint8_t mode, bool grid) {
  if (y0 + h > 53) h = 53 - y0;
  oled.drawFrame(x0, y0, w, h);
  if (grid && w > 20 && h > 10) {
    oled.drawHLine(x0 + 1, y0 + h / 2, w - 2);
    oled.drawVLine(x0 + w / 2, y0 + 1, h - 2);
  }
  if (historyCount < 2) {
    oled.setFont(u8g2_font_5x8_tf);
    drawFitStr(x0 + 5, y0 + h / 2 + 3, w - 10, String(txtDEEN("warte Daten", "wait data")));
    return;
  }

  float vMin = NAN, vMax = NAN;
  for (uint8_t i = 0; i < historyCount; i++) {
    float v = getHistoryValue(i, mode);
    if (isnan(v)) continue;
    if (isnan(vMin) || v < vMin) vMin = v;
    if (isnan(vMax) || v > vMax) vMax = v;
  }
  if (isnan(vMin) || isnan(vMax)) return;
  if (fabs(vMax - vMin) < 0.2f) {
    vMax += 0.1f;
    vMin -= 0.1f;
  }

  int lastX = -1, lastY = -1;
  for (uint8_t i = 0; i < historyCount; i++) {
    float v = getHistoryValue(i, mode);
    if (isnan(v)) continue;
    float xNorm = historyCount > 1 ? (float)i / (float)(historyCount - 1) : 0.0f;
    float yNorm = (v - vMin) / (vMax - vMin);
    yNorm = clampFloat(yNorm, 0.0f, 1.0f);
    int x = x0 + 2 + (int)(xNorm * (w - 5));
    int y = y0 + h - 3 - (int)(yNorm * (h - 6));
    if (lastX >= 0) oled.drawLine(lastX, lastY, x, y);
    lastX = x;
    lastY = y;
  }

  // Min/Max innen in die Grafik setzen, nicht darunter.
  oled.setFont(u8g2_font_5x8_tf);
  char minBuf[12];
  char maxBuf[12];
  if (mode == 0) {
    snprintf(minBuf, sizeof(minBuf), "%.1f", vMin);
    snprintf(maxBuf, sizeof(maxBuf), "%.1f", vMax);
  } else {
    snprintf(minBuf, sizeof(minBuf), "%.0f", vMin);
    snprintf(maxBuf, sizeof(maxBuf), "%.0f", vMax);
  }
  oled.drawStr(x0 + 3, y0 + h - 3, minBuf);
  int tx = x0 + w - oled.getStrWidth(maxBuf) - 3;
  if (tx > x0 + 3) oled.drawStr(tx, y0 + 8, maxBuf);
}

String trendText(uint8_t mode) {
  if (historyCount < 10) return txtDEEN("warte", "wait");
  float firstV = getHistoryValue(0, mode);
  float lastV = getHistoryValue(historyCount - 1, mode);
  if (isnan(firstV) || isnan(lastV)) return "--";
  float diff = lastV - firstV;
  float th = mode == 0 ? 0.2f : 0.7f;
  if (diff > th) return txtDEEN("hoch", "rising");
  if (diff < -th) return txtDEEN("runter", "falling");
  return txtDEEN("stabil", "stable");
}

String shortNodeName() {
  String n = String(cfg.nodeName);
  if (n.length() == 0) n = String(cfg.nodeId);
  return n;
}

















const char* menuGroupName(int idx) {
  if (idx <= 2) return txtDEEN("Navigation", "Navigation");
  if (idx <= 4) return txtDEEN("Logging", "Logging");
  if (idx <= 6) return txtDEEN("Kalib.", "Calib.");
  if (idx <= 12) return txtDEEN("Power", "Power");
  if (idx <= 14) return txtDEEN("Ansicht", "View");
  if (idx <= 18) return txtDEEN("Netz", "Network");
  return txtDEEN("System", "System");
}

// V74 display: 128x64; header 0..9, content 13..51, footer 55..63.
// Exact renderer shared with host preview tests.
void sendOledIfChanged() {
  static uint8_t previous[1024]; static bool initialized=false;
  uint8_t *buffer=oled.getBufferPtr();
  if(!initialized) { oled.sendBuffer(); memcpy(previous,buffer,1024); initialized=true; return; }
  for(uint8_t row=0;row<8;row++) {
    int first=16,last=-1;
    for(uint8_t col=0;col<16;col++) if(memcmp(previous+row*128+col*8,buffer+row*128+col*8,8)) { if(first==16) first=col; last=col; }
    if(last>=first) oled.updateDisplayArea(first,row,last-first+1,1);
  }
  memcpy(previous,buffer,1024);
}
String shown(float value, uint8_t places=1) { return isfinite(value)?String(value,(unsigned int)places):String("--"); }
uint32_t nextLogSeconds() {
  if(!cfg.loggingEnabled || storageFault) return 0;
  uint32_t elapsed=(millis()-lastLogMs)/1000;
  return elapsed>=cfg.intervalSec?0:cfg.intervalSec-elapsed;
}
void dashBase(const char *title, uint8_t page) {
  oled.clearBuffer(); oled.setDrawColor(1);
  oled.drawBox(0,0,128,10); oled.setDrawColor(0); oled.setFont(u8g2_font_5x8_tf);
  oled.drawStr(2,8,title);
  String state=storageFault?"ERR":(!sensorValid && isSensorRole()?"SENSOR!":(cfg.loggingEnabled?"REC":"STOP"));
  oled.drawStr(126-oled.getStrWidth(state.c_str()),8,state.c_str()); oled.setDrawColor(1);
  oled.drawHLine(0,54,128); oled.setFont(u8g2_font_5x8_tf);
  String left=String(page)+"/8 "+String(modeShort()); oled.drawStr(2,63,left.c_str());
  String right=String(cfg.intervalSec)+"s "+powerShort(); oled.drawStr(126-oled.getStrWidth(right.c_str()),63,right.c_str());
}
void dashText(int x,int y,int width,const String &text) {
  oled.setFont(u8g2_font_6x10_tf);
  String fitted=fitTextToWidth(text,width); oled.drawStr(x,y,fitted.c_str());
}
void dashBig(const String &value,const char *unit,int baseline=39) {
  oled.setFont(u8g2_font_logisoso24_tn);
  if(oled.getStrWidth(value.c_str())>96) oled.setFont(u8g2_font_6x10_tf);
  int width=oled.getStrWidth(value.c_str()); int x=max(2,(104-width)/2);
  oled.drawStr(x,baseline,value.c_str());
  oled.setFont(u8g2_font_6x10_tf); oled.drawStr(106,baseline,unit);
  if(strcmp(unit,"C")==0) oled.drawCircle(103,baseline-8,1);
}
void drawMainScreen() {
  dashBase("DASHBOARD",1);
  dashBig(shown(tempC),"C");
  dashText(2,51,73,shown(pressureHpa,0)+" hPa");
  String countdown=storageFault?"VOLL":(cfg.loggingEnabled?String(nextLogSeconds())+"s":"PAUSE");
  oled.setFont(u8g2_font_6x10_tf); oled.drawStr(126-oled.getStrWidth(countdown.c_str()),51,countdown.c_str());
  sendOledIfChanged();
}
void drawGaugeScreen() {
  dashBase(txtDEEN("TEMPERATUR","TEMPERATURE"),2);
  dashText(2,23,124,"MIN "+shown(minTempC)+" C");
  dashText(2,36,124,"MAX "+shown(maxTempC)+" C");
  String stable="Trend: "+trendText(0);
  if(historyCount>=60) {
    float lo=10000,hi=-10000;
    for(int i=historyCount-60;i<historyCount;i++) {float v=getHistoryValue(i,0); if(isfinite(v)){lo=min(lo,v); hi=max(hi,v);}}
    if(hi>=lo && hi-lo<=0.2f) stable=txtDEEN("Ruhig: 60 Werte","Quiet: 60 samples");
  }
  dashText(2,50,124,stable);
  sendOledIfChanged();
}
void drawGraphScreen() {
  const uint8_t hours = graphHours[cfg.graphWindow];
  const uint64_t now = elapsedNow(), span = (uint64_t)hours * 3600000ULL;
  const uint16_t minutes = hours * 60;
  String title = String(cfg.graphMode == 0 ? "TEMP C " : "DRUCK hPa ") + String(hours) + "h";
  if(cfg.language == 1 && cfg.graphMode == 1) title = String("PRESS hPa ") + String(hours) + "h";
  oled.clearBuffer(); oled.setDrawColor(1);
  oled.drawBox(0,0,128,10); oled.setDrawColor(0); oled.setFont(u8g2_font_5x8_tf);
  oled.drawStr(2,8,title.c_str()); oled.setDrawColor(1);
  // Aggregate onto physical pixel columns, keeping the sampled min/max envelope.
  float low[93], high[93];
  for(int x=0;x<93;x++){low[x]=INFINITY;high[x]=-INFINITY;}
  float lo=INFINITY,hi=-INFINITY;
  for(uint16_t age=0;age<=minutes;age++) {
    const HourPoint *point=hourHistory.atAge(now,age);
    if(!point || now-point->timeMs>span) continue;
    float value=cfg.graphMode==0?point->temperature:point->pressure;
    if(!isfinite(value)) continue;
    int x=92-(int)(((now-point->timeMs)*92ULL)/span);
    low[x]=min(low[x],value); high[x]=max(high[x],value);
    lo=min(lo,value); hi=max(hi,value);
  }
  if(isfinite(lo) && isfinite(hi)) {
    if(hi-lo<0.4f){float middle=(hi+lo)/2;lo=middle-0.2f;hi=middle+0.2f;}
    oled.drawStr(0,21,shown(hi,1).c_str()); oled.drawStr(0,43,shown(lo,1).c_str());
    int previousX=-1,previousY=0;
    for(int x=0;x<93;x++) {
      if(!isfinite(low[x])) {previousX=-1;continue;}
      int top=42-(int)((high[x]-lo)/(hi-lo)*26);
      int bottom=42-(int)((low[x]-lo)/(hi-lo)*26);
      top=constrain(top,16,42); bottom=constrain(bottom,16,42);
      oled.drawVLine(34+x,top,bottom-top+1);
      int middle=(top+bottom)/2;
      if(previousX>=0 && previousX==x-1) oled.drawLine(34+previousX,previousY,34+x,middle);
      previousX=x;previousY=middle;
    }
  } else { oled.drawStr(37,30,txtDEEN("Keine Daten","No data")); }
  oled.drawVLine(32,14,30); oled.drawHLine(32,44,95);
  String left=String("-")+String(hours)+"h";
  oled.drawStr(32,53,left.c_str());
  oled.drawStr(102,53,txtDEEN("jetzt","now"));
  oled.drawHLine(0,55,128);
  oled.drawStr(1,63,txtDEEN("OK:C/hPa BAK:Zeit","OK:C/hPa BAK:Time"));
  sendOledIfChanged();
}
void drawPressureScreen() {
  dashBase(txtDEEN("LUFTDRUCK","PRESSURE"),4);
  dashBig(shown(pressureHpa,0),"hPa");
  dashText(2,51,124,"Trend: "+trendText(1)); sendOledIfChanged();
}
void drawLogScreen() {
  dashBase(txtDEEN("AUFZEICHNUNG","RECORDING"),5);
  size_t total=fsReady?LittleFS.totalBytes():0,used=fsReady?LittleFS.usedBytes():0;
  dashText(2,23,124,String(logCount)+txtDEEN(" Messungen"," samples"));
  dashText(2,36,124,storageFault?storageMessage:String((total>=used?total-used:0)/1024)+txtDEEN(" KB frei"," KB free"));
  oled.drawFrame(2,42,124,9);
  if(total) oled.drawBox(4,44,(int)(120.0f*min(1.0f,(float)used/total)),5);
  sendOledIfChanged();
}
void drawCalScreen() {
  dashBase(txtDEEN("KALIBRIERUNG","CALIBRATION"),6);
  dashText(2,23,124,"RAW "+shown(rawTempC,2)+" C");
  dashText(2,36,124,"T "+shown(cfg.tempOffsetC,2)+" C Offset");
  dashText(2,50,124,"P "+shown(cfg.pressureOffsetHpa,1)+" hPa");
  sendOledIfChanged();
}
void drawNetworkScreen() {
  dashBase(txtDEEN("VERBINDUNGEN","CONNECTIONS"),7);
  dashText(2,23,124,WiFi.status()==WL_CONNECTED?"WLAN "+String(WiFi.RSSI())+" dBm":"WLAN offline / AP");
  dashText(2,36,124,String("MQTT ")+(mqttConnected?txtDEEN("verbunden","connected"):"offline"));
  uint32_t online=0; for(int i=0;i<MAX_TRUSTED;i++) if(nodeOnline[i]) online++;
  dashText(2,50,124,String("CH ")+String(WiFi.channel())+"  Nodes "+String(online));
  sendOledIfChanged();
}
void drawPowerScreen() {
  dashBase(txtDEEN("DIAGNOSE","DIAGNOSTICS"),8);
  dashText(2,23,124,String("Sensor ")+(sensorValid?"OK":txtDEEN("FEHLER","ERROR")));
  dashText(2,36,124,String(txtDEEN("RX Verlust ","RX dropped "))+String(rxDropped));
  dashText(2,50,124,epochNow()?txtDEEN("Zeit: synchron","Time: synced"):txtDEEN("Zeit: relativ","Time: relative"));
  sendOledIfChanged();
}

void drawMenuScreen() {
  oled.clearBuffer();
  drawHeader(cfg.language == 1 ? "MENU" : "MENUE");

  oled.setFont(u8g2_font_5x8_tf);
  drawFitStr(2, 20, 70, String(menuGroupName(menuIndex)));
  char countBuf[12];
  snprintf(countBuf, sizeof(countBuf), "%d/%d", menuIndex + 1, MENU_COUNT);
  drawRightText(20, countBuf);
  oled.drawHLine(0, 22, 128);

  oled.setFont(u8g2_font_5x8_tf);
  int first = menuIndex - 1;
  if (first < 0) first = 0;
  if (first > MENU_COUNT - 4) first = MENU_COUNT - 4;
  if (first < 0) first = 0;

