slawa01de-prog/ESP32-BMP280-Datenlogger/Esp32_LCD_Datalogger/Esp32_LCD_Datalogger.ino
  for (int i = 0; i < 4; i++) {
    int item = first + i;
    if (item >= MENU_COUNT) break;
    int yTop = 24 + i * 7;
    int yBase = yTop + 6;
    String txt = String(menuItemText(item));
    if (item == menuIndex) {
      oled.drawBox(0, yTop, 128, 8);
      oled.setDrawColor(0);
      drawFitStr(3, yBase, 120, String("> ") + txt);
      oled.setDrawColor(1);
    } else {
      drawFitStr(3, yBase, 120, String("  ") + txt);
    }
  }
  drawFooter("BAK", "OK");
  sendOledIfChanged();
}

void drawEditScreen(const char *title, const char *label, const String &value, const char *hint) {
  oled.clearBuffer();
  drawHeader(title);
  drawSoftFrame(6, 16, 116, 31);
  oled.setFont(u8g2_font_5x8_tf);
  drawFitStr(10, 26, 106, String(label));
  oled.setFont(u8g2_font_7x14B_tf);
  drawFitStr(10, 43, 106, value);
  drawFooter(hint, txtDEEN("BAK zurueck", "BAK back"));
  sendOledIfChanged();
}

void drawConfirmClearScreen() {
  oled.clearBuffer();
  drawHeader(cfg.language == 1 ? "CLEAR?" : "LOESCHEN?");
  drawSoftFrame(6, 16, 116, 31);
  oled.setFont(u8g2_font_5x8_tf);
  drawFitStr(12, 28, 104, cfg.language == 1 ? String("Delete local CSV?") : String("Lokale CSV loeschen?"));
  drawFitStr(12, 40, 104, cfg.language == 1 ? String("Settings stay saved") : String("Settings bleiben"));
  drawFooter(cfg.language == 1 ? "OK = YES" : "OK = JA", "BAK = NO");
  sendOledIfChanged();
}

void updateDisplay() {
  if (!oledOk || !displayOn) return;

  if (uiMode == UI_MENU) { drawMenuScreen(); return; }
  if (uiMode == UI_EDIT_INTERVAL) { drawEditScreen(cfg.language == 1 ? "INTERVAL" : "INTERVALL", cfg.language == 1 ? "Sec" : "Sek", String(editValue), cfg.language == 1 ? "Push save" : "Push speichern"); return; }
  if (uiMode == UI_EDIT_MAXDAYS) { drawEditScreen(cfg.language == 1 ? "MAX DAYS" : "MAX TAGE", cfg.language == 1 ? "Days" : "Tage", String(editFloat, 1), cfg.language == 1 ? "Push save" : "Push speichern"); return; }
  if (uiMode == UI_EDIT_TIMEOUT) { drawEditScreen("DISPLAY", cfg.language == 1 ? "Off after sec" : "Aus nach Sek", String(editValue), cfg.language == 1 ? "0=always on" : "0=immer an"); return; }
  if (uiMode == UI_EDIT_WAKE_DISPLAY) { drawEditScreen("WAKE", cfg.language == 1 ? "Sec" : "Sek", String(editValue), cfg.language == 1 ? "input time" : "Bedienzeit"); return; }
  if (uiMode == UI_EDIT_USB_WINDOW) { drawEditScreen("USB WIN", cfg.language == 1 ? "Sec" : "Sek", String(editValue), cfg.language == 1 ? "0=off" : "0=aus"); return; }
  if (uiMode == UI_EDIT_TEMP_OFFSET) { drawEditScreen("T-OFFSET", "C", String(editFloat, 2), cfg.language == 1 ? "manual offset" : "Offset manuell"); return; }
  if (uiMode == UI_EDIT_PRESS_OFFSET) { drawEditScreen("P-OFFSET", "hPa", String(editFloat, 1), cfg.language == 1 ? "manual offset" : "Offset manuell"); return; }
  if (uiMode == UI_CONFIRM_CLEAR) { drawConfirmClearScreen(); return; }

  if (cfg.screenMode == 0) {
    if (millis() - lastAutoPageMs > 8000) {
      lastAutoPageMs = millis();
      autoPage++;
      if (autoPage > 7) autoPage = 0;
    }
    switch (autoPage) {
      case 0: drawMainScreen(); break;
      case 1: drawGaugeScreen(); break;
      case 2: drawGraphScreen(); break;
      case 3: drawPressureScreen(); break;
      case 4: drawLogScreen(); break;
      case 5: drawCalScreen(); break;
      case 6: drawNetworkScreen(); break;
      case 7: drawPowerScreen(); break;
      default: drawMainScreen(); break;
    }
  } else {
    switch (cfg.screenMode) {
      case 1: drawMainScreen(); break;
      case 2: drawGaugeScreen(); break;
      case 3: drawGraphScreen(); break;
      case 4: drawPressureScreen(); break;
      case 5: drawLogScreen(); break;
      case 6: drawCalScreen(); break;
      case 7: drawNetworkScreen(); break;
      case 8: drawPowerScreen(); break;
      default: drawMainScreen(); break;
    }
  }
}

void drawStartupScreen() {
  if (!oledOk) return;
  oled.clearBuffer();
  drawHeader("LOGGER V7.4.3");
  drawSoftFrame(5, 16, 118, 31);
  oled.setFont(u8g2_font_6x10_tf);
  drawFitStr(12, 29, 104, String("BMP280 MultiNode"));
  drawFitStr(12, 41, 104, String("Start..."));
  drawFooter(txtDEEN("Push = Menue", "Push = Menu"), FW_VERSION);
  sendOledIfChanged();
}

void drawErrorScreen(const char *a, const char *b) {
  if (!oledOk) return;
  oled.clearBuffer();
  drawHeader("ERROR");
  drawSoftFrame(4, 16, 120, 31);
  oled.setFont(u8g2_font_5x8_tf);
  drawFitStr(10, 30, 108, String(a));
  drawFitStr(10, 42, 108, String(b));
  drawFooter("BAK/RESET", FW_VERSION);
  sendOledIfChanged();
}


// --------------------------------------------------
// UI Aktionen
// --------------------------------------------------
void resetStats() {
  hourHistory.clear();
  minTempC = NAN;
  maxTempC = NAN;
  minPressureHpa = NAN;
  maxPressureHpa = NAN;
  readCount = 0;
  historyIndex = 0;
  historyCount = 0;
  for (uint8_t i = 0; i < HISTORY_SIZE; i++) {
    tempHistory[i] = NAN;
    pressHistory[i] = NAN;
  }
  setEvent("Statistik reset");
}

void toggleLogging() {
  cfg.loggingEnabled = !cfg.loggingEnabled;
  saveConfig();
  setEvent(cfg.loggingEnabled ? "Logging START" : "Logging STOP");
}

void cyclePowerMode() {
  cfg.powerMode++;
  if (cfg.powerMode > POWER_DEEP) cfg.powerMode = POWER_NORMAL;
  if (cfg.powerMode == POWER_ECO || cfg.powerMode == POWER_DEEP) cfg.liveOutput = false;
  applyPowerMode();
}

void cycleMode() {
  cfg.mode++;
  if (cfg.mode > MODE_HYBRID) cfg.mode = MODE_SENSOR;
  if (cfg.mode == MODE_GATEWAY) cfg.powerMode = POWER_NORMAL;
  saveConfig();
  setEvent(String("Mode: ") + modeName());
}

void cycleScreenMode() {
  cfg.screenMode++;
  if (cfg.screenMode > 8) cfg.screenMode = 0;
  saveConfig();
}

void cycleGraphMode() {
  cfg.graphMode = cfg.graphMode == 0 ? 1 : 0;
  saveConfig();
  setEvent(cfg.graphMode == 0 ? "Graph Temp" : "Graph Druck");
}

void toggleUsbAutoNormal() {
  cfg.usbAutoNormal = !cfg.usbAutoNormal;
  saveConfig();
  setEvent(cfg.usbAutoNormal ? "USB Auto AN" : "USB Auto AUS");
}

void toggleLiveUsb() {
  cfg.liveOutput = !cfg.liveOutput;
  if (cfg.liveOutput) cfg.powerMode = POWER_NORMAL;
  saveConfig();
  setEvent(cfg.liveOutput ? "USB Live AN" : "USB Live AUS");
}

