slawa01de-prog/ESP32-BMP280-Datenlogger/Esp32_LCD_Datalogger/Esp32_LCD_Datalogger.ino
void togglePairMode() {
  cfg.pairMode = !cfg.pairMode;
  saveConfig();
  setEvent(cfg.pairMode ? "Pairing AN" : "Pairing AUS");
}

void pairReset() {
  cfg.paired = false;
  cfg.pairMode = true;
  memset(cfg.gatewayMac, 0, 6);
  saveConfig();
  setEvent("Pair Reset");
}

void showPairCodeSerial() {
  uint8_t mac[6];
  WiFi.macAddress(mac);
  uint32_t code = pairingCodeFor(cfg.nodeId, mac);

  loggerConsole.print("PAIRCODE,");
  loggerConsole.print(cfg.nodeId);
  loggerConsole.print(",");
  if (code < 100000) loggerConsole.print("0");
  if (code < 10000) loggerConsole.print("0");
  if (code < 1000) loggerConsole.print("0");
  if (code < 100) loggerConsole.print("0");
  if (code < 10) loggerConsole.print("0");
  loggerConsole.print(code);
  loggerConsole.print(",");
  loggerConsole.println(macToString(mac));
}

void cycleLanguage() {
  cfg.language = cfg.language == 1 ? 0 : 1;
  saveConfig();
  setEvent(cfg.language == 1 ? "Language: EN" : "Sprache: DE");
  printAck("set lang", languageCode());
  printStatusData();
}

void menuSelect() {
  switch (menuIndex) {
    case 0: uiMode = UI_DASHBOARD; break;
    case 1: toggleLogging(); break;
    case 2: readSensor(); logLocal(true); sendDataPacket(); break;
    case 3: uiMode = UI_EDIT_INTERVAL; editValue = cfg.intervalSec; break;
    case 4: uiMode = UI_EDIT_MAXDAYS; editFloat = cfg.maxDays; break;
    case 5: uiMode = UI_EDIT_TEMP_OFFSET; editFloat = cfg.tempOffsetC; break;
    case 6: uiMode = UI_EDIT_PRESS_OFFSET; editFloat = cfg.pressureOffsetHpa; break;
    case 7: cyclePowerMode(); break;
    case 8: uiMode = UI_EDIT_TIMEOUT; editValue = cfg.displayTimeoutSec; break;
    case 9: uiMode = UI_EDIT_WAKE_DISPLAY; editValue = cfg.wakeDisplaySec; break;
    case 10: toggleUsbAutoNormal(); break;
    case 11: uiMode = UI_EDIT_USB_WINDOW; editValue = cfg.usbWindowSec; break;
    case 12: toggleLiveUsb(); break;
    case 13: cycleScreenMode(); break;
    case 14: cycleGraphMode(); break;
    case 15: cycleMode(); break;
    case 16: togglePairMode(); break;
    case 17: showPairCodeSerial(); cfg.screenMode = 7; saveConfig(); break;
    case 18: pairReset(); break;
    case 19: resetStats(); break;
    case 20: uiMode = UI_CONFIRM_CLEAR; break;
    case 21: cycleLanguage(); break;
  }
}

void handleUiInput() {
  bool anyUserInput = (encoderDelta != 0 || btnPush.pressedEvent || btnBak.pressedEvent || btnCon.pressedEvent);

  if (anyUserInput) {
    if (!displayOn) {
      wakeDisplay("Taste");
      return;
    }
    lastUserActionMs = millis();
    lastAutoPageMs = millis();
  }

  if (uiMode == UI_DASHBOARD) {
    bool graphVisible = cfg.screenMode == 3 || (cfg.screenMode == 0 && autoPage == 2);
    if (graphVisible && (btnPush.pressedEvent || btnBak.pressedEvent)) {
      if (btnPush.pressedEvent) cfg.graphMode = cfg.graphMode == 0 ? 1 : 0;
      if (btnBak.pressedEvent) cfg.graphWindow = (cfg.graphWindow + 1) % 4;
      cfg.screenMode = 3; // Keep the graph visible while inspecting a selected period.
      saveConfig();
      return;
    }
    if (encoderDelta > 0) {
      if (cfg.screenMode == 0) autoPage = (autoPage + 1) % 8;
      else {
        cfg.screenMode++;
        if (cfg.screenMode > 8) cfg.screenMode = 1;
        saveConfig();
      }
    } else if (encoderDelta < 0) {
      if (cfg.screenMode == 0) {
        if (autoPage == 0) autoPage = 7;
        else autoPage--;
      } else {
        if (cfg.screenMode <= 1) cfg.screenMode = 8;
        else cfg.screenMode--;
        saveConfig();
      }
    }

    if (btnPush.pressedEvent || btnCon.pressedEvent) {
      uiMode = UI_MENU;
      menuIndex = 0;
      setEvent(cfg.language == 1 ? "Menu" : "Menue");
    }
    return;
  }

  if (uiMode == UI_MENU) {
    if (encoderDelta > 0) {
      menuIndex++;
      if (menuIndex >= MENU_COUNT) menuIndex = 0;
    } else if (encoderDelta < 0) {
      menuIndex--;
      if (menuIndex < 0) menuIndex = MENU_COUNT - 1;
    }

    if (btnPush.pressedEvent || btnCon.pressedEvent) menuSelect();
    if (btnBak.pressedEvent) uiMode = UI_DASHBOARD;
    return;
  }

  if (uiMode == UI_EDIT_INTERVAL) {
    if (encoderDelta > 0) editValue += 10;
    if (encoderDelta < 0) editValue -= 10;
    if (editValue < 1) editValue = 1;
    if (editValue > 3600) editValue = 3600;
    if (btnPush.pressedEvent || btnCon.pressedEvent) {
      cfg.intervalSec = editValue;
      saveConfig();
      uiMode = UI_MENU;
    }
    if (btnBak.pressedEvent) uiMode = UI_MENU;
    return;
  }

  if (uiMode == UI_EDIT_MAXDAYS) {
    if (encoderDelta > 0) editFloat += 0.1f;
    if (encoderDelta < 0) editFloat -= 0.1f;
    if (editFloat < 0.1f) editFloat = 0.1f;
    if (editFloat > 7.0f) editFloat = 7.0f;
    if (btnPush.pressedEvent || btnCon.pressedEvent) {
      cfg.maxDays = editFloat;
      saveConfig();
      uiMode = UI_MENU;
    }
    if (btnBak.pressedEvent) uiMode = UI_MENU;
    return;
  }

  if (uiMode == UI_EDIT_TIMEOUT) {
    if (encoderDelta > 0) editValue += 5;
    if (encoderDelta < 0) editValue -= 5;
    if (editValue < 0) editValue = 0;
    if (editValue > 600) editValue = 600;
    if (btnPush.pressedEvent || btnCon.pressedEvent) {
      cfg.displayTimeoutSec = editValue;
      saveConfig();
      uiMode = UI_MENU;
    }
    if (btnBak.pressedEvent) uiMode = UI_MENU;
    return;
  }

  if (uiMode == UI_EDIT_WAKE_DISPLAY) {
    if (encoderDelta > 0) editValue += 5;
    if (encoderDelta < 0) editValue -= 5;
    if (editValue < 5) editValue = 5;
    if (editValue > 300) editValue = 300;
    if (btnPush.pressedEvent || btnCon.pressedEvent) {
      cfg.wakeDisplaySec = editValue;
      saveConfig();
      uiMode = UI_MENU;
    }
    if (btnBak.pressedEvent) uiMode = UI_MENU;
    return;
  }

  if (uiMode == UI_EDIT_USB_WINDOW) {
    if (encoderDelta > 0) editValue += 1;
    if (encoderDelta < 0) editValue -= 1;
    if (editValue < 0) editValue = 0;
    if (editValue > 30) editValue = 30;
    if (btnPush.pressedEvent || btnCon.pressedEvent) {
      cfg.usbWindowSec = editValue;
      saveConfig();
      uiMode = UI_MENU;
    }
    if (btnBak.pressedEvent) uiMode = UI_MENU;
    return;
  }

