slawa01de-prog/ESP32-BMP280-Datenlogger/Esp32_LCD_Datalogger/Esp32_LCD_Datalogger.ino
  if (uiMode == UI_EDIT_TEMP_OFFSET) {
    if (encoderDelta > 0) editFloat += 0.1f;
    if (encoderDelta < 0) editFloat -= 0.1f;
    if (btnPush.pressedEvent || btnCon.pressedEvent) {
      cfg.tempOffsetC = editFloat;
      saveConfig();
      readSensor();
      uiMode = UI_MENU;
    }
    if (btnBak.pressedEvent) uiMode = UI_MENU;
    return;
  }

  if (uiMode == UI_EDIT_PRESS_OFFSET) {
    if (encoderDelta > 0) editFloat += 0.5f;
    if (encoderDelta < 0) editFloat -= 0.5f;
    if (btnPush.pressedEvent || btnCon.pressedEvent) {
      cfg.pressureOffsetHpa = editFloat;
      saveConfig();
      readSensor();
      uiMode = UI_MENU;
    }
    if (btnBak.pressedEvent) uiMode = UI_MENU;
    return;
  }

  if (uiMode == UI_CONFIRM_CLEAR) {
    if (btnCon.pressedEvent || btnPush.pressedEvent) {
      clearLocalLog();
      uiMode = UI_MENU;
    }
    if (btnBak.pressedEvent) uiMode = UI_MENU;
    return;
  }
}


// --------------------------------------------------
// Command ACK / GUI feedback
// --------------------------------------------------
void printAck(const String &cmd, const String &msg) {
  loggerConsole.print("ACK,");
  loggerConsole.print(cmd);
  loggerConsole.print(",");
  loggerConsole.println(msg);
}

void printErr(const String &cmd, const String &msg) {
  loggerConsole.print("ERR,");
  loggerConsole.print(cmd);
  loggerConsole.print(",");
  loggerConsole.println(msg);
}

// --------------------------------------------------
// WebGUI / OTA
// --------------------------------------------------
String htmlEscape(String s) {
  s.replace("&", "&amp;");
  s.replace("<", "&lt;");
  s.replace(">", "&gt;");
  s.replace("\"", "&quot;");
  return s;
}

String jsonEscape(String s) {
  s.replace("\\", "\\\\");
  s.replace("\"", "\\\"");
  s.replace("\n", "\\n");
  s.replace("\r", "");
  return s;
}

String webModeShort() {
  if (cfg.mode == MODE_SENSOR) return "SEN";
  if (cfg.mode == MODE_GATEWAY) return "GW";
  return "HYB";
}

String webPowerShort() {
  if (cfg.powerMode == POWER_ECO) return "ECO";
  if (cfg.powerMode == POWER_DEEP) return "SLP";
  return "NOR";
}

String webIpInfo() {
  String s = "";
  if (WiFi.status() == WL_CONNECTED) {
    s += "STA ";
    s += WiFi.localIP().toString();
  }
  IPAddress apIp = WiFi.softAPIP();
  if (apIp[0] != 0) {
    if (s.length()) s += " | ";
    s += "AP ";
    s += apIp.toString();
  }
  if (!s.length()) s = "nicht verbunden";
  return s;
}

bool webAuth() {
  if (webServer.authenticate(cfg.webUser, cfg.webPass)) return true;
  webServer.requestAuthentication(BASIC_AUTH, "BMP280 Logger");
  return false;
}

void sendJson(const String &payload) {
  webServer.sendHeader("Cache-Control", "no-store");
  webServer.send(200, "application/json", payload);
}

// --------------------------------------------------
// MQTT / Home Assistant Discovery
// --------------------------------------------------
String mqttSanitize(String s) {
  s.trim();
  if (!s.length()) s = "bmp280";
  for (uint16_t i = 0; i < s.length(); i++) {
    char c = s[i];
    bool ok = (c >= 'a' && c <= 'z') || (c >= 'A' && c <= 'Z') || (c >= '0' && c <= '9') || c == '_' || c == '-';
    if (!ok) s.setCharAt(i, '_');
  }
  return s;
}

String mqttBaseTopic(const String &id) {
  return mqttSanitize(String(cfg.mqttPrefix)) + "/" + mqttSanitize(id);
}

String mqttDeviceJson(const String &id, const String &name) {
  String did = "bmp280_" + mqttSanitize(id);
  String d = "{\"identifiers\":[\"" + did + "\"],";
  d += "\"name\":\"" + jsonEscape(name) + "\",";
  d += "\"manufacturer\":\"DIY\",";
  d += "\"model\":\"BMP280 MultiNode Logger\",";
  d += "\"sw_version\":\"" + jsonEscape(String(FW_VERSION)) + "\"}";
  return d;
}

#if BMP_HAS_MQTT
void mqttCallback(char* topic, byte* payload, unsigned int length) {
  String cmd;
  for (unsigned int i = 0; i < length && i < 80; i++) cmd += (char)payload[i];
  cmd.trim();
  String original=cmd;
  cmd.toLowerCase();
  if (!cmd.length()) return;
  if (cmd == "start") { cfg.loggingEnabled = true; saveConfig(); printAck("mqtt start", "OK"); }
  else if (cmd == "stop") { cfg.loggingEnabled = false; saveConfig(); printAck("mqtt stop", "OK"); }
  else if (cmd == "once") { readSensor(); logLocal(true); sendDataPacket(); printAck("mqtt once", "OK"); }
  else if (cmd == "clear") { clearLocalLog(); }
  else if (cmd == "wake") { wakeDisplay("MQTT"); printAck("mqtt wake", "OK"); }
  else if (cmd.startsWith("set ")) handleSetCommand(original);
  else if (cmd.startsWith("cal ")) handleCalCommand(cmd);
  mqttPublishLocalState(true);
}
#endif

bool mqttIsUsable() {
#if BMP_HAS_MQTT
  return cfg.mqttEnabled && cfg.powerMode != POWER_DEEP && strlen(cfg.mqttHost) > 0 && WiFi.status() == WL_CONNECTED;
#else
  return false;
#endif
}

void mqttDisconnect() {
#if BMP_HAS_MQTT
  if (mqttClient.connected()) { mqttClient.publish((mqttBaseTopic(cfg.nodeId)+"/availability").c_str(),"offline",true); mqttClient.disconnect(); }
#endif
  mqttConnected = false;
}

bool mqttEnsureConnected() {
#if BMP_HAS_MQTT
  if (!mqttIsUsable()) { mqttDisconnect(); return false; }
  if (mqttClient.connected()) { mqttConnected = true; return true; }
  unsigned long now = millis();
  if (now - lastMqttAttemptMs < 5000) return false;
  lastMqttAttemptMs = now;
  mqttClient.setBufferSize(1024);
  mqttClient.setSocketTimeout(1);
  mqttWifiClient.setConnectionTimeout(1000);
  mqttClient.setServer(cfg.mqttHost, cfg.mqttPort);
  mqttClient.setCallback(mqttCallback);
  String clientId = "bmp280-" + mqttSanitize(String(cfg.nodeId));
  bool ok;
  if (strlen(cfg.mqttUser) > 0) ok = mqttClient.connect(clientId.c_str(), cfg.mqttUser, cfg.mqttPass, (mqttBaseTopic(cfg.nodeId)+"/availability").c_str(), 1, true, "offline");
  else ok = mqttClient.connect(clientId.c_str(), (mqttBaseTopic(cfg.nodeId)+"/availability").c_str(), 1, true, "offline");
  mqttConnected = ok;
  mqttLastState = ok ? "MQTT connected" : "MQTT connect failed";
  if (ok) {
    mqttDiscoverySent=false;
    for(int i=0;i<MAX_TRUSTED;i++) if(trusted[i].used && !nodeOnline[i]) mqttClient.publish((mqttBaseTopic(trusted[i].id)+"/availability").c_str(),"offline",true);
    String cmdTopic = mqttBaseTopic(cfg.nodeId) + "/cmd";
    mqttClient.subscribe(cmdTopic.c_str());
    if (cfg.mqttDiscovery && !mqttDiscoverySent) mqttPublishDiscoveryAll();
    mqttPublishLocalState(true);
  }
  return ok;
#else
  mqttConnected = false;
  mqttLastState = "PubSubClient fehlt";
  return false;
#endif
}

