slawa01de-prog/ESP32-BMP280-Datenlogger/Esp32_LCD_Datalogger/Esp32_LCD_Datalogger.ino
void mqttPublishRaw(const String &topic, const String &payload, bool retained=false) {
#if BMP_HAS_MQTT
  if (!mqttEnsureConnected()) return;
  if(!mqttClient.publish(topic.c_str(), payload.c_str(), retained)) mqttPublishFailures++;
#endif
}

void mqttDiscoverySensor(const String &id, const String &name, const String &key, const String &label, const String &unit, const String &deviceClass, const String &stateClass) {
  String uid = "bmp280_" + mqttSanitize(id) + "_" + key;
  String topic = "homeassistant/sensor/" + uid + "/config";
  String stateTopic = mqttBaseTopic(id) + "/state";
  String payload = "{\"name\":\"" + jsonEscape(label) + "\",";
  payload += "\"unique_id\":\"" + uid + "\",";
  payload += "\"state_topic\":\"" + stateTopic + "\",";
  payload += "\"value_template\":\"{{ value_json." + key + " }}\",";
  if (unit.length()) payload += "\"unit_of_measurement\":\"" + unit + "\",";
  if (deviceClass.length()) payload += "\"device_class\":\"" + deviceClass + "\",";
  if (stateClass.length()) payload += "\"state_class\":\"" + stateClass + "\",";
  if(id != String(cfg.nodeId)) payload += "\"availability_mode\":\"all\",\"availability\":[{\"topic\":\""+mqttBaseTopic(id)+"/availability\"},{\"topic\":\""+mqttBaseTopic(cfg.nodeId)+"/availability\"}],";
  else payload += "\"availability_topic\":\"" + mqttBaseTopic(id) + "/availability\",";
  payload += "\"device\":" + mqttDeviceJson(id, name) + "}";
  mqttPublishRaw(topic, payload, true);
}

void mqttDiscoveryBinary(const String &id, const String &name, const String &key, const String &label) {
  String uid = "bmp280_" + mqttSanitize(id) + "_" + key;
  String topic = "homeassistant/binary_sensor/" + uid + "/config";
  String payload = "{\"name\":\"" + jsonEscape(label) + "\",";
  payload += "\"unique_id\":\"" + uid + "\",";
  payload += "\"state_topic\":\"" + mqttBaseTopic(id) + "/state\",";
  payload += "\"value_template\":\"{{ value_json." + key + " }}\",";
  payload += "\"payload_on\":\"ON\",\"payload_off\":\"OFF\",";
  if(id != String(cfg.nodeId)) payload += "\"availability_mode\":\"all\",\"availability\":[{\"topic\":\""+mqttBaseTopic(id)+"/availability\"},{\"topic\":\""+mqttBaseTopic(cfg.nodeId)+"/availability\"}],";
  else payload += "\"availability_topic\":\"" + mqttBaseTopic(id) + "/availability\",";
  payload += "\"device\":" + mqttDeviceJson(id, name) + "}";
  mqttPublishRaw(topic, payload, true);
}

void mqttDiscoveryButton(const String &id, const String &name, const String &cmd, const String &label) {
  String uid = "bmp280_" + mqttSanitize(id) + "_btn_" + mqttSanitize(cmd);
  String topic = "homeassistant/button/" + uid + "/config";
  String payload = "{\"name\":\"" + jsonEscape(label) + "\",";
  payload += "\"unique_id\":\"" + uid + "\",";
  payload += "\"command_topic\":\"" + mqttBaseTopic(id) + "/cmd\",";
  payload += "\"payload_press\":\"" + cmd + "\",";
  if(id != String(cfg.nodeId)) payload += "\"availability_mode\":\"all\",\"availability\":[{\"topic\":\""+mqttBaseTopic(id)+"/availability\"},{\"topic\":\""+mqttBaseTopic(cfg.nodeId)+"/availability\"}],";
  else payload += "\"availability_topic\":\"" + mqttBaseTopic(id) + "/availability\",";
  payload += "\"device\":" + mqttDeviceJson(id, name) + "}";
  mqttPublishRaw(topic, payload, true);
}

void mqttPublishDiscoveryFor(const String &id, const String &name, bool withButtons) {
  mqttDiscoverySensor(id, name, "temperature", "Temperature", "°C", "temperature", "measurement");
  mqttDiscoverySensor(id, name, "pressure", "Pressure", "hPa", "pressure", "measurement");
  mqttDiscoverySensor(id, name, "raw_temperature", "Raw temperature", "°C", "temperature", "measurement");
  mqttDiscoverySensor(id, name, "raw_pressure", "Raw pressure", "hPa", "pressure", "measurement");
  mqttDiscoverySensor(id, name, "log_count", "Log count", "", "", "total_increasing");
  mqttDiscoverySensor(id, name, "mode", "Mode", "", "", "");
  mqttDiscoverySensor(id, name, "power", "Power", "", "", "");
  mqttDiscoveryBinary(id, name, "logging", "Logging");
  if (withButtons) {
    mqttDiscoveryButton(id, name, "start", "Logging Start");
    mqttDiscoveryButton(id, name, "stop", "Logging Stop");
    mqttDiscoveryButton(id, name, "once", "Log 1 Sample");
    mqttDiscoveryButton(id, name, "clear", "Clear Local Log");
    mqttDiscoveryButton(id, name, "wake", "Wake Display");
  }
}

void mqttPublishDiscoveryAll() {
  if (!cfg.mqttDiscovery || !mqttIsUsable()) return;
  uint32_t failedBefore=mqttPublishFailures; lastDiscoveryTryMs=millis();
  mqttPublishDiscoveryFor(String(cfg.nodeId), String(cfg.nodeName), true);
  if (isGatewayRole()) {
    for (int i = 0; i < MAX_TRUSTED; i++) if (trusted[i].used) mqttPublishDiscoveryFor(String(trusted[i].id), String(trusted[i].name[0] ? trusted[i].name : trusted[i].id), false);
  }
  mqttDiscoverySent = (failedBefore==mqttPublishFailures && mqttConnected);
  if(mqttDiscoverySent) printAck("mqtt discovery", "sent");
}

String mqttStatePayload(const String &id, const String &name, const String &fw, uint32_t logNo, float rt, float t, float rp, float p, float to, float po, uint8_t mode, uint8_t power, uint8_t wake, const String &mac, bool logging, uint64_t elapsed, uint64_t epoch) {
  String payload = "{";
  payload += "\"id\":\"" + jsonEscape(id) + "\",";
  payload += "\"name\":\"" + jsonEscape(name) + "\",";
  payload += "\"fw\":\"" + jsonEscape(fw) + "\",";
  payload += "\"temperature\":" + finiteJson(t) + ",";
  payload += "\"pressure\":" + finiteJson(p) + ",";
  payload += "\"raw_temperature\":" + finiteJson(rt) + ",";
  payload += "\"raw_pressure\":" + finiteJson(rp) + ",";
  payload += "\"temp_offset\":" + String(to, 2) + ",";
  payload += "\"press_offset\":" + String(po, 2) + ",";
  payload += "\"log_count\":" + String(logNo) + ",";
  payload += "\"mode\":\"" + String(mode == MODE_SENSOR ? "sensor" : (mode == MODE_GATEWAY ? "gateway" : "hybrid")) + "\",";
  payload += "\"power\":\"" + String(power == POWER_ECO ? "eco" : (power == POWER_DEEP ? "deep" : "normal")) + "\",";
  payload += "\"logging\":\"" + String(logging ? "ON" : "OFF") + "\",";
  payload += "\"wake\":" + String(wake) + ",";
  payload += "\"mac\":\"" + jsonEscape(mac) + "\",";
  payload += "\"uptime_ms\":" + u64str(elapsed) + ",\"epoch_ms\":" + u64str(epoch);
  payload += "}";
  return payload;
}

void mqttPublishLocalState(bool force) {
  if (!force && millis()-lastMqttPublishMs<1000) return;
  if (!mqttEnsureConnected()) return;
  uint8_t ownMac[6]; WiFi.macAddress(ownMac);
  String base = mqttBaseTopic(cfg.nodeId);
  mqttPublishRaw(base + "/availability", "online", true);
  mqttPublishRaw(base + "/state", mqttStatePayload(cfg.nodeId, cfg.nodeName, FW_VERSION, logCount, rawTempC, tempC, rawPressureHpa, pressureHpa, cfg.tempOffsetC, cfg.pressureOffsetHpa, cfg.mode, cfg.powerMode, (uint8_t)wakeCause, macToString(ownMac), cfg.loggingEnabled, sampleElapsed, sampleEpoch), false);
  lastMqttPublishMs = millis();
}

