slawa01de-prog/ESP32-BMP280-Datenlogger/Esp32_LCD_Datalogger/Esp32_LCD_Datalogger.ino
void mqttPublishPacketState(const DataPacket &p) {
  if (!mqttEnsureConnected()) return;
  String base = mqttBaseTopic(p.id);
  mqttPublishRaw(base + "/availability", "online", true);
  mqttPublishRaw(base + "/state", mqttStatePayload(p.id, p.name, p.fw, p.logNo, p.rawTempC, p.tempC, p.rawPressureHpa, p.pressureHpa, p.tempOffsetC, p.pressureOffsetHpa, p.mode, p.powerMode, p.wakeCause, macToString(p.mac), (p.flags & 1)!=0, p.elapsedMs, p.epochMs), false);
}

void handleMqtt() {
#if BMP_HAS_MQTT
  if (!mqttIsUsable()) { mqttDisconnect(); return; }
  if (mqttEnsureConnected()) mqttClient.loop();
  for(int i=0;i<MAX_TRUSTED;i++) if(trusted[i].used && nodeOnline[i] && millis()-trusted[i].lastSeenMs>nodeTimeoutMs[i]) {
    mqttPublishRaw(mqttBaseTopic(trusted[i].id)+"/availability","offline",true); nodeOnline[i]=false;
  }
  if(mqttClient.connected() && cfg.mqttDiscovery && !mqttDiscoverySent && millis()-lastDiscoveryTryMs>5000) mqttPublishDiscoveryAll();
  if (mqttClient.connected() && millis() - lastMqttPublishMs > 10000) mqttPublishLocalState(false);
#endif
}

void printMqttStatus() {
  loggerConsole.print("MQTT,");
#if BMP_HAS_MQTT
  loggerConsole.print(cfg.mqttEnabled ? "on" : "off"); loggerConsole.print(",");
  loggerConsole.print(mqttClient.connected() ? "connected" : "disconnected"); loggerConsole.print(",host,");
  loggerConsole.print(cfg.mqttHost); loggerConsole.print(",port,");
  loggerConsole.print(cfg.mqttPort); loggerConsole.print(",prefix,");
  loggerConsole.print(cfg.mqttPrefix); loggerConsole.print(",discovery,");
  loggerConsole.println(cfg.mqttDiscovery ? "on" : "off");
#else
  loggerConsole.println("missing_pubsubclient");
#endif
}

String statusJson() {
  uint16_t trustedCount = 0;
  for (int i = 0; i < MAX_TRUSTED; i++) if (trusted[i].used) trustedCount++;
  size_t used = LittleFS.usedBytes();
  size_t total = LittleFS.totalBytes();
  String j = "{";
  j += "\"id\":\"" + jsonEscape(String(cfg.nodeId)) + "\",";
  j += "\"name\":\"" + jsonEscape(String(cfg.nodeName)) + "\",";
  j += "\"fw\":\"" + jsonEscape(String(FW_VERSION)) + "\",";
  j += "\"temp\":" + finiteJson(tempC) + ",";
  j += "\"press\":" + finiteJson(pressureHpa) + ",";
  j += "\"rawTemp\":" + finiteJson(rawTempC) + ",";
  j += "\"rawPress\":" + finiteJson(rawPressureHpa) + ",";
  j += "\"tempOffset\":" + String(cfg.tempOffsetC, 2) + ",";
  j += "\"pressOffset\":" + String(cfg.pressureOffsetHpa, 2) + ",";
  j += "\"mode\":\"" + webModeShort() + "\",";
  j += "\"power\":\"" + webPowerShort() + "\",";
  j += "\"logging\":" + String(cfg.loggingEnabled ? "true" : "false") + ",";
  j += "\"interval\":" + String(cfg.intervalSec) + ",";
  j += "\"logCount\":" + String(logCount) + ",";
  j += "\"maxSamples\":" + String(getMaxSamples()) + ",";
  j += "\"fsUsed\":" + String((uint32_t)used) + ",";
  j += "\"fsTotal\":" + String((uint32_t)total) + ",";
  j += "\"paired\":" + String(cfg.paired ? "true" : "false") + ",";
  j += "\"pairMode\":" + String(cfg.pairMode ? "true" : "false") + ",";
  j += "\"nodes\":" + String(trustedCount) + ",";
  j += "\"lang\":\"" + String(languageCode()) + "\",";
  j += "\"web\":" + String(webRunning ? "true" : "false") + ",";
  j += "\"defaultPass\":" + String((String(cfg.webUser)=="admin" && String(cfg.webPass)=="admin") ? "true" : "false") + ",";
  j += "\"ip\":\"" + jsonEscape(webIpInfo()) + "\",";
  j += "\"host\":\"" + jsonEscape(String(cfg.webHost)) + "\",";
  j += "\"event\":\"" + jsonEscape(lastEvent) + "\"";
  j += "}";
  return j;
}

void handleApiStatus() { if (!webAuth()) return; sendJson(statusJson()); }

void handleApiHistory() {
  if (!webAuth()) return;
  String j = "{\"temp\":[";
  for (uint8_t i = 0; i < historyCount; i++) {
    uint8_t idx = (historyIndex + HISTORY_SIZE - historyCount + i) % HISTORY_SIZE;
    if (i) j += ",";
    if (isnan(tempHistory[idx])) j += "null"; else j += String(tempHistory[idx], 2);
  }
  j += "],\"press\":[";
  for (uint8_t i = 0; i < historyCount; i++) {
    uint8_t idx = (historyIndex + HISTORY_SIZE - historyCount + i) % HISTORY_SIZE;
    if (i) j += ",";
    if (isnan(pressHistory[idx])) j += "null"; else j += String(pressHistory[idx], 2);
  }
  j += "]}";
  sendJson(j);
}

void handleApiCmd() {
  if (!webAuth()) return;
  String raw = webServer.arg("cmd");
  raw = cleanInput(raw);
  String lower = raw; lower.toLowerCase();
  bool ok = true;
  if (lower == "start") { cfg.loggingEnabled = true; saveConfig(); printAck("start", "web"); }
  else if (lower == "stop") { cfg.loggingEnabled = false; saveConfig(); printAck("stop", "web"); }
  else if (lower == "once") { readSensor(); logLocal(true); sendDataPacket(); printAck("once", "web"); }
  else if (lower == "clear") { clearLocalLog(); }
  else if (lower == "wake") { wakeDisplay("Web"); printAck("wake", "web"); }
  else if (lower == "storage") { printStorage(); }
  else if (lower == "web status") { printWebStatus(); }
  else if (lower == "mqtt discovery") { mqttDiscoverySent=false; mqttPublishDiscoveryAll(); }
  else if (lower == "mqtt publish") { mqttPublishLocalState(true); }
  else if (lower == "mqtt status") { printMqttStatus(); }
  else if (lower.startsWith("set ")) { handleSetCommand(raw); }
  else if (lower.startsWith("cal ")) { handleCalCommand(raw); }
  else { ok = false; }
  printStatusData();
  sendJson(String("{\"ok\":") + (ok ? "true" : "false") + ",\"cmd\":\"" + jsonEscape(raw) + "\"}");
}

void handleApiSecurity() {
  if (!webAuth()) return;
  String u = webServer.arg("user");
  String p = webServer.arg("pass");
  u.trim(); p.trim();
  if (u.length() < 1 || u.length() > 16 || p.length() < 1 || p.length() > 32) {
    webServer.send(400, "application/json", "{\"ok\":false,\"error\":\"bad length\"}");
    return;
  }
  memset(cfg.webUser, 0, sizeof(cfg.webUser));
  memset(cfg.webPass, 0, sizeof(cfg.webPass));
  strncpy(cfg.webUser, u.c_str(), sizeof(cfg.webUser)-1);
  strncpy(cfg.webPass, p.c_str(), sizeof(cfg.webPass)-1);
  saveConfig(); sendJson("{\"ok\":true}");
}

void handleApiWifi() {
  if (!webAuth()) return;
  String ssid = webServer.arg("ssid");
  String pass = webServer.arg("pass");
  String host = webServer.arg("host");
  ssid.trim(); host.trim();
  if (ssid.length() > 32 || pass.length() > 64 || host.length() > 32) {
    webServer.send(400, "application/json", "{\"ok\":false,\"error\":\"too long\"}"); return;
  }
  memset(cfg.wifiSsid, 0, sizeof(cfg.wifiSsid));
  memset(cfg.wifiPass, 0, sizeof(cfg.wifiPass));
  strncpy(cfg.wifiSsid, ssid.c_str(), sizeof(cfg.wifiSsid)-1);
  strncpy(cfg.wifiPass, pass.c_str(), sizeof(cfg.wifiPass)-1);
  if (host.length()) { memset(cfg.webHost, 0, sizeof(cfg.webHost)); strncpy(cfg.webHost, host.c_str(), sizeof(cfg.webHost)-1); }
  saveConfig();
  sendJson("{\"ok\":true,\"note\":\"reconnect/reboot recommended\"}");
  WiFi.disconnect(false,false); delay(50); setupWebIfAllowed();
}


void handleApiMqtt() {
  if (!webAuth()) return;
  String en = webServer.arg("enabled");
  String host = webServer.arg("host");
  String port = webServer.arg("port");
  String user = webServer.arg("user");
  String pass = webServer.arg("pass");
  String prefix = webServer.arg("prefix");
  String disc = webServer.arg("discovery");
  if (host.length() > 64 || user.length() > 32 || pass.length() > 32 || prefix.length() > 32) { webServer.send(400, "application/json", "{\"ok\":false,\"error\":\"too long\"}"); return; }
  cfg.mqttEnabled = (en == "1" || en == "on" || en == "true");
  cfg.mqttDiscovery = !(disc == "0" || disc == "off" || disc == "false");
  memset(cfg.mqttHost, 0, sizeof(cfg.mqttHost)); strncpy(cfg.mqttHost, host.c_str(), sizeof(cfg.mqttHost)-1);
  uint16_t p = (uint16_t)port.toInt(); cfg.mqttPort = p ? p : 1883;
  memset(cfg.mqttUser, 0, sizeof(cfg.mqttUser)); strncpy(cfg.mqttUser, user.c_str(), sizeof(cfg.mqttUser)-1);
  memset(cfg.mqttPass, 0, sizeof(cfg.mqttPass)); strncpy(cfg.mqttPass, pass.c_str(), sizeof(cfg.mqttPass)-1);
  memset(cfg.mqttPrefix, 0, sizeof(cfg.mqttPrefix)); strncpy(cfg.mqttPrefix, prefix.length() ? prefix.c_str() : "bmp280", sizeof(cfg.mqttPrefix)-1);
  mqttDiscoverySent = false;
  mqttDisconnect();
  saveConfig();
  webServer.send(200, "application/json", "{\"ok\":true}");
}

void handleDownloadLocal() {
  if (!webAuth()) return;
  if (!LittleFS.exists(LOCAL_LOG_FILE)) { webServer.send(404, "text/plain", "local_log.csv nicht gefunden"); return; }
  File f = LittleFS.open(LOCAL_LOG_FILE, "r");
  webServer.sendHeader("Content-Disposition", "attachment; filename=local_log.csv");
  webServer.streamFile(f, "text/csv");
  f.close();
}

void handleDownloadLegacy() {
  if(!webAuth()) return;
  File f=LittleFS.open("/local_log.csv","r");
  if(!f) { webServer.send(404,"text/plain","Keine V73-Datei"); return; }
  webServer.sendHeader("Content-Disposition","attachment; filename=local_log_v73.csv");
  webServer.streamFile(f,"text/csv"); f.close();
}

void handleDownloadNode() {
  if (!webAuth()) return;
  String id = webServer.arg("id"); id.trim(); id.toUpperCase();
  if (id.length() != 10) { webServer.send(400, "text/plain", "NODE ID fehlt"); return; }
  String fn = "/v74_" + id + ".csv";
  if (!LittleFS.exists(fn)) { webServer.send(404, "text/plain", "Node CSV nicht gefunden"); return; }
  File f = LittleFS.open(fn, "r");
  webServer.sendHeader("Content-Disposition", "attachment; filename=node_" + id + ".csv");
  webServer.streamFile(f, "text/csv"); f.close();
}

