slawa01de-prog/ESP32-BMP280-Datenlogger/Esp32_LCD_Datalogger/Esp32_LCD_Datalogger.ino
void handleUpdatePage() {
  if (!webAuth()) return;
  String p = "<html><head><meta name='viewport' content='width=device-width,initial-scale=1'><title>OTA Update</title>";
  p += "<style>body{font-family:Arial;background:#07111f;color:#e9f1ff;padding:20px}.card{background:#101b2f;border:1px solid #20314f;border-radius:18px;padding:18px;max-width:620px}button,input{font-size:16px;padding:10px;border-radius:10px}</style></head><body>";
  p += "<div class='card'><h2>BMP280 Logger OTA Update</h2><p>Nur passende <b>.bin</b> Firmware hochladen. DeepSleep vorher vermeiden.</p>";
  p += "<form method='POST' action='/update' enctype='multipart/form-data'><input type='file' name='update' accept='.bin'><br><br><button>Firmware hochladen</button></form>";
  p += "<p><a href='/' style='color:#69d2ff'>Zurueck</a></p></div></body></html>";
  webServer.send(200, "text/html", p);
}

void handleUpdateUpload() {
  if (!webServer.authenticate(cfg.webUser, cfg.webPass)) return;
  HTTPUpload &upload = webServer.upload();
  if (upload.status == UPLOAD_FILE_START) {
    webLastUpdateError = "";
    loggerConsole.printf("OTA Start: %s\n", upload.filename.c_str());
    if (!Update.begin(UPDATE_SIZE_UNKNOWN)) { webLastUpdateError = "Update.begin fehlgeschlagen"; Update.printError(loggerConsole); }
  } else if (upload.status == UPLOAD_FILE_WRITE) {
    if (Update.write(upload.buf, upload.currentSize) != upload.currentSize) { webLastUpdateError = "Update.write fehlgeschlagen"; Update.printError(loggerConsole); }
  } else if (upload.status == UPLOAD_FILE_END) {
    if (Update.end(true)) loggerConsole.printf("OTA fertig: %u Bytes\n", upload.totalSize);
    else { webLastUpdateError = "Update.end fehlgeschlagen"; Update.printError(loggerConsole); }
  }
}

void handleUpdateDone() {
  if (!webAuth()) return;
  bool ok = !Update.hasError() && webLastUpdateError.length() == 0;
  webServer.sendHeader("Connection", "close");
  webServer.send(200, "text/html", ok ? "<h2>Update OK - Neustart...</h2>" : ("<h2>Update Fehler</h2><pre>" + htmlEscape(webLastUpdateError) + "</pre>"));
  if (ok) { delay(700); ESP.restart(); }
}

void handleRootPage() {
  if (!webAuth()) return;
  static const uint8_t pageGzip[] PROGMEM = {
    0x1f,0x8b,0x08,0x00,0x00,0x00,0x00,0x00,0x02,0x03,0xb5,0x5a,0x59,0x73,0xdb,0x38,0x12,0x7e,0xcf,0xaf,0xc0,0xc8,0x95,0x25,
    0x19,0x93,0x14,0x29,0x5f,0x32,0x75,0x64,0x13,0xc7,0x39,0xaa,0x92,0xd8,0x3b,0x76,0x26,0xcf,0x10,0x09,0x4a,0x1c,0xf3,0x5a,
    0x10,0xb4,0xac,0x51,0xf4,0x9f,0xf6,0x6d,0xdf,0xe7,0x97,0x6d,0x37,0x40,0xea,0x96,0xac,0xec,0xee,0x94,0xab,0x68,0x12,0x40,
    0x37,0x3e,0xf4,0x0d,0x40,0x2f,0xba,0xbf,0x04,0x99,0x2f,0x26,0x39,0x23,0x23,0x91,0xc4,0xfd,0x6e,0xf5,0x64,0x34,0xe8,0x77,
    0x13,0x26,0x28,0x49,0x69,0xc2,0x7a,0x8d,0xc7,0x88,0x8d,0xf3,0x8c,0x8b,0x06,0xf1,0xb3,0x54,0xb0,0x54,0xf4,0x1a,0xe3,0x28,
    0x10,0xa3,0x5e,0xc0,0x1e,0x23,0x9f,0x59,0xf2,0xc3,0x24,0x51,0x1a,0x89,0x88,0xc6,0x56,0xe1,0xd3,0x98,0xf5,0xdc,0x46,0xbf,
    0x2b,0x22,0x11,0xb3,0xfe,0xdb,0x2f,0xb7,0xad,0xb6,0x43,0x3e,0x67,0xc3,0x21,0xe3,0xdd,0xa6,0x6a,0xec,0x16,0x62,0x02,0xff,
    0x5e,0x78,0x3c,0xcb,0xc4,0xd4,0xb2,0x06,0x43,0xef,0xc8,0xb9,0x70,0x5d,0x37,0xec,0x58,0x56,0x4e,0x53,0x16,0x7b,0x47,0xae,
    0xe3,0x0e,0x5a,0xf3,0xef,0x16,0x34,0x9c,0xb7,0x2e,0x4e,0x4f,0xa1,0x41,0xb0,0x27,0xe1,0x1d,0x31,0x1a,0xb6,0x42,0xec,0x4f,
    0x4a,0xc1,0x02,0xef,0xa8,0x1d,0xd0,0x96,0x8f,0xdd,0xd4,0xf7,0x01,0xa5,0x77,0x74,0x7e,0x19,0xa8,0x01,0xc3,0x2c,0x83,0xfe,
    0x53,0x1a,0xb0,0xb6,0x03,0x9f,0x03,0x0a,0x5f,0x61,0x78,0xe6,0x5f,0x50,0xf8,0x1a,0x53,0x9e,0xe2,0x67,0xe0,0x9e,0x9f,0xc3,
    0x67,0x1c,0xa5,0xcc,0x3b,0x6a,0x9d,0x9f,0xd0,0x33,0x36,0x7b,0x35,0x1d,0x64,0x4f,0x56,0x11,0xfd,0x11,0xa5,0x43,0x6f,0x90,
    0xf1,0x80,0x71,0x0b,0x5a,0x66,0x83,0x2c,0x98,0x4c,0x13,0xca,0x87,0x51,0xea,0x39,0x9d,0x10,0xc4,0x62,0x85,0x34,0x89,0xe2,
    0x89,0x77,0xc7,0x86,0x19,0x23,0xdf,0x3e,0x99,0x6f,0x38,0x08,0xc3,0x2c,0x68,0x5a,0x58,0x05,0xe3,0x51,0xd8,0x19,0x50,0xff,
    0x61,0xc8,0xb3,0x32,0x0d,0x3c,0x4e,0x03,0x94,0xd4,0x10,0xff,0x03,0x52,0xdd,0x8f,0xb8,0x1f,0x33,0x42,0x05,0x71,0x9d,0x97,
    0xc4,0x79,0x69,0x1e,0xb9,0xa7,0x27,0xa7,0x67,0x3e,0x71,0xcc,0x4a,0x2a,0xe4,0xa4,0x05,0xad,0xce,0xa9,0x73,0xe9,0x9e,0xc0,
    0x20,0xe7,0xa5,0xd1,0xf1,0xb3,0x38,0xe3,0xde,0x23,0xe5,0xba,0x12,0x88,0x31,0x43,0xcd,0x31,0x3e,0x0d,0xa2,0x22,0x8f,0xe9,
    0xc4,0x0b,0x63,0xf6,0xd4,0x19,0xd2,0xdc,0x73,0x5b,0xf9,0x53,0xe7,0xf7,0xb2,0x10,0x51,0x38,0xb1,0x2a,0x1d,0x7a,0x45,0x4e,
    0x41,0x77,0x03,0x26,0xc6,0x8c,0xa5,0x1d,0x1a,0x47,0xc3,0xd4,0x8a,0x04,0x4b,0x0a,0x0f,0x85,0xc7,0x78,0x27,0xa7,0x41,0x80,
    0xcb,0x76,0x4f,0xf3,0x27,0xe2,0xb6,0x81,0xc5,0x5c,0x00,0x42,0x64,0x89,0xe7,0x42,0x73,0x91,0xc5,0x51,0x40,0x14,0x06,0x14,
    0x9c,0xb1,0xb2,0xca,0xe1,0x80,0xea,0x67,0xe6,0xa5,0xd9,0x72,0x4c,0xfb,0xa2,0x65,0x74,0xf2,0xac,0x00,0x13,0xc9,0x52,0x0f,
    0x90,0xf8,0x0f,0x93,0x8e,0xc8,0x72,0x90,0x1e,0x52,0x04,0x3c,0xcb,0xad,0x30,0x8a,0x61,0x5e,0x6f,0x10,0x97,0x5c,0x87,0xe9,
    0x60,0x3d,0xee,0x54,0x8a,0x16,0xe4,0xcf,0xbc,0x96,0x03,0x08,0x6a,0x91,0xcf,0xec,0x3c,0x8a,0xe3,0x69,0x0d,0xf1,0x02,0x11,
    0x3a,0x0b,0x84,0x28,0xd7,0xb2,0xf0,0x2e,0x2f,0x2f,0xb1,0x6d,0x81,0x48,0x01,0x55,0xe6,0xb4,0x2a,0x40,0x69,0x42,0x86,0xd2,
    0xe4,0x98,0x45,0xc3,0x91,0xf0,0x2e,0x9c,0x4a,0xb3,0x72,0x7a,0x94,0xe1,0xcc,0x46,0x5b,0x99,0x2e,0x31,0x3c,0x3a,0xb9,0x68,
    0x5d,0xba,0xed,0x15,0x56,0x38,0xc6,0xa8,0x90,0x2c,0x09,0xe9,0xe8,0x3c,0x38,0x1d,0xb8,0x17,0xb3,0x84,0x46,0xe9,0x1c,0xb8,
    0x7b,0x2e,0x17,0xf5,0xa4,0x7c,0xc8,0x73,0xdd,0xf6,0xd2,0x2a,0x69,0x29,0xb2,0x99,0x3d,0xe4,0x51,0x30,0x57,0x29,0x7e,0x74,
    0xf0,0x01,0x1a,0x4f,0xa0,0x45,0x30,0xd0,0x67,0x5c,0x26,0x69,0xe1,0x71,0x96,0x33,0x2a,0xf4,0x53,0x33,0x89,0x52,0xe0,0xa8,
    0xbb,0x27,0xc0,0xca,0x74,0x43,0x6e,0x18,0xca,0x08,0x4e,0x71,0x01,0x3e,0xe5,0xc1,0xf2,0x02,0x50,0x69,0x94,0x2f,0x2c,0x11,
    0x00,0x04,0x6c,0x68,0x4a,0xd5,0x81,0xda,0x4e,0xce,0xcc,0x73,0x50,0xde,0xe5,0x99,0xa1,0x9a,0x5c,0xc7,0x74,0xdb,0xe6,0x49,
    0x4b,0x36,0x6d,0x59,0xe4,0x8a,0x25,0xac,0xe8,0x42,0x1a,0xd0,0xb2,0x49,0x75,0xa4,0x67,0x8d,0x68,0x90,0x8d,0x3d,0x47,0x6a,
    0x8f,0x20,0x62,0x22,0xe7,0x71,0x4c,0xfc,0xb3,0x5b,0x67,0xc6,0xcc,0x8e,0xe9,0x80,0xc5,0xd3,0x55,0x4d,0x1c,0xa2,0x3b,0xf4,
    0x09,0x4b,0x70,0x70,0xc0,0x30,0xe3,0x89,0x57,0xe6,0x39,0xe3,0x3e,0x2d,0x58,0x27,0x66,0x02,0xec,0xcc,0x42,0x07,0x40,0x30,
    0xb6,0xd3,0x66,0xc9,0xcc,0x7e,0xa4,0x71,0xc9,0x96,0xa6,0x39,0xc1,0x69,0x96,0x79,0xb6,0x81,0xa7,0xd2,0x8c,0x85,0x86,0x2b,
    0xc5,0x59,0x24,0x34,0x5e,0xc1,0x76,0xb2,0x15,0xdb,0xcc,0xe6,0xd9,0x78,0xd5,0x2f,0xf1,0x61,0x8d,0x39,0x28,0x06,0x1f,0x4a,
    0x43,0x0b,0xdd,0xcb,0x19,0xf0,0x7b,0x36,0x28,0xc1,0xd9,0x52,0x33,0x4a,0xf3,0x52,0x4c,0x2b,0x79,0x3b,0xeb,0xb2,0x6d,0x2d,
    0xcb,0x16,0x85,0x28,0x5b,0x0e,0x32,0x7c,0x19,0x39,0xd6,0x65,0x57,0xcd,0x3a,0xf5,0x4b,0x5e,0xc0,0xc8,0x3c,0x8b,0x30,0x22,
    0x54,0xad,0x36,0x46,0xd3,0xe9,0x06,0x73,0x6c,0xad,0x59,0x1f,0x39,0x27,0x60,0x7e,0xb4,0x26,0x80,0x78,0xbb,0x39,0x1e,0x1a,
    0xeb,0xe1,0xe3,0x11,0x04,0x9e,0x7a,0xb0,0x0a,0xde,0x9b,0xe3,0x55,0xfb,0x62,0x86,0x73,0x0c,0x8b,0xb3,0x15,0xb9,0x6c,0xb7,
    0xc3,0xe5,0xb5,0x9d,0xc1,0xda,0x6c,0x31,0xce,0x0e,0x71,0x28,0xd7,0x3e,0x0b,0x39,0x01,0x07,0x9a,0xbb,0xcf,0x8a,0x72,0x50,
    0xff,0x3e,0x4d,0x1f,0x69,0x31,0xad,0x9c,0x17,0xa2,0x72,0x67,0xa4,0xe6,0x69,0x9d,0x3b,0xab,0x0a,0xc0,0x30,0xee,0xb8,0xc1,
    0x36,0xc5,0xed,0x03,0x3f,0xfb,0x7b,0xc2,0x20,0x55,0xe8,0x8b,0x10,0xd1,0x3e,0x03,0xce,0xc6,0x54,0x86,0x05,0x53,0x2e,0x65,
    0x07,0xfa,0x90,0xd7,0xf9,0x60,0x39,0xb6,0x4b,0xb3,0x2b,0x04,0xe5,0x42,0x59,0x60,0x10,0x71,0xe6,0xcb,0x98,0xac,0x08,0x37,
    0xfd,0xa0,0x05,0x8e,0x3b,0x9b,0xd1,0xe9,0xb2,0xd1,0x54,0xba,0x98,0x75,0x9b,0x2a,0x8d,0x77,0x9b,0xaa,0x68,0xc0,0xb4,0xd8,
    0x7f,0xd1,0x55,0xf3,0xf6,0xbb,0x41,0xf4,0x08,0xe5,0x84,0xbb,0x5a,0x01,0x90,0xef,0x6c,0xf0,0xe1,0xdb,0x27,0x20,0x71,0xe5,
    0x08,0xe2,0xc7,0xb4,0x28,0x7a,0x0d,0xe9,0x4a,0x0d,0x12,0x05,0xf0,0x5a,0x0e,0x1a,0xfd,0x18,0x78,0xd8,0xb6,0xdd,0x6d,0x4a,
    0x2e,0xea,0xb9,0x34,0x1c,0x1c,0x0a,0x2a,0x0c,0xf0,0xe1,0xb4,0x6e,0xc1,0x8c,0xa0,0xe8,0xe3,0x6c,0xd8,0xe8,0x7f,0xbe,0xf9,
    0x40,0x5e,0x03,0x40,0x18,0xb1,0x6b,0x5c,0x92,0x05,0xac,0xd1,0xff,0x72,0xf3,0xee,0xfa,0xb9,0x91,0x51,0xde,0xe8,0x7f,0xba,
    0x5d,0x8c,0xaa,0x40,0xd5,0x0b,0xc5,0x98,0x0e,0xeb,0x46,0x78,0x38,0x3a,0x07,0x6a,0xcc,0x02,0x8d,0x9a,0x11,0x46,0x5d,0xa2,
    0x5a,0xa4,0xc0,0x7a,0x8d,0xda,0xfe,0xd2,0x2c,0x65,0xb5,0x59,0xd5,0x79,0x15,0x2c,0xab,0xd1,0xbf,0x13,0x34,0x0d,0x80,0xcc,
    0xba,0x45,0x66,0x50,0x7d,0x91,0xa8,0x10,0x84,0x3e,0x88,0xe8,0xd1,0x23,0xdd,0x41,0x9f,0x06,0x10,0xe7,0x9b,0xf2,0xd9,0x6d,
    0x0e,0xfa,0x36,0x79,0x1b,0x41,0x54,0x23,0x25,0x26,0x77,0xf9,0xe4,0xe4,0x2e,0xf2,0x47,0x8c,0x83,0x45,0x02,0x1d,0x4b,0x01,
    0x68,0x5a,0x49,0xf3,0x45,0xb7,0x50,0x4a,0xaf,0xf1,0xa1,0x09,0x35,0x56,0xc4,0x8b,0x88,0x57,0x5b,0x64,0x18,0x6e,0xf4,0xef,
    0xc1,0xd0,0x18,0xa7,0xa2,0xe4,0x9b,0x3a,0x91,0xa6,0xa3,0x04,0x86,0xf6,0xd8,0xe8,0x5b,0x96,0x6d,0xfd,0xf9,0xaf,0xab,0xcd,
    0x91,0x4b,0xca,0xe6,0x74,0x2c,0x1a,0x7d,0x78,0x12,0xcb,0xda,0xa5,0xec,0x9d,0x68,0x3e,0x97,0xa1,0x08,0x78,0xe9,0x3f,0xec,
    0x05,0x93,0x73,0x56,0x14,0x88,0xc6,0xb2,0x46,0xb7,0xf4,0x39,0x34,0xf9,0x7f,0x8d,0xe6,0x2e,0x67,0x52,0xe4,0x7b,0xc1,0x24,
    0x2c,0x41,0x28,0x2f,0xf7,0xc2,0x00,0x0b,0x96,0x80,0xd1,0x67,0x8a,0x9f,0xc7,0x31,0x29,0x40,0xfe,0x7b,0x51,0x14,0x72,0x88,
    0x94,0xc9,0x5e,0x20,0xec,0x11,0x1c,0x7d,0x79,0x58,0xf5,0xac,0x0c,0x68,0xd3,0x94,0x20,0x22,0x1d,0x68,0x49,0x9f,0xa3,0x47,
    0x46,0x3e,0x40,0xf2,0x1b,0x55,0x4c,0x55,0x34,0x95,0xd3,0xfa,0x23,0x8a,0xfb,0x0d,0xb5,0xcd,0x68,0x5c,0x3a,0x4e,0x83,0xa8,
    0xc8,0xda,0x6b,0x9c,0xc0,0x07,0x00,0x50,0x83,0xb7,0xc0,0x5e,0xb2,0x50,0xf0,0x83,0x80,0xbc,0x43,0xf3,0xb0,0x7e,0x63,0x3c,
    0xa6,0x65,0x48,0x68,0x59,0x90,0x9b,0xcf,0xd7,0xef,0xac,0x8f,0xe0,0x4e,0x19,0x9f,0xfc,0xbc,0xc5,0xa9,0x20,0x76,0x27,0x58,
    0xc9,0x78,0x99,0x0e,0x77,0x45,0x26,0x95,0xcd,0xe6,0x0e,0x06,0xc9,0xb1,0x41,0xb2,0xd4,0x8f,0xa1,0xf0,0x05,0xee,0x49,0xa0,
    0x6b,0x32,0x0a,0x6b,0x86,0x74,0x75,0x2e,0xc0,0x89,0x25,0xc5,0x3a,0x25,0xa4,0xc9,0x4d,0xc2,0x2c,0x57,0x74,0x59,0xbe,0x8b,
    0x4c,0x45,0xe8,0x75,0x4a,0xf8,0x62,0x48,0xe9,0x3e,0xa9,0x60,0x9c,0x6e,0x90,0x6f,0xcc,0xc4,0xe9,0x50,0x92,0x2c,0x6c,0xfb,
    0x20,0x9c,0x31,0x54,0x95,0x30,0x85,0x6e,0xa0,0xc4,0x60,0x43,0x88,0xf3,0x91,0x38,0x63,0x05,0xf0,0x58,0x9a,0x55,0x09,0x6f,
    0xc4,0xeb,0xb0,0x58,0xa5,0xc7,0x2a,0xc7,0xab,0x4d,0x58,0x63,0xb7,0x74,0xd7,0xd0,0x32,0x41,0x30,0xa4,0x93,0x82,0xa5,0x50,
    0xb6,0x48,0xd4,0xf2,0xed,0xb9,0x55,0xd6,0x74,0x43,0x48,0xa0,0x63,0x3a,0x41,0xc2,0x0f,0xea,0xf5,0x50,0xca,0xd1,0x64,0x00,
    0x21,0x14,0x09,0x3f,0xca,0xb7,0xf5,0x15,0x1e,0xbe,0x80,0x3c,0x1b,0x83,0x79,0xa5,0x50,0xb1,0xd2,0x18,0xf9,0x7d,0x95,0x6f,
    0x07,0xe0,0x50,0x84,0xcc,0xcf,0x90,0xea,0xda,0xcf,0x0e,0x26,0x09,0x18,0x93,0xe6,0xf4,0x0e,0xfe,0xdf,0xc5,0xf0,0x78,0x86,
    0x72,0x4c,0x1f,0xa4,0x45,0xbc,0x53,0x29,0x8c,0x7c,0x87,0xef,0xff,0x45,0xa3,0x95,0x63,0x5d,0x47,0x29,0x84,0xa4,0x38,0x06,
    0x9f,0x42,0x0b,0xd9,0x2e,0x36,0x59,0xee,0xa9,0x8c,0x8c,0x29,0x0e,0x02,0x5a,0x83,0x00,0x08,0x9f,0x8d,0xb2,0x18,0xa6,0xe9,
    0x35,0x3e,0x55,0xcd,0x31,0x18,0xc1,0xc3,0x3e,0x39,0xd7,0xf4,0x44,0x3b,0x86,0xa7,0xae,0xd5,0xdf,0x9a,0x21,0xcd,0x46,0xfc,
    0xb1,0x69,0xa6,0x7b,0xd0,0x80,0x85,0xcb,0x8c,0xb7,0x0a,0x86,0xf9,0x23,0x48,0xc9,0xf7,0x32,0x15,0x6e,0x47,0x82,0x9e,0x81,
    0x84,0x35,0x8a,0x8a,0x8f,0x04,0x81,0x74,0xe4,0x6a,0x59,0xf7,0x87,0xc0,0x50,0xb9,0x6e,0x0b,0x0e,0xae,0x22,0xe1,0x3e,0x24,
    0x92,0x76,0x09,0x8a,0xfc,0x96,0x58,0x6e,0x65,0xcf,0x16,0x30,0xff,0xbf,0x74,0xb0,0xa8,0x56,0x2a,0xa6,0xf9,0x5a,0x5c,0x87,
    0xba,0x11,0xa3,0x48,0x94,0x92,0x26,0xb9,0xb9,0x7f,0x43,0xea,0xc2,0xc8,0x26,0x75,0xad,0xa4,0x4a,0xa4,0x45,0x61,0x04,0xe5,
    0x4e,0xbe,0x57,0x5e,0x65,0xc1,0xf8,0x9a,0xac,0xde,0xb2,0xb4,0x04,0xe5,0x43,0xb3,0xcc,0x96,0x10,0x49,0x91,0xd3,0x0a,0x15,
    0x96,0x77,0x6b,0x54,0x35,0x96,0x06,0xc1,0xe3,0xb4,0xaa,0x02,0xcc,0xe4,0x4a,0x9f,0x89,0xcb,0x20,0xaf,0x92,0x47,0x62,0xa2,
    0x2f,0xc5,0xd8,0x74,0xbb,0x94,0x0f,0x91,0xe2,0xf7,0xcf,0x6f,0xbe,0x2a,0xf9,0xec,0x90,0xe2,0xcd,0x28,0x65,0x04,0x47,0x59,
    0xef,0x28,0x96,0x8a,0x32,0x0b,0x81,0x3f,0xc0,0x32,0xea,0x02,0x9d,0xc1,0xce,0x23,0x85,0x60,0xfd,0x40,0x63,0xf8,0x0f,0xbe,
    0x50,0xe6,0xd6,0x1b,0xc0,0x5d,0x14,0xd6,0x2d,0xee,0x04,0x9f,0x15,0x6b,0x51,0x40,0x39,0xb9,0x2a,0x20,0x89,0xeb,0xee,0xee,
    0xd3,0xbb,0x95,0x81,0xe3,0x2d,0xa2,0x94,0x23,0xf7,0xc8,0x73,0x41,0x3d,0xca,0x0a,0xb1,0x46,0xfc,0x11,0x9a,0xf0,0xd0,0x92,
    0x0c,0x92,0x1c,0xb6,0x1c,0x56,0x2c,0x57,0xb4,0xc5,0xe6,0xc7,0x51,0x18,0xa1,0xc8,0xe5,0x6c,0xc5,0x2e,0xb9,0xc3,0x32,0x29,
    0x19,0x71,0x16,0xf6,0x1a,0xcd,0x20,0x1b,0xa7,0x71,0x46,0x83,0x66,0x8c,0xf9,0xac,0xd1,0xff,0xed,0xe2,0x94,0x5c,0xdd,0xfd,
    0x06,0x75,0x09,0x97,0xe5,0x36,0xee,0x57,0x80,0x01,0xed,0x93,0x1f,0x64,0x1b,0x15,0x1b,0x52,0x7f,0xd2,0xe8,0xbf,0x01,0x07,
    0x27,0xbf,0x5d,0x9c,0x20,0xed,0xc6,0xe8,0x32,0x0f,0x40,0x29,0x8d,0xfe,0xfb,0x88,0x27,0xb0,0x5d,0x60,0xe4,0x9b,0x6c,0xa8,
    0x15,0x4a,0xfb,0x52,0xf2,0x6b,0x3e,0xb7,0xee,0x72,0x3b,0x6d,0xe3,0x63,0x06,0x82,0x79,0x03,0xca,0x01,0x9d,0xa7,0x02,0x98,
    0x7e,0xf9,0xc7,0xfd,0xfd,0x0e,0x33,0xc1,0x2e,0xf2,0x96,0x67,0x0f,0x60,0x0f,0x51,0x42,0x3e,0x42,0xdd,0x94,0x42,0x50,0xb4,
    0x09,0x44,0x7d,0x3f,0x7b,0x64,0x7c,0x42,0x18,0x97,0xf1,0x1a,0x3c,0xae,0x84,0x6d,0x0b,0x15,0xd0,0x31,0x22,0x2a,0xe1,0x82,
    0xd9,0x80,0x9b,0xae,0xce,0xf7,0xac,0xd5,0x24,0x5b,0xf4,0xb9,0x0c,0xe3,0xd3,0xed,0xea,0x70,0x75,0x24,0xbd,0x32,0xdc,0x6d,
    0xb7,0x4f,0x56,0x07,0x6d,0xf1,0x70,0xc9,0xf3,0x5b,0x21,0xcd,0x62,0x99,0xdd,0xa6,0x29,0xca,0x91,0x07,0x99,0x62,0x02,0xa1,
    0x32,0x8c,0x9e,0xd6,0xe8,0x95,0x11,0x6e,0xb1,0xbe,0xe4,0x9f,0x42,0x14,0xf4,0x91,0xa1,0x05,0xca,0x49,0x76,0x5a,0xe0,0x4f,
    0x54,0x3e,0xc0,0x13,0x9a,0xb5,0x9a,0xe5,0x9b,0xaf,0x87,0x14,0x2f,0x92,0x28,0x0c,0x17,0x54,0xdf,0xee,0x9e,0x21,0x93,0x24,
    0x41,0x6d,0x05,0x55,0x21,0x50,0x99,0x44,0x81,0xdb,0xcc,0xf4,0x10,0x06,0x79,0x39,0x88,0xa3,0x62,0xa4,0xc9,0x3c,0x07,0x51,
    0xfb,0x56,0x7d,0x6f,0x04,0xbe,0xb9,0x91,0x37,0xe5,0x1e,0xbb,0x5b,0xf8,0x3c,0xca,0x45,0xff,0x45,0x0c,0xe0,0x41,0x2c,0xa2,
    0x37,0x9d,0x75,0xc2,0x32,0x55,0x0e,0x80,0x79,0x2b,0x0a,0x8c,0x29,0x87,0x90,0xc5,0x53,0x12,0x64,0x7e,0x99,0x40,0xb4,0xb5,
    0x87,0x4c,0x5c,0xc7,0x0c,0x5f,0xdf,0x4e,0x3e,0x05,0x38,0x44,0x9d,0x72,0xcc,0x68,0x31,0x49,0x7d,0x32,0xa7,0x47,0x78,0xbe,
    0x31,0xa5,0x63,0x0a,0x5b,0xe6,0x90,0x09,0x7f,0xa4,0x6b,0x4d,0x9a,0x47,0x4d,0xe8,0xd0,0xcc,0x69,0xc2,0xc4,0x28,0x0b,0x3c,
    0xed,0xf6,0xe6,0xee,0x5e,0x33,0xd5,0xde,0xbf,0xf0,0xa6,0xda,0x95,0x3a,0x51,0xb7,0xee,0xc1,0x3e,0x34,0x4f,0xa3,0x79,0x0e,
    0xab,0xa5,0xc8,0xb1,0xf9,0x64,0x8d,0xc7,0x63,0x0b,0xcf,0x1f,0xad,0x92,0x43,0x34,0xf5,0xa1,0x58,0x0c,0xb4,0x99,0x89,0x07,
    0x25,0x9e,0x06,0x6c,0x7b,0xda,0xb1,0x6a,0xfd,0xf6,0xeb,0xa7,0xab,0x0c,0x6c,0x3a,0x95,0xf7,0x01,0xc6,0xcc,0xe8,0x80,0x7e,
    0xee,0xa3,0x84,0x65,0xa5,0xd0,0x31,0x82,0x98,0xa7,0x8e,0x63,0x6c,0x20,0x9e,0xd7,0xd9,0xd3,0x28,0xd4,0xfd,0x2c,0x0d,0x21,
    0x72,0xe8,0xda,0xa2,0xe4,0x1e,0x47,0xfc,0x01,0xd0,0x8c,0xe6,0xb5,0xf7,0x6b,0xc8,0xe7,0x6a,0x81,0x2a,0xed,0x23,0x03,0x6d,
    0x83,0xef,0x22,0x2b,0x6d,0x91,0x46,0xdd,0xf9,0x57,0x88,0x04,0xfd,0x75,0xbb,0x4c,0x64,0x51,0x82,0xdd,0xb0,0x80,0x63,0xed,
    0x6f,0xe8,0x86,0x7b,0x06,0x62,0x37,0x0c,0x04,0x31,0x42,0x12,0xe3,0x42,0xd7,0x3e,0xb0,0xda,0xc7,0xa0,0x60,0x78,0xcb,0x20,
    0xa6,0xa5,0x14,0xea,0xa2,0x02,0x73,0xa0,0xaa,0x2a,0x52,0xd8,0xd1,0x11,0x95,0x14,0x65,0x09,0x90,0xda,0x9b,0x72,0x51,0x69,
    0x63,0x8b,0x4c,0xb0,0xe3,0xaf,0x90,0x07,0xa6,0xd2,0x3d,0xcb,0xc4,0xee,0x83,0xe4,0x31,0xae,0x04,0x02,0x23,0x31,0xcc,0xee,
    0x19,0x89,0xdd,0x2b,0x92,0x93,0x29,0x72,0xb8,0x2c,0xbe,0x0f,0xc3,0xd0,0x46,0x71,0x11,0x70,0xfa,0x41,0x84,0x2e,0xdf,0x84,
    0x2f,0x55,0x49,0x6c,0x93,0xda,0x22,0xdc,0x6d,0x91,0x1c,0x76,0xfe,0x15,0x92,0x63,0x29,0x1d,0xc4,0x2c,0xe8,0xb9,0xcf,0x2d,
    0x38,0xa9,0x56,0x8c,0x42,0x84,0x38,0xbf,0x6f,0x24,0xf6,0x6b,0xc6,0x8f,0x1f,0x1a,0x26,0x1a,0x0d,0x29,0x9e,0xb1,0xd7,0xe4,
    0x60,0x83,0x4d,0x16,0x0a,0x52,0xb9,0x64,0xef,0x58,0x39,0x42,0x22,0x51,0x39,0x46,0x62,0x99,0x07,0xe5,0x9e,0xab,0x2d,0xd4,
    0x27,0xc3,0xfa,0x8a,0xfa,0xbe,0xb3,0x34,0x95,0xf5,0x5e,0x95,0x58,0x19,0xe7,0xd8,0x37,0xa0,0x1c,0x0b,0x68,0x93,0x3c,0x50,
    0xe8,0x5f,0x04,0x75,0xa0,0xc5,0xb0,0x2e,0x08,0x6c,0x16,0x03,0xa5,0xdf,0xb9,0x66,0xf1,0x90,0x5a,0xf7,0xc5,0x93,0x49,0x39,
    0xc7,0x8b,0x27,0x33,0xa1,0x4f,0xa6,0xdc,0xeb,0x19,0x53,0x68,0xb6,0x0b,0x81,0x53,0xdc,0xc9,0xad,0xa0,0x6c,0xee,0x60,0x2b,
    0x52,0x7d,0x97,0x47,0x3b,0x2d,0xf9,0x3d,0x60,0xe0,0x7f,0xb7,0x54,0x8c,0x74,0x03,0x2f,0x67,0x48,0xf6,0xd0,0x0b,0x69,0x5c,
    0xb0,0x0e,0x70,0xb5,0x41,0xbf,0xd7,0x14,0xac,0x45,0x7f,0x34,0x23,0xa3,0xd7,0xc7,0x38,0xf7,0xd8,0xeb,0xa5,0x65,0x1c,0x1b,
    0xd3,0xf9,0x40,0x15,0xf1,0x3b,0x33,0xa4,0x7e,0xea,0xb9,0xad,0xe3,0xe8,0x95,0xde,0xbe,0x38,0x6f,0x7e,0x01,0xa6,0xb6,0xbc,
    0x0d,0x43,0x84,0x36,0x18,0xc9,0x50,0x8c,0x2c,0xd7,0x50,0xf3,0x4c,0x7a,0xad,0xf6,0xa9,0xa5,0x3f,0x5a,0x80,0xdc,0x78,0xa5,
    0xb7,0xce,0x9d,0x05,0x81,0xed,0xb8,0xb8,0x18,0xd9,0x65,0x74,0x60,0xd2,0x5f,0xb2,0x07,0xb5,0xa6,0x04,0xc4,0x72,0x9f,0xe9,
    0x4f,0xe6,0xc4,0xe8,0x00,0x00,0xc1,0x21,0x91,0x30,0x00,0x41,0xea,0xa5,0x55,0x9d,0xa0,0x82,0x85,0x08,0xf4,0x25,0xa1,0x05,
    0x9c,0x8e,0xf5,0x91,0x31,0x45,0x08,0x7e,0x6f,0x57,0x96,0xd2,0xe4,0x19,0x98,0x66,0x98,0xc0,0xa4,0xe7,0x63,0xaf,0x74,0x85,
    0x27,0x50,0x69,0x0b,0x7c,0x5e,0xf2,0x96,0xd1,0xfb,0x57,0x48,0x91,0xf2,0xc2,0xcc,0xb7,0xd5,0x4d,0xbc,0x6f,0xab,0xb3,0x32,
    0x35,0x26,0x8c,0xe2,0x58,0x29,0x40,0xab,0x2e,0x21,0xb4,0x79,0xfb,0x33,0xa4,0xcb,0xda,0xd3,0xaa,0xbd,0xbb,0xd6,0x01,0x85,
    0xe8,0x08,0x3d,0xea,0x39,0x9d,0xa8,0x7b,0xde,0x89,0x8e,0x8f,0xd5,0x5a,0x40,0x9c,0x0e,0x08,0xfe,0x6c,0x53,0xa9,0x4b,0x62,
    0x73,0x5b,0x28,0xb7,0x25,0x51,0xb5,0xdb,0xed,0xba,0x65,0x2e,0x2a,0xe4,0x26,0x7a,0x23,0x1b,0xf7,0xc2,0xb6,0xba,0x16,0x06,
    0xa5,0xf7,0x1f,0x7f,0x51,0x7a,0x37,0x73,0xe8,0x93,0x9b,0xd3,0x2d,0x9d,0x52,0xb3,0x02,0xd4,0xd6,0x53,0xba,0x8c,0x52,0xdd,
    0xb6,0x6d,0x61,0x62,0xb5,0x20,0x19,0xfe,0xf8,0xe1,0x18,0xa6,0x00,0xdd,0xf6,0x16,0xca,0x5e,0x1b,0xe0,0x2a,0x8d,0x47,0xc5,
    0x7b,0xfc,0x51,0x03,0xd3,0x85,0xb4,0x82,0xa9,0xe4,0xea,0x74,0x24,0xad,0x2b,0x41,0xe6,0xeb,0xf3,0xe4,0x8a,0x8d,0x04,0x27,
    0x27,0xca,0xd7,0x27,0x5a,0x1d,0xb1,0x3e,0x53,0xae,0x66,0xca,0xd5,0x4c,0x79,0x35,0x53,0xed,0x65,0x4a,0x22,0x26,0xe2,0xb0,
    0xec,0x96,0x5c,0xc4,0x31,0xfc,0xd7,0xaa,0x5f,0x3a,0x80,0x55,0x2c,0x0d,0x95,0x33,0x98,0xb9,0x1c,0x7b,0x26,0x71,0x1c,0xc3,
    0x7f,0xad,0xfa,0xa5,0x83,0xb6,0x69,0x1d,0xea,0xf7,0x13,0x95,0x75,0x80,0xad,0xf5,0x34,0x79,0xf5,0x5f,0xff,0xa2,0x61,0x61,
    0x36,0xf7,0xd2,0x0a,0xf1,0x7c,0x42,0xc3,0xeb,0x60,0xb7,0x6d,0xac,0x75,0xc9,0xe3,0x82,0x92,0x33,0xcd,0x6c,0xe3,0x85,0xf1,
    0x46,0x42,0xc0,0x7a,0x46,0x57,0x46,0x53,0xf4,0x64,0x4a,0xd0,0xb7,0x94,0x19,0x82,0x8a,0x12,0x43,0xa2,0xfd,0x7b,0x91,0xa5,
    0x18,0x1a,0xb0,0xde,0x2b,0x3a,0x3b,0x1d,0xa6,0x28,0x07,0x9a,0x61,0xa3,0x8b,0x54,0x49,0xa3,0x57,0xd8,0xb8,0x19,0x3c,0xd6,
    0xc8,0x9f,0xff,0x26,0xda,0x71,0x61,0x47,0xc1,0xe2,0x3d,0x1c,0xef,0xe6,0xa4,0xce,0x60,0x56,0x58,0xe9,0x85,0x94,0xbd,0x8a,
    0x3c,0xaf,0x35,0xcb,0xd2,0x3c,0xd5,0x62,0x8b,0xec,0x7d,0xf4,0xc4,0x02,0xdd,0xc5,0xe0,0xfd,0xe7,0xbf,0xae,0xb4,0xdd,0x7c,
    0xab,0x03,0x95,0x75,0xc6,0xb2,0x79,0x95,0xb3,0xb2,0xee,0x15,0xd6,0xa3,0x5b,0xba,0x87,0x35,0x5e,0xa3,0xac,0x71,0xc6,0x36,
    0x58,0x2a,0x4c,0x00,0x2f,0xf7,0x1b,0xe0,0xab,0xc6,0xf9,0x24,0x2d,0x9c,0x04,0x76,0x85,0xb0,0x1d,0x90,0x02,0xc2,0xc5,0xdd,
    0x84,0x21,0x94,0xa1,0x4b,0x43,0xf6,0x02,0xc8,0xf7,0x01,0xb8,0xdd,0x5c,0x64,0xdd,0xba,0x13,0x82,0x94,0xc2,0x4f,0x60,0x80,
    0xed,0xfe,0x86,0x05,0xe0,0x11,0x40,0x94,0x0e,0x5f,0x6b,0xbf,0x5e,0x5f,0x91,0xcf,0x37,0x1f,0xa0,0x88,0xb8,0xbb,0xbf,0xb9,
    0xdd,0x23,0x4a,0x3c,0xd1,0xdd,0x60,0x83,0x8d,0x80,0x4d,0xa2,0xc2,0x63,0xd3,0xdd,0xe4,0x51,0xbe,0x41,0x1c,0xe5,0x32,0x2a,
    0x25,0xf0,0x1a,0x16,0xf7,0x99,0xa0,0xf1,0x6b,0x19,0x12,0xe4,0xdd,0xb0,0x8e,0x8d,0xb0,0x1f,0x0d,0x9a,0xf3,0xde,0x57,0x2e,
    0xd4,0xfa,0x9e,0xb3,0x07,0x22,0x4b,0xd6,0x26,0x49,0x8e,0xb5,0x97,0xda,0x5e,0xc9,0x14,0xdb,0x44,0x73,0x05,0x08,0xc4,0xb1,
    0xd6,0xc4,0x75,0x41,0x84,0xb8,0xa3,0x49,0x1e,0xb3,0x02,0x16,0x8a,0x17,0x4f,0x73,0xb7,0xa9,0xce,0x46,0x8f,0xb5,0x62,0xcf,
    0x14,0xea,0x4a,0x69,0x63,0x92,0x31,0x1b,0xbc,0xd6,0xbe,0x5f,0xbf,0x25,0x37,0x5f,0x41,0xf4,0xf2,0xe5,0xfd,0xfb,0x3d,0x6c,
    0xe4,0x8d,0xd3,0x06,0x17,0xd9,0xba,0xc7,0xb1,0xaa,0x1b,0x57,0xa0,0x93,0xe7,0xce,0x76,0x75,0xbf,0x0a,0x94,0x01,0x0b,0x69,
    0x19,0x0b,0xdc,0xc6,0xbf,0xd6,0x06,0x71,0xe6,0x3f,0x00,0x0c,0xbc,0x76,0xd5,0xa4,0x4e,0x46,0x3b,0xe3,0xcf,0x48,0xdd,0x10,
    0x2d,0x05,0xa0,0x2a,0x71,0xcf,0x54,0xf8,0xc2,0x0d,0x5a,0x7d,0xdc,0xac,0x76,0x68,0xad,0x33,0x50,0x5b,0xe7,0x05,0xec,0x5a,
    0xd5,0x2e,0x15,0x76,0xb3,0x78,0x21,0xde,0x6d,0xca,0x1f,0xd6,0xbd,0xf8,0x0f,0x50,0x2b,0x86,0x3f,0x70,0x27,0x00,0x00,
  };
  webServer.sendHeader("Content-Encoding", "gzip");
  webServer.send_P(200, "text/html; charset=utf-8", (const char*)pageGzip, sizeof(pageGzip));
}

void setupWebRoutes() {
  if (webRoutesConfigured) return;
  webServer.on("/", HTTP_GET, handleRootPage);
  webServer.on("/api/status", HTTP_GET, handleApiStatus);
  webServer.on("/api/history", HTTP_GET, handleApiHistory);
  webServer.on("/api/cmd", HTTP_POST, handleApiCmd);
  webServer.on("/api/security", HTTP_POST, handleApiSecurity);
  webServer.on("/api/wifi", HTTP_POST, handleApiWifi);
  webServer.on("/api/mqtt", HTTP_POST, handleApiMqtt);
  webServer.on("/download/local", HTTP_GET, handleDownloadLocal);
  webServer.on("/download/legacy", HTTP_GET, handleDownloadLegacy);
  webServer.on("/download/node", HTTP_GET, handleDownloadNode);
  webServer.on("/update", HTTP_GET, handleUpdatePage);
  webServer.on("/update", HTTP_POST, handleUpdateDone, handleUpdateUpload);
  webServer.onNotFound([](){ if (!webAuth()) return; webServer.send(404, "text/plain", "404"); });
  webRoutesConfigured = true;
}

