slawa01de-prog/ESP32-BMP280-Datenlogger/Esp32_LCD_Datalogger/Esp32_LCD_Datalogger.ino
void setupWebIfAllowed() {
  if (cfg.powerMode == POWER_DEEP || (!cfg.webEnabled && !cfg.mqttEnabled)) { stopWebServer(); return; }
  if(cfg.webEnabled) setupWebRoutes();
  WiFi.mode(cfg.webEnabled ? WIFI_AP_STA : WIFI_STA);
  bool staOk = false;
  if (strlen(cfg.wifiSsid) > 0) {
    if (WiFi.status() != WL_CONNECTED) {
      if(strlen(cfg.webHost)>0) WiFi.setHostname(cfg.webHost);
      WiFi.begin(cfg.wifiSsid, cfg.wifiPass);
      unsigned long start = millis();
      while (WiFi.status() != WL_CONNECTED && millis() - start < 3500) delay(100);
    }
    staOk = (WiFi.status() == WL_CONNECTED);
  }
  if (!staOk && cfg.webEnabled) {
    String apName = String("BMP280-Logger-") + String(cfg.nodeId);
    WiFi.softAP(apName.c_str(), "adminadmin");
  }
  if(staOk) { configTime(0,0,"pool.ntp.org","time.nist.gov"); uint8_t ch=WiFi.channel(); if(prefs.getUChar("radioch",1)!=ch) prefs.putUChar("radioch",ch); }
  if(!cfg.webEnabled) { stopWebServer(); return; }
  if (!webRunning) {
    webServer.begin();
    webRunning = true;

    printWebStatus();
  }
}

void stopWebServer() {
  if (webRunning) {
    // WebServer has no portable hard-stop on every ESP32 core.
    // We stop servicing clients by setting webRunning=false.

    webRunning = false;
    loggerConsole.println("WEB,stopped");
  }
  if (!cfg.webEnabled || cfg.powerMode == POWER_DEEP) WiFi.softAPdisconnect(true);
}

void handleWeb() { if (webRunning) webServer.handleClient(); }

void printWebStatus() {
  loggerConsole.print("WEB,");
  loggerConsole.print(webRunning ? "on" : "off"); loggerConsole.print(",");
  loggerConsole.print(webIpInfo()); loggerConsole.print(",host,");
  loggerConsole.print(cfg.webHost); loggerConsole.print(",user,");
  loggerConsole.println(cfg.webUser);
}

// --------------------------------------------------
// Serial / Terminal
// --------------------------------------------------
void printHelp() {
  loggerConsole.println();
  loggerConsole.println("========== BMP280 LOGGER V7.4.3 WEBGUI OTA MQTT ==========");
  loggerConsole.println("Allgemein:");
  loggerConsole.println("  help, status, storage, reboot");
  loggerConsole.println("  scan");
  loggerConsole.println();
  loggerConsole.println("Modus:");
  loggerConsole.println("  set mode sensor");
  loggerConsole.println("  set mode gateway");
  loggerConsole.println("  set mode hybrid");
  loggerConsole.println();
  loggerConsole.println("Logging:");
  loggerConsole.println("  start, stop, once");
  loggerConsole.println("  dump local");
  loggerConsole.println("  dump <NODEID>");
  loggerConsole.println("  clear");
  loggerConsole.println("  resetstats");
  loggerConsole.println();
  loggerConsole.println("Einstellungen:");
  loggerConsole.println("  set interval 60");
  loggerConsole.println("  set maxdays 7");
  loggerConsole.println("  cal temp 23.8");
  loggerConsole.println("  cal press 1006.9");
  loggerConsole.println("  set temp_offset -5.4");
  loggerConsole.println("  set press_offset 0");
  loggerConsole.println("  set name Wohnzimmer");
  loggerConsole.println("  set lang de");
  loggerConsole.println("  set lang en");
  loggerConsole.println();
  loggerConsole.println("Power:");
  loggerConsole.println("  set power normal");
  loggerConsole.println("  set power eco");
  loggerConsole.println("  set power deep");
  loggerConsole.println("  set display_timeout 20");
  loggerConsole.println("  set wake_display 20");
  loggerConsole.println("  set usb_auto_normal on/off");
  loggerConsole.println("  set usb_window 2");
  loggerConsole.println("  set live on/off");
  loggerConsole.println("  wake");
  loggerConsole.println();
  loggerConsole.println("WebGUI / OTA:");
  loggerConsole.println("  web status");
  loggerConsole.println("  set web on/off");
  loggerConsole.println("  set webuser admin");
  loggerConsole.println("  set webpass admin");
  loggerConsole.println("  web resetpass");
  loggerConsole.println("  set wifi_ssid MeinWLAN");
  loggerConsole.println("  set wifi_pass Passwort");
  loggerConsole.println("  set webhost bmp280-logger");
  loggerConsole.println("  mqtt status");
  loggerConsole.println("  mqtt discovery");
  loggerConsole.println("  mqtt publish");
  loggerConsole.println("  set mqtt on/off");
  loggerConsole.println("  set mqtt_host 192.168.188.x");
  loggerConsole.println("  set mqtt_port 1883");
  loggerConsole.println("  set mqtt_user homeassistant");
  loggerConsole.println("  set mqtt_pass Passwort");
  loggerConsole.println("  set mqtt_prefix bmp280");
  loggerConsole.println("  set mqtt_discovery on/off");
  loggerConsole.println();
  loggerConsole.println("Display:");
  loggerConsole.println("  set screen auto/main/gauge/graph/pressure/log/cal/net/power");
  loggerConsole.println("  set graph temp/press; set graph_hours 1/6/12/24");
  loggerConsole.println("  set contrast 180");
  loggerConsole.println();
  loggerConsole.println("Pairing / Gateway:");
  loggerConsole.println("  pair on/off");
  loggerConsole.println("  pair code");
  loggerConsole.println("  pair reset");
  loggerConsole.println("  pair add <ID> <CODE>");
  loggerConsole.println("  pending");
  loggerConsole.println("  trust list");
  loggerConsole.println("  trust remove <ID>");
  loggerConsole.println("  rename <ID> <NAME>");
  loggerConsole.println("===========================================");
  loggerConsole.println();
}


void printStatusData() {
  uint16_t trustedCount = 0;
  for (int i = 0; i < MAX_TRUSTED; i++) {
    if (trusted[i].used) trustedCount++;
  }

  String safeName = String(cfg.nodeName);
  safeName.replace(",", "_");

  loggerConsole.print("STATUSDATA,");
  loggerConsole.print(cfg.nodeId); loggerConsole.print(",");
  loggerConsole.print(safeName); loggerConsole.print(",");
  loggerConsole.print(FW_VERSION); loggerConsole.print(",");
  loggerConsole.print(cfg.mode); loggerConsole.print(",");
  loggerConsole.print(cfg.powerMode); loggerConsole.print(",");
  loggerConsole.print(cfg.loggingEnabled ? 1 : 0); loggerConsole.print(",");
  loggerConsole.print(cfg.intervalSec); loggerConsole.print(",");
  loggerConsole.print(cfg.maxDays, 2); loggerConsole.print(",");
  loggerConsole.print(logCount); loggerConsole.print(",");
  loggerConsole.print(getMaxSamples()); loggerConsole.print(",");
  loggerConsole.print(LittleFS.usedBytes() / 1024.0f, 1); loggerConsole.print(",");
  loggerConsole.print(LittleFS.totalBytes() / 1024.0f, 1); loggerConsole.print(",");
  loggerConsole.print(getFileSize(LOCAL_LOG_FILE) / 1024.0f, 1); loggerConsole.print(",");
  loggerConsole.print(cfg.paired ? 1 : 0); loggerConsole.print(",");
  loggerConsole.print(cfg.pairMode ? 1 : 0); loggerConsole.print(",");
  loggerConsole.print(trustedCount); loggerConsole.print(",");
  loggerConsole.print(languageCode()); loggerConsole.print(",");
  loggerConsole.print(webRunning ? 1 : 0); loggerConsole.print(",");
  loggerConsole.print(webIpInfo()); loggerConsole.print(",");
  loggerConsole.println(cfg.webHost);
}

