slawa01de-prog/ESP32-BMP280-Datenlogger/Esp32_LCD_Datalogger/Esp32_LCD_Datalogger.ino
void printStatus() {
  loggerConsole.println();
  loggerConsole.println("========== STATUS ==========");
  loggerConsole.print("ID: "); loggerConsole.println(cfg.nodeId);
  loggerConsole.print("Name: "); loggerConsole.println(cfg.nodeName);
  loggerConsole.print("FW: "); loggerConsole.println(FW_VERSION);
  loggerConsole.print("Language: "); loggerConsole.println(languageLabel());
  loggerConsole.print("MAC: "); loggerConsole.println(WiFi.macAddress());
  loggerConsole.print("Mode: "); loggerConsole.println(modeName());
  loggerConsole.print("Power: "); loggerConsole.println(powerName());
  loggerConsole.print("WakeCause: "); loggerConsole.println(wakeCauseName());
  loggerConsole.print("Paired: "); loggerConsole.println(cfg.paired ? "JA" : "NEIN");
  loggerConsole.print("PairMode: "); loggerConsole.println(cfg.pairMode ? "AN" : "AUS");
  loggerConsole.print("Gateway: "); loggerConsole.println(macToString(cfg.gatewayMac));
  loggerConsole.print("Logging: "); loggerConsole.println(cfg.loggingEnabled ? "AN" : "AUS");
  loggerConsole.print("USB verworfene Ausgabezeilen: "); loggerConsole.println(loggerConsole.droppedLines());
  loggerConsole.print("Live USB: "); loggerConsole.println(cfg.liveOutput ? "AN" : "AUS");
  loggerConsole.print("Interval: "); loggerConsole.print(cfg.intervalSec); loggerConsole.println(" s");
  loggerConsole.print("MaxDays: "); loggerConsole.println(cfg.maxDays, 2);
  loggerConsole.print("Logs: "); loggerConsole.print(logCount); loggerConsole.print("/"); loggerConsole.println(getMaxSamples());
  loggerConsole.print("Temp: "); loggerConsole.print(tempC, 2); loggerConsole.print(" C raw "); loggerConsole.println(rawTempC, 2);
  loggerConsole.print("Press: "); loggerConsole.print(pressureHpa, 2); loggerConsole.print(" hPa raw "); loggerConsole.println(rawPressureHpa, 2);
  loggerConsole.print("TOff: "); loggerConsole.println(cfg.tempOffsetC, 2);
  loggerConsole.print("POff: "); loggerConsole.println(cfg.pressureOffsetHpa, 2);
  loggerConsole.print("DisplayTimeout: "); loggerConsole.println(cfg.displayTimeoutSec);
  loggerConsole.print("WakeDisplay: "); loggerConsole.println(cfg.wakeDisplaySec);
  loggerConsole.print("USB Auto: "); loggerConsole.println(cfg.usbAutoNormal ? "AN" : "AUS");
  loggerConsole.print("USB Window: "); loggerConsole.println(cfg.usbWindowSec);
  loggerConsole.print("WebGUI: "); loggerConsole.print(cfg.webEnabled ? "enabled" : "disabled"); loggerConsole.print(" / "); loggerConsole.println(webRunning ? "running" : "stopped");
  loggerConsole.print("Web IP: "); loggerConsole.println(webIpInfo());
  loggerConsole.print("Web User: "); loggerConsole.println(cfg.webUser);
  loggerConsole.println("============================");
  printStatusData();
  loggerConsole.println();
}

void printStorage() {
  loggerConsole.println();
  loggerConsole.println("========== SPEICHER ==========");
  loggerConsole.print("LittleFS total KB: "); loggerConsole.println(LittleFS.totalBytes() / 1024.0f, 1);
  loggerConsole.print("LittleFS used  KB: "); loggerConsole.println(LittleFS.usedBytes() / 1024.0f, 1);
  loggerConsole.print("Local log KB: "); loggerConsole.println(getFileSize(LOCAL_LOG_FILE) / 1024.0f, 1);
  loggerConsole.println("==============================");
  printStatusData();
  loggerConsole.println();
}

void scanI2C() {
  loggerConsole.println();
  loggerConsole.println("I2C Scan:");
  for (uint8_t addr = 1; addr < 127; addr++) {
    Wire.beginTransmission(addr);
    uint8_t err = Wire.endTransmission();
    if (err == 0) {
      loggerConsole.print("  0x");
      if (addr < 16) loggerConsole.print("0");
      loggerConsole.print(addr, HEX);
      if (addr == 0x3C) loggerConsole.print(" OLED");
      if (addr == 0x76) loggerConsole.print(" BMP280");
      loggerConsole.println();
    }
  }
  loggerConsole.println();
}

void printPending() {
  loggerConsole.println("Pending:");
  for (int i = 0; i < MAX_PENDING; i++) {
    if (!pendingNodes[i].used) continue;
    loggerConsole.print("  ");
    loggerConsole.print(pendingNodes[i].id);
    loggerConsole.print(" FW=");
    loggerConsole.print(pendingNodes[i].fw);
    loggerConsole.print(" MAC=");
    loggerConsole.print(macToString(pendingNodes[i].mac));
    loggerConsole.print(" age=");
    loggerConsole.print((millis() - pendingNodes[i].lastSeenMs) / 1000);
    loggerConsole.println("s");
  }
}

void printTrustList() {
  loggerConsole.println("Trusted:");
  for (int i = 0; i < MAX_TRUSTED; i++) {
    if (!trusted[i].used) continue;
    loggerConsole.print("  ");
    loggerConsole.print(trusted[i].id);
    loggerConsole.print(" NAME=");
    loggerConsole.print(trusted[i].name);
    loggerConsole.print(" MAC=");
    loggerConsole.print(macToString(trusted[i].mac));
    loggerConsole.print(" LastLog=");
    loggerConsole.print(trusted[i].lastLog);
    loggerConsole.print(" Packets=");
    loggerConsole.println(trusted[i].packets);
  }
}

void pairAddCommand(String id, String codeText) {
  id.trim(); id.toUpperCase(); codeText.trim();

  if (id.length() != 10) {
    loggerConsole.println("PAIRADD Fehler: ID muss 10 Zeichen haben.");
    return;
  }

  int pidx = findPendingById(id.c_str());
  if (pidx < 0) {
    loggerConsole.println("PAIRADD Fehler: Node nicht pending.");
    return;
  }

  uint32_t entered = codeText.toInt();
  uint32_t expected = pairingCodeFor(pendingNodes[pidx].id, pendingNodes[pidx].mac);

  if (entered != expected) {
    loggerConsole.println("PAIRADD Fehler: Code falsch.");
    loggerConsole.print("PAIRFAIL,");
    loggerConsole.println(id);
    return;
  }

  int tidx = findTrustedById(id.c_str());
  if (tidx < 0) tidx = freeTrustedSlot();
  if (tidx < 0) {
    loggerConsole.println("PAIRADD Fehler: Trusted voll.");
    return;
  }

  trusted[tidx].used = true;
  strncpy(trusted[tidx].id, pendingNodes[pidx].id, 10);
  trusted[tidx].id[10] = 0;
  memcpy(trusted[tidx].mac, pendingNodes[pidx].mac, 6);
  strncpy(trusted[tidx].name, "Node", sizeof(trusted[tidx].name)-1);
  trusted[tidx].lastLog = 0;
  trusted[tidx].packets = 0;
  trusted[tidx].lastSeenMs = millis();
  saveTrusted(tidx);

  if(esp_now_is_peer_exist(trusted[tidx].mac)) esp_now_del_peer(trusted[tidx].mac);

  sendPairAccept(pendingNodes[pidx], entered);
  delay(80);
  sendPairAccept(pendingNodes[pidx], entered);
  delay(80);
  sendPairAccept(pendingNodes[pidx], entered);

  delay(80);
  if(esp_now_is_peer_exist(trusted[tidx].mac)) esp_now_del_peer(trusted[tidx].mac);
  if(!addEncryptedPeer(trusted[tidx].mac,trusted[tidx].id,trusted[tidx].mac)) printErr("pair","Peer-Limit erreicht");
  mqttDiscoverySent=false;
  pendingNodes[pidx].used = false;

  loggerConsole.print("PAIRED,");
  loggerConsole.print(trusted[tidx].id);
  loggerConsole.print(",");
  loggerConsole.println(macToString(trusted[tidx].mac));
}

void removeTrusted(String id) {
  id.trim(); id.toUpperCase();
  int idx = findTrustedById(id.c_str());
  if (idx < 0) {
    loggerConsole.println("Nicht gefunden.");
    return;
  }
  memset(&trusted[idx], 0, sizeof(TrustedNode));
  saveTrusted(idx);
  loggerConsole.print("TRUSTREMOVED,");
  loggerConsole.println(id);
}

void renameTrusted(String rest) {
  rest.trim();
  int sp = rest.indexOf(' ');
  if (sp < 0) {
    loggerConsole.println("Syntax: rename <ID> <NAME>");
    return;
  }
  String id = rest.substring(0, sp);
  String name = rest.substring(sp + 1);
  id.toUpperCase();
  name.trim();

  int idx = findTrustedById(id.c_str());
  if (idx < 0) {
    loggerConsole.println("Node nicht gefunden.");
    return;
  }

  memset(trusted[idx].name, 0, sizeof(trusted[idx].name));
  strncpy(trusted[idx].name, name.c_str(), sizeof(trusted[idx].name)-1);
  saveTrusted(idx);

