slawa01de-prog/ESP32-BMP280-Datenlogger/Esp32_LCD_Datalogger/Esp32_LCD_Datalogger.ino
  loggerConsole.print("RENAMED,");
  loggerConsole.print(id);
  loggerConsole.print(",");
  loggerConsole.println(trusted[idx].name);
}

void handleSetCommand(String cmd) {
  String lowerCmd = cmd;
  lowerCmd.toLowerCase();
  if (lowerCmd.startsWith("set mode sensor")) {
    cfg.mode = MODE_SENSOR;
    if (cfg.powerMode == POWER_DEEP) cfg.powerMode = POWER_NORMAL;
    saveConfig();
    printAck("set mode sensor", "Mode SENSOR gespeichert. Reboot");
    delay(300); ESP.restart();
    return;
  }
  if (cmd.startsWith("set mode gateway")) {
    cfg.mode = MODE_GATEWAY;
    cfg.powerMode = POWER_NORMAL;
    saveConfig();
    printAck("set mode gateway", "Mode GATEWAY gespeichert. Reboot");
    delay(300); ESP.restart();
    return;
  }
  if (cmd.startsWith("set mode hybrid")) {
    cfg.mode = MODE_HYBRID;
    cfg.powerMode = POWER_NORMAL;
    cfg.liveOutput = true;
    saveConfig();
    printAck("set mode hybrid", "Mode HYBRID gespeichert. Reboot");
    delay(300); ESP.restart();
    return;
  }
  if (cmd.startsWith("set interval ")) {
    uint32_t sec = cmd.substring(13).toInt();
    if (sec < 1) sec = 1;
    if (sec > 3600) sec = 3600;
    cfg.intervalSec = sec;
    saveConfig();
    printAck("set interval", String(cfg.intervalSec) + "s");
    printStatusData();
    return;
  }
  if (cmd.startsWith("set maxdays ")) {
    float d = parseFloatValue(cmd.substring(12));
    if (d < 0.1f) d = 0.1f;
    if (d > 7.0f) d = 7.0f;
    cfg.maxDays = d;
    saveConfig();
    printAck("set maxdays", String(cfg.maxDays, 2));
    printStatusData();
    return;
  }
  if (cmd.startsWith("set temp_offset ")) {
    cfg.tempOffsetC = parseFloatValue(cmd.substring(16));
    saveConfig();
    readSensor();
    printAck("set temp_offset", String(cfg.tempOffsetC, 2));
    return;
  }
  if (cmd.startsWith("set press_offset ")) {
    cfg.pressureOffsetHpa = parseFloatValue(cmd.substring(17));
    saveConfig();
    readSensor();
    printAck("set press_offset", String(cfg.pressureOffsetHpa, 2));
    return;
  }
  if (cmd.startsWith("set name ")) {
    String n = cmd.substring(9);
    n.trim();
    memset(cfg.nodeName, 0, sizeof(cfg.nodeName));
    strncpy(cfg.nodeName, n.c_str(), sizeof(cfg.nodeName)-1);
    saveConfig();
    printAck("set name", String(cfg.nodeName));
    return;
  }
  if (cmd == "set power normal") {
    cfg.powerMode = POWER_NORMAL;
    cfg.liveOutput = true;
    cfg.displayTimeoutSec = 0;
    displayOn = true;
    if (oledOk) oled.setPowerSave(0);
    lastUserActionMs = millis();
    applyPowerMode();
    printAck("set power normal", "Display dauerhaft AN");
    printStatusData();
    return;
  }
  if (cmd == "set power eco") {
    cfg.powerMode = POWER_ECO; cfg.liveOutput = false; applyPowerMode(); printAck("set power eco"); printStatusData(); return;
  }
  if (cmd == "set power deep") {
    cfg.powerMode = POWER_DEEP; cfg.liveOutput = false; applyPowerMode();
    printAck("set power deep", "Deep aktiv");
    loggerConsole.println("Deep aktiv. Gehe schlafen...");
    delay(500);
    enterDeepSleepNow("Terminal deep on");
    return;
  }
  if (cmd.startsWith("set display_timeout ")) {
    int t = cmd.substring(20).toInt();
    if (t < 0) t = 0;
    if (t > 600) t = 600;
    cfg.displayTimeoutSec = t;
    saveConfig();
    printAck("set display_timeout", String(cfg.displayTimeoutSec));
    return;
  }
  if (cmd.startsWith("set wake_display ")) {
    int t = cmd.substring(17).toInt();
    if (t < 5) t = 5;
    if (t > 300) t = 300;
    cfg.wakeDisplaySec = t;
    saveConfig();
    printAck("set wake_display", String(cfg.wakeDisplaySec));
    return;
  }
  if (cmd == "set usb_auto_normal on") { cfg.usbAutoNormal = true; saveConfig(); printAck("set usb_auto_normal", "on"); return; }
  if (cmd == "set usb_auto_normal off") { cfg.usbAutoNormal = false; saveConfig(); printAck("set usb_auto_normal", "off"); return; }
  if (cmd.startsWith("set usb_window ")) {
    int t = cmd.substring(15).toInt();
    if (t < 0) t = 0;
    if (t > 30) t = 30;
    cfg.usbWindowSec = t;
    saveConfig();
    printAck("set usb_window", String(cfg.usbWindowSec));
    return;
  }
  if (cmd == "set live on") { cfg.liveOutput = true; cfg.powerMode = POWER_NORMAL; saveConfig(); printAck("set live", "on"); return; }
  if (cmd == "set live off") { cfg.liveOutput = false; saveConfig(); printAck("set live", "off"); return; }

  if (cmd == "set graph_hours 1" || cmd == "set graph_hours 6" || cmd == "set graph_hours 12" || cmd == "set graph_hours 24") {
    int hours=cmd.substring(16).toInt();
    for(uint8_t i=0;i<4;i++) if(graphHours[i]==hours) cfg.graphWindow=i;
    saveConfig(); printAck("set graph_hours",String(hours)); return;
  }
  if (cmd == "set graph temp") { cfg.graphMode = 0; saveConfig(); printAck("set graph", "temp"); return; }
  if (cmd == "set graph press") { cfg.graphMode = 1; saveConfig(); printAck("set graph", "press"); return; }

  if (cmd.startsWith("set contrast ")) {
    int c = cmd.substring(13).toInt();
    if (c < 0) c = 0;
    if (c > 255) c = 255;
    cfg.contrast = c;
    if (oledOk) oled.setContrast(cfg.contrast);
    saveConfig();
    printAck("set contrast", String(cfg.contrast));
    return;
  }

  if (cmd == "set screen auto") { cfg.screenMode = 0; saveConfig(); printAck("set screen", "auto"); return; }
  if (cmd == "set screen main") { cfg.screenMode = 1; saveConfig(); printAck("set screen", "main"); return; }
  if (cmd == "set screen gauge") { cfg.screenMode = 2; saveConfig(); printAck("set screen", "gauge"); return; }
  if (cmd == "set screen graph") { cfg.screenMode = 3; saveConfig(); printAck("set screen", "graph"); return; }
  if (cmd == "set screen pressure") { cfg.screenMode = 4; saveConfig(); printAck("set screen", "pressure"); return; }
  if (cmd == "set screen log") { cfg.screenMode = 5; saveConfig(); printAck("set screen", "log"); return; }
  if (cmd == "set screen cal") { cfg.screenMode = 6; saveConfig(); printAck("set screen", "cal"); return; }
  if (cmd == "set screen net") { cfg.screenMode = 7; saveConfig(); printAck("set screen", "net"); return; }
  if (cmd == "set screen power") { cfg.screenMode = 8; saveConfig(); printAck("set screen", "power"); return; }

  if (lowerCmd == "set lang de" || lowerCmd == "set language de") {
    cfg.language = 0;
    saveConfig();
    setEvent("Sprache: DE");
    printAck("set lang", "de");
    printStatusData();
    return;
  }
  if (lowerCmd == "set lang en" || lowerCmd == "set language en") {
    cfg.language = 1;
    saveConfig();
    setEvent("Language: EN");
    printAck("set lang", "en");
    printStatusData();
    return;
  }

  if (lowerCmd == "set web on") { cfg.webEnabled = true; saveConfig(); setupWebIfAllowed(); printAck("set web", "on"); printStatusData(); return; }
  if (lowerCmd == "set web off") { cfg.webEnabled = false; saveConfig(); stopWebServer(); printAck("set web", "off"); printStatusData(); return; }
  if (lowerCmd.startsWith("set webuser ")) { String u = cmd.substring(12); u.trim(); if (u.length()<1 || u.length()>16) { printErr("set webuser", "1-16 Zeichen"); return; } memset(cfg.webUser,0,sizeof(cfg.webUser)); strncpy(cfg.webUser,u.c_str(),sizeof(cfg.webUser)-1); saveConfig(); printAck("set webuser", "OK"); return; }
  if (lowerCmd.startsWith("set webpass ")) { String p = cmd.substring(12); p.trim(); if (p.length()<1 || p.length()>32) { printErr("set webpass", "1-32 Zeichen"); return; } memset(cfg.webPass,0,sizeof(cfg.webPass)); strncpy(cfg.webPass,p.c_str(),sizeof(cfg.webPass)-1); saveConfig(); printAck("set webpass", "OK"); return; }
  if (lowerCmd.startsWith("set wifi_ssid ")) { String s = cmd.substring(14); s.trim(); if (s.length()>32) { printErr("set wifi_ssid", "max 32 Zeichen"); return; } memset(cfg.wifiSsid,0,sizeof(cfg.wifiSsid)); strncpy(cfg.wifiSsid,s.c_str(),sizeof(cfg.wifiSsid)-1); saveConfig(); printAck("set wifi_ssid", "OK"); return; }
  if (lowerCmd.startsWith("set wifi_pass ")) { String p = cmd.substring(14); p.trim(); if (p.length()>64) { printErr("set wifi_pass", "max 64 Zeichen"); return; } memset(cfg.wifiPass,0,sizeof(cfg.wifiPass)); strncpy(cfg.wifiPass,p.c_str(),sizeof(cfg.wifiPass)-1); saveConfig(); printAck("set wifi_pass", "OK"); return; }
  if (lowerCmd.startsWith("set webhost ")) { String h = cmd.substring(12); h.trim(); h.toLowerCase(); if (h.length()<1 || h.length()>32) { printErr("set webhost", "1-32 Zeichen"); return; } memset(cfg.webHost,0,sizeof(cfg.webHost)); strncpy(cfg.webHost,h.c_str(),sizeof(cfg.webHost)-1); saveConfig(); printAck("set webhost", String(cfg.webHost)); return; }


  if(lowerCmd.startsWith("set mqtt")) {
    String rest=cmd.substring(4); int split=rest.indexOf(' ');
    String key=split<0 ? rest : rest.substring(0,split); key.toLowerCase();
    String value=split<0 ? "" : rest.substring(split+1);
    bool known=true;
    if(key=="mqtt" || key=="mqtt_discovery") {
      String v=value; v.toLowerCase();
      if(v!="on" && v!="off") { printErr("mqtt","on/off erwartet"); return; }
      if(key=="mqtt") cfg.mqttEnabled=(v=="on"); else cfg.mqttDiscovery=(v=="on");
    } else if(key=="mqtt_port") {
      long port=value.toInt(); if(port<1 || port>65535) { printErr("mqtt","Port 1-65535"); return; } cfg.mqttPort=port;
    } else {
      char *target=nullptr; size_t capacity=0;
      if(key=="mqtt_host") {target=cfg.mqttHost; capacity=sizeof(cfg.mqttHost);}
      else if(key=="mqtt_user") {target=cfg.mqttUser; capacity=sizeof(cfg.mqttUser);}
      else if(key=="mqtt_pass") {target=cfg.mqttPass; capacity=sizeof(cfg.mqttPass);}
      else if(key=="mqtt_prefix") {target=cfg.mqttPrefix; capacity=sizeof(cfg.mqttPrefix); value=mqttSanitize(value);}
      else known=false;
      if(target) { if(value.length()>=capacity) { printErr("mqtt","Wert zu lang"); return; } memset(target,0,capacity); strncpy(target,value.c_str(),capacity-1); }
    }
    if(!known) { printErr("mqtt","Unbekannte Einstellung"); return; }
    mqttDisconnect(); mqttDiscoverySent=false; saveConfig(); printAck("mqtt","Gespeichert"); return;
  }
  printErr("set", "Unbekannter set-Befehl");
}

