slawa01de-prog/ESP32-BMP280-Datenlogger/Esp32_LCD_Datalogger/Esp32_LCD_Datalogger.ino
void handleCalCommand(String cmd) {
  if (cmd.startsWith("cal temp ")) {
    float realT = parseFloatValue(cmd.substring(9));
    if (isnan(rawTempC)) { loggerConsole.println("Keine Roh-Temp."); return; }
    cfg.tempOffsetC = realT - rawTempC;
    saveConfig();
    readSensor();
    printAck("cal temp", String(cfg.tempOffsetC, 2));
    return;
  }
  if (cmd.startsWith("cal press ")) {
    float realP = parseFloatValue(cmd.substring(10));
    if (isnan(rawPressureHpa)) { loggerConsole.println("Kein Roh-Druck."); return; }
    cfg.pressureOffsetHpa = realP - rawPressureHpa;
    saveConfig();
    readSensor();
    printAck("cal press", String(cfg.pressureOffsetHpa, 2));
    return;
  }
}

void handleSerial() {
  static String pending;
  bool complete=false;
  for(int n=0;n<128 && Serial.available();n++) {
    char c=(char)Serial.read();
    if(c=='\n') { complete=true; break; }
    if(c!='\r') pending+=c;
    if(pending.length()>512) { pending=""; printErr("serial","Befehl zu lang"); return; }
  }
  if(!complete) return;
  String cmd=pending; pending="";
  cmd = cleanInput(cmd);
  String lower = cmd;
  lower.toLowerCase();

  if(lower.startsWith("time ")) {
    uint64_t seconds=strtoull(cmd.substring(5).c_str(),nullptr,10);
    if(seconds>=1700000000ULL && seconds<4102444800ULL) { struct timeval tv={(time_t)seconds,0}; settimeofday(&tv,nullptr); printAck("time","UTC synchronisiert"); }
    else printErr("time","Ungueltige Unixzeit");
  }
  else if(lower.startsWith("sync ")) startSync(cmd.substring(5));
  else if(lower=="formatfs confirm") { if(syncFile) syncFile.close(); syncSlot=-2; if(dumpStream) dumpStream.close(); radioCursor=0; radioWaiting=false; fsReady=LittleFS.format() && LittleFS.begin(false); storageFault=!fsReady; storageMessage=fsReady?"OK":"FS FEHLER"; logCount=0; printAck("formatfs",storageMessage); }
  else if (lower == "help") printHelp();
  else if (lower == "status") printStatus();
  else if (lower == "storage") printStorage();
  else if (lower == "scan") scanI2C();
  else if (lower == "reboot") ESP.restart();
  else if (lower == "start") { cfg.loggingEnabled = true; saveConfig(); printAck("start", "Logging gestartet"); printStatusData(); }
  else if (lower == "stop") { cfg.loggingEnabled = false; saveConfig(); printAck("stop", "Logging gestoppt"); printStatusData(); }
  else if (lower == "once") { readSensor(); logLocal(true); sendDataPacket(); printStatusData(); }
  else if (lower == "clear") clearLocalLog();
  else if (lower == "resetstats") resetStats();
  else if (lower == "wake") wakeDisplay("Terminal");
  else if (lower == "dump local") dumpFile(LOCAL_LOG_FILE);
  else if (lower == "dump legacy") dumpFile("/local_log.csv");
  else if (lower.startsWith("dump ")) {
    String id = cmd.substring(5);
    id.trim(); id.toUpperCase();
    String fn = "/v74_" + id + ".csv";
    dumpFile(fn);
  }
  else if (lower == "web status") printWebStatus();
  else if (lower == "web resetpass") { memset(cfg.webUser, 0, sizeof(cfg.webUser)); memset(cfg.webPass, 0, sizeof(cfg.webPass)); strncpy(cfg.webUser, "admin", sizeof(cfg.webUser)-1); strncpy(cfg.webPass, "admin", sizeof(cfg.webPass)-1); saveConfig(); printAck("web resetpass", "admin/admin"); printStatusData(); }
  else if (lower == "mqtt status") printMqttStatus();
  else if (lower == "mqtt discovery") { mqttDiscoverySent = false; mqttPublishDiscoveryAll(); printMqttStatus(); }
  else if (lower == "mqtt publish") { mqttPublishLocalState(true); printMqttStatus(); }
  else if (lower.startsWith("set ")) handleSetCommand(cmd);
  else if (lower.startsWith("cal ")) handleCalCommand(cmd);
  else if (lower == "defaults") { factoryDefaults(); ESP.restart(); }
  else if (lower == "pair on") { cfg.pairMode = true; saveConfig(); printAck("pair", "on"); }
  else if (lower == "pair off") { cfg.pairMode = false; saveConfig(); printAck("pair", "off"); }
  else if (lower == "pair code") showPairCodeSerial();
  else if (lower == "pair reset") pairReset();
  else if (lower.startsWith("pair add ")) {
    String rest = cmd.substring(9);
    rest.trim();
    int sp = rest.indexOf(' ');
    if (sp < 0) loggerConsole.println("Syntax: pair add <ID> <CODE>");
    else pairAddCommand(rest.substring(0, sp), rest.substring(sp + 1));
  }
  else if (lower == "pending") printPending();
  else if (lower == "trust list" || lower == "nodes") printTrustList();
  else if (lower.startsWith("trust remove ")) removeTrusted(cmd.substring(13));
  else if (lower.startsWith("rename ")) renameTrusted(cmd.substring(7));
  else loggerConsole.println("Unbekannter Befehl. help eingeben.");
}

// --------------------------------------------------
// Setup / Loop
// --------------------------------------------------
void setup() {
  Serial.begin(115200);
  Serial.setTimeout(80);
#if ARDUINO_USB_CDC_ON_BOOT && ARDUINO_USB_MODE
  // HWCDC otherwise waits repeatedly when the PC keeps USB powered but stops reading.
  Serial.setTxTimeoutMs(0);
#endif
  delay(400);

  wakeCause = esp_sleep_get_wakeup_cause();

  pinMode(PIN_ENC_A, INPUT_PULLUP);
  pinMode(PIN_ENC_B, INPUT_PULLUP);
  pinMode(PIN_ENC_PUSH, INPUT_PULLUP);
  pinMode(PIN_BAK, INPUT_PULLUP);
  pinMode(PIN_CONTR, INPUT_PULLUP);

  delay(50);
  btnPush.stableState = digitalRead(btnPush.pin);
  btnPush.lastRawState = btnPush.stableState;
  btnBak.stableState = digitalRead(btnBak.pin);
  btnBak.lastRawState = btnBak.stableState;
  btnCon.stableState = digitalRead(btnCon.pin);
  btnCon.lastRawState = btnCon.stableState;
  lastEncoderState = readEncoderState();

  for (uint8_t i = 0; i < HISTORY_SIZE; i++) {
    tempHistory[i] = NAN;
    pressHistory[i] = NAN;
  }

  WiFi.mode(WIFI_STA);
  loadConfig();
  if(rtcMagic!=0x74304C47 || wakeCause==ESP_SLEEP_WAKEUP_UNDEFINED) { rtcMagic=0x74304C47; sessionId=esp_random(); sampleSequence=0; elapsedBaseMs=0; radioCursor=0; }
  loadTrusted();
  rxQueue=xQueueCreate(12,sizeof(RxEnvelope));

  Wire.begin(I2C_SDA_PIN, I2C_SCL_PIN);
  Wire.setClock(100000);

  fsReady=LittleFS.begin(false);
  if (!fsReady) {
    storageFault=true; storageMessage="FS FEHLER";
    loggerConsole.println("LittleFS Fehler.");
  }

  oled.setI2CAddress(OLED_ADDR_8BIT);
  oledOk = oled.begin();
  if (oledOk) {
    oled.setContrast(cfg.contrast);
    displayOn = !(cfg.powerMode==POWER_DEEP && wakeCause==ESP_SLEEP_WAKEUP_TIMER);
    oled.setPowerSave(displayOn ? 0 : 1);
  }

  bmpOk = initBMP280();

