slawa01de-prog/ESP32-BMP280-Datenlogger/Esp32_LCD_Datalogger/Esp32_LCD_Datalogger.ino
  ensureLocalLogHeader();
  if(wakeCause!=ESP_SLEEP_WAKEUP_UNDEFINED && cachedLogBytes==getFileSize(LOCAL_LOG_FILE)) logCount=cachedLogRows;
  else logCount=countLocalLogRows();
  cachedLogRows=logCount; cachedLogBytes=getFileSize(LOCAL_LOG_FILE);

  initEspNow();
  esp_now_register_recv_cb(onRecv);

  if (isGatewayRole()) {
    for (int i = 0; i < MAX_TRUSTED; i++) {
      if (trusted[i].used) addEncryptedPeer(trusted[i].mac, trusted[i].id, trusted[i].mac);
    }
  }

  if (isSensorRole() && cfg.paired) {
    uint8_t ownMac[6];
    WiFi.macAddress(ownMac);
    addEncryptedPeer(cfg.gatewayMac, cfg.nodeId, ownMac);
  }

  setupWebIfAllowed();

  // Deep Timer: ohne Display messen/loggen/senden/schlafen
  if (cfg.powerMode == POWER_DEEP && wakeCause == ESP_SLEEP_WAKEUP_TIMER && isSensorRole() && bmpOk) {
    deepTimerWakeJobAndSleep();
  }

  if (oledOk) drawStartupScreen();

  if (bmpOk) readSensor();
  else if (isSensorRole()) drawErrorScreen("BMP280 fehlt", "I2C 0x76 pruefen");

  applyPowerMode();

  if (cfg.powerMode == POWER_DEEP && cfg.usbAutoNormal && waitForUsbNormalWindow(cfg.usbWindowSec)) {
    cfg.powerMode = POWER_NORMAL;
    cfg.liveOutput = true;
    applyPowerMode();
    loggerConsole.println("USB erkannt -> Normalmodus");
  }

  if (cfg.powerMode == POWER_DEEP && wakeCause == ESP_SLEEP_WAKEUP_GPIO) {
    lastUserActionMs = millis();
    displayOn = true;
    if (oledOk) oled.setPowerSave(0);
    loggerConsole.println("Button Wake -> Bedienung aktiv.");
  }

  if (oledOk && displayOn) updateDisplay();

  loggerConsole.println();
  loggerConsole.println("==================================");
  loggerConsole.println(" BMP280 LOGGER V7.4.3 WEBGUI OTA MQTT");
  loggerConsole.println("==================================");
  printStatus();
  // Full help is available on request; do not flood USB during startup.

  if (cfg.mode == MODE_SENSOR && (cfg.pairMode || !cfg.paired)) {
    showPairCodeSerial();
    sendPairRequest();
  }

  lastReadMs = millis();
  lastLogMs = millis();
  lastDisplayMs = millis();
  lastAutoPageMs = millis();
  lastUserActionMs = millis();
  lastPairBroadcastMs = millis();
}

void loop() {
  loggerConsole.pump(Serial);
  handleSerial();
  processRadioQueue();
  serviceRadioSpool();
  serviceTransfers();
  handleWeb();
  handleMqtt();

  updateEncoder();
  updateButton(btnPush);
  updateButton(btnBak);
  updateButton(btnCon);
  handleUiInput();

  unsigned long now = millis();
  if(isSensorRole() && !bmpOk && now-lastSensorRetryMs>=5000) { lastSensorRetryMs=now; bmpOk=initBMP280(); if(bmpOk) readSensor(); }

  if (isSensorRole() && bmpOk && now - lastReadMs >= 1000) {
    lastReadMs = now;
    readSensor();
  }

  if (isSensorRole() && bmpOk && cfg.powerMode != POWER_DEEP && now - lastLogMs >= cfg.intervalSec * 1000UL) {
    lastLogMs = now;
    logLocal(false);
    sendDataPacket();
  }

  if (cfg.mode == MODE_SENSOR && (cfg.pairMode || !cfg.paired) && now - lastPairBroadcastMs > 5000) {
    lastPairBroadcastMs = now;
    if(WiFi.status()!=WL_CONNECTED && cfg.mode==MODE_SENSOR) { radioChannel=radioChannel%13+1; esp_wifi_set_channel(radioChannel,WIFI_SECOND_CHAN_NONE); }
    sendPairRequest();
  }

  if (displayOn && oledOk && now - lastDisplayMs >= 200) {
    lastDisplayMs = now;
    updateDisplay();
  }

  maybeSleepDisplay();
  maybeReturnToDeepAfterButtonWake();
  loggerConsole.pump(Serial);
}
